[
  {
    "title": "ENIAC, the world s first general-purpose digital computer, turns 80 years old today legendary hulking machine was 1,000x faster than its nearest rival",
    "summary": "The Electronic Numerical Integrator and Computer (ENIAC) was unveiled to the public today in 1946.",
    "link": "https://www.tomshardware.com/tech-industry/eniac-the-worlds-first-general-purpose-digital-computer-turns-80-years-old-today-legendary-hulking-machine-was-1-000x-faster-than-its-nearest-rival",
    "categories": [
      "Tech News"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-15T18:20:49.467262"
  },
  {
    "title": "AMD Ryzen 7 9850X3D vs Ryzen 7 9800X3D faceoff an extra $30 buys you very little performance",
    "summary": "The Ryzen 7 9850X3D and Ryzen 7 9800X3D are the fastest gaming CPUs around, but which one is better? We tested both in a head-to-head gauntlet on in games, productivity apps, overclocked scenarios, and more to find out.",
    "link": "https://www.tomshardware.com/pc-components/cpus/amd-ryzen-7-9850x3d-vs-ryzen-7-9800x3d",
    "categories": [
      "GPUs",
      "Hardware"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-15T18:20:49.467613"
  },
  {
    "title": "Steam to add hardware specs to reviews optional feature could help you dodge poorly optimized games",
    "summary": "Steam revealed in its Client Beta patch notes that it will let users show the specifications of their hardware when leaving reviews. This should help other players considering a title see if the feedback was affected by the reviewer's hardware, although Valve says that this feature remains optional.",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/steam-to-add-hardware-specs-to-reviews-optional-feature-could-help-you-dodge-poorly-optimized-games",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 25,
    "processed_date": "2026-02-15T18:20:49.470225"
  },
  {
    "title": "Framework's latest update brings more bad news about memory and storage pricing crisis RAM costs increased to $12 to $16 per GB, recommends purchasing some models elsewhere for Framework Laptop DIY Edition customers",
    "summary": "Framework said that it's releasing a monthly update to monitor the memory chip situation and also announced that it will try to keep its RAM pricing as close as possible to the weighted average of its costs.",
    "link": "https://www.tomshardware.com/laptops/framework-releases-monthly-update-about-memory-and-storage-pricing-woes-ram-costs-increased-to-usd12-to-usd16-per-gb-recommends-purchasing-some-models-elsewhere-for-framework-laptop-diy-edition-customers",
    "categories": [
      "AI & ML",
      "Semiconductors"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-15T18:20:49.470536"
  },
  {
    "title": "Asus ROG Crosshair X870E Dark Hero Motherboard Review",
    "summary": "Asus ROG Crosshair X870E Dark Hero swoops into the market as a high-end AMD motherboard with premium features, solid performance in our testing, and a fantastic all-black aesthetic.",
    "link": "https://www.tomshardware.com/pc-components/motherboards/asus-rog-crosshair-x870e-dark-hero-motherboard-review",
    "categories": [
      "AI & ML",
      "Hardware"
    ],
    "quality_score": 15,
    "processed_date": "2026-02-15T18:20:49.471017"
  },
  {
    "title": "WD Green SN3000 1TB SSD Review: A diamond in the rough",
    "summary": "The WD Green SN3000 repudiates the reputation of its drive line by delivering surprisingly good performance.",
    "link": "https://www.tomshardware.com/pc-components/ssds/wd-green-sn3000-1tb-ssd-review",
    "categories": [
      "Tech News"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-15T18:20:49.471494"
  },
  {
    "title": "OpenAI launches GPT-5.3-Codex-Spark on Cerebras chips marks AI giants first production deployment away from Nvidia",
    "summary": "OpenAI on Thursday released GPT-5.3-Codex-Spark, its first AI model served on chips from Cerebras Systems, marking the ChatGPT maker s first production deployment on non-Nvidia silicon.",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/openai-lauches-gpt-53-codes-spark-on-cerebras-chips",
    "categories": [
      "AI & ML",
      "Tech News"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-15T18:20:49.472412"
  },
  {
    "title": "Tachyum forced to shutter R&D office due to unpaid rent, wages, and taxes firm still claims forthcoming Prodigy chip will have a 21x performance leap on Nvidia Rubin Ultra",
    "summary": "Tachyum forced to vacate R&D office due to unpaid rent, wages, and taxes",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/tachyum-forced-to-shutter-r-and-d-office-due-to-unpaid-rent-wages-and-taxes-firm-still-claims-forthcoming-prodigy-chip-will-have-a-21x-performance-leap-on-nvidia-rubin-ultra",
    "categories": [
      "AI & ML",
      "GPUs"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-15T18:20:49.472721"
  },
  {
    "title": "MyMiniFactory acquires Thingiverse to save 3D printing file sharing from AI Thingverse has eight million users and 2.5 million 'things'",
    "summary": "MyMiniFactory has announced the surprise acquisition of the world s oldest and largest 3D printing file sharing site, Thingiverse.",
    "link": "https://www.tomshardware.com/3d-printing/myminifactory-acquires-thingiverse-to-save-3d-printing-file-sharing-from-ai-thingverse-has-eight-million-users-and-2-5-million-things",
    "categories": [
      "Tech News",
      "AI & ML"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-15T18:20:49.474147"
  },
  {
    "title": "MSI GeForce RTX 5090 Lightning Z review: RTX 5090 Ti, anyone?",
    "summary": "The MSI RTX 5090 Lightning Z unleashes a surprising amount of extra performance from Nvidia s highest-end gaming GPU, thanks to dual power connectors and much higher power limits than the RTX 5090 Founders Edition. We d go so far as to call it the best RTX 5090 yet made.",
    "link": "https://www.tomshardware.com/pc-components/gpus/msi-geforce-rtx-5090-lightning-z-review",
    "categories": [
      "GPUs"
    ],
    "quality_score": 15,
    "processed_date": "2026-02-15T18:20:49.474569"
  },
  {
    "title": "Creality Falcon A1 Pro Review An easy-to-use, fully enclosed 20W laser engraver with a built-in HD camera",
    "summary": "Creality has sent a review sample of the Falcon A1 Pro fully enclosed laser engraver and cutting machine. It s designed to be easy to use out of the box since it s mostly pre-assembled. It is equipped with a 20W blue laser and can engrave and cut a wide variety of materials such as cardboard, wood, bamboo, rubber, leather, fabric, acrylic, plastic, and more. It notably supports cutting 10 mm thick basswood and 8 mm thick black acrylic. The machine can engrave materials at a speed of up to 600 mm/s, and offers smart features such as auto focus, real-time flame detection, and an HD camera for accurate workpiece positioning. It s compatible with a range of laser engraving software, such as LightBurn and LaserGRBL for Windows and macOS, but we ll use Falcon Design Space in this review. Creality Falcon A1 Pro Laser Engraver Specifications Main laser module Laser power 20W [...] The post Creality Falcon A1 Pro Review An easy-to-use, fully enclosed 20W laser engraver with a built-in HD camera appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/15/creality-falcon-a1-pro-review-an-easy-to-use-fully-enclosed-20w-laser-engraver-with-a-built-in-hd-camera/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 25,
    "processed_date": "2026-02-15T18:20:49.474922"
  },
  {
    "title": "Android 17 Beta 1 released with H.266/VVC support, camera improvements, and more",
    "summary": "Google has just announced the release of Android 17 Beta 1 with performance improvements, H.266/VVC video codec support, smoother camera mode transitions, privacy and security enhancements, and more. The company is not releasing Developer Previews anymore, and instead follows the continuous Canary channel announced with the first Android 16 Developer Preview. So, with Android 17, the very first release is the Beta 1 release. Some of the key changes in Android 17 so far: Developers can t opt out of orientation and resizability restrictions on large screen devices (sw > 600 dp), so they ll have to make sure their apps work on tablets, foldables, and desktop windowing environments. With one exception: apps categorized as games with android:appCategory flag. Google published a separate blog post about the change. Performance improvements and tools Lock-free MessageQueue that will reduce missed frames. Added Generational garbage collection to ART s Concurrent Mark-Compact collector. This aims to reduce [...] The post Android 17 Beta 1 released with H.266/VVC support, camera improvements, and more appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/14/android-17-beta-1-released-with-h-266-vvc-support-camera-improvements-and-more/",
    "categories": [
      "Tech News",
      "AI & ML"
    ],
    "quality_score": 25,
    "processed_date": "2026-02-15T18:20:49.475401"
  },
  {
    "title": "STMicroelectronics Stellar P3E quad-core Arm Cortex-R52+ automotive MCU features Neural-ART AI accelerator",
    "summary": "STMicroelectronics has introduced the Stellar P3E, the first automotive MCU with an embedded Neural-ART AI accelerator, designed to simplify X-in-1 Electronic Control Units (ECUs) by consolidating powertrain functions like the inverter, on-board charger (OBC), and DC-DC converter into a single module. The MCU enables smart sensing, predictive maintenance, and virtual sensor applications without the cost and complexity of a separate SoC. The microcontroller features four 500 MHz Arm Cortex-R52+ cores with 19.5 MB of xMemory, which is based on phase-change memory (PCM), offering roughly twice the density of embedded flash. The chip integrates multiple ADC channels for precise sensing, high-resolution PWM down to 102 ps for fine motor control, and 10 timer modules for deterministic real-time operation. Connectivity options include Gigabit Ethernet and CAN-XL, for high-speed, low-latency in-vehicle communication. Stellar P3E (SR6P3EC4/SR6P3EC6) specifications: MCU SR6P3EC4 / SR6P3EC6 CPU Cores 4x Arm Cortex R52+ cores at up to 500 MHz; [...] The post STMicroelectronics Stellar P3E quad-core Arm Cortex-R52+ automotive MCU features Neural-ART AI accelerator appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/13/stmicroelectronics-stellar-p3e-quad-core-arm-cortex-r52-automotive-mcu-features-neural-art-ai-accelerator/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.475780"
  },
  {
    "title": "Avalue EMX-PTLP A thin mini-ITX motherboard powered by up to an Intel Core Ultra 7 358H Panther Lake-H SoC",
    "summary": "Avalue s EMX-PTLP is an industrial, thin mini-ITX motherboard powered by Intel Panther Lake-H Core Ultra (Series 3) family, up to the 12-core Intel Core Ultra 7 358H SoC delivering up to 180 TOPS for AI and industrial automation deployments. The board supports up to 64GB of DDR5 SoDIMM/CSoDIMM memory, features M.2 PCIe 5.0 and PCIe 4.0 sockets for storage and expansion, M.2 E-Key and B-Key sockets for wireless and cellular connectivity, a PCIe x8 slot, HDMI, DisplayPort, USB-C, and LVDS/eDP display interfaces, GbE and 2.5GbE networking interfaces, a range of USB4, USB 3.2, and USB 2.0 interfaces, and more. Avalue EMX-PTLP specifications: SoC Intel Panther Lake processor with Intel Xe LPG graphics (one or the other) Intel Core Ultra 5 322 6-core (2P + 4LPE) CPU at up to 4.4 GHz with 12MB Smart Cache, 2x Xe core Intel Graphics (18 TOPS), AI accelerator (46 TOPS); PBP: 25 Watts [...] The post Avalue EMX-PTLP A thin mini-ITX motherboard powered by up to an Intel Core Ultra 7 358H Panther Lake-H SoC appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/13/avalue-emx-ptlp-a-thin-mini-itx-motherboard-powered-by-up-to-intel-core-ultra-7-358h-panther-lake-h-soc/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.476126"
  },
  {
    "title": "SlimeVR Butterfly Trackers nRF52833-based, ultra-slim, full-body VR trackers offer up to 48h battery life (Crowdfunding)",
    "summary": "Designed by SlimeVR in Rotterdam, Netherlands, the SlimeVR Butterfly Trackers are open-hardware, IMU-based, ultra-slim, full-body VR trackers designed for virtual reality gaming, motion capture, VTubing, and more. The trackers provide full-body positional tracking without base stations, cameras, Wi-Fi, or Bluetooth. Each tracker uses an IMU to measure absolute rotation and transmits data over a custom 2.4 GHz ESB protocol via a dedicated dongle supporting up to 10 trackers, eliminating occlusion issues and router setup. Based on Nordic Semi s nRF52833 wireless MCU, the split butterfly design places the PCB and 90 mAh battery side-by-side to achieve a thickness of under 7 mm and a weight below 10 grams, while a flexible interconnect improves comfort when worn under clothing. The system offers a 100 200 Hz refresh rate, <15 ms latency, over 48 hours of battery life with USB-C charging and OTA firmware updates. SlimeVR Butterfly Trackers specifications: Wireless MCU Nordic nRF52833 CPU [...] The post SlimeVR Butterfly Trackers nRF52833-based, ultra-slim, full-body VR trackers offer up to 48h battery life (Crowdfunding) appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/12/slimevr-butterfly-trackers-nrf52833-based-ultra-slim-full-body-vr-trackers-offer-up-to-48h-battery-life/",
    "categories": [
      "Hardware",
      "Tech News"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.476580"
  },
  {
    "title": "de next-RAP8-EZBOX An ultra-compact, fanless or actively-cooled Intel Core i7-1365UE Raptor Lake embedded system",
    "summary": "AAEON s de next-RAP8-EZBOX is an ultra-compact embedded system powered by an Intel Core i7-1365UE 10-core Raptor Lake SoC paired with 16GB of LPDDR5x system and one M.2 2280 M-Key slot for storage. It s offered as either a 42.5mm thick fanless or a 45.4mm thick actively cooled mini PC. Key interfaces include HDMI 1.4b video output, two Ethernet (2.5GbE + GbE) ports, and two USB 3.0 ports. Its compact size, powerful processor, and range of interfaces make it suitable for space-constrained autonomous systems or industrial robots. de next-RAP8-EZBOX specifications: SoC- Intel Core i7-1365UE 10-core/12-thread Raptor Lake processor up to 1.70 GHz / 4.90 GHz (Turbo) with 96 EU Intel Iris Xe Graphics @ 1.30 GHz; TDP/PBP: 15 Watts System Memory Up to 16GB LPDDR5x Storage NVMe SSD via M.2 2280 M-Key (PCIe x2) socket Video Output HDMI 1.4b up to 1920 x 1080 @ 60Hz Networking Gigabit Ethernet RJ45 [...] The post de next-RAP8-EZBOX An ultra-compact, fanless or actively-cooled Intel Core i7-1365UE Raptor Lake embedded system appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/12/de-next-rap8-ezbox-ultra-compact-fanless-or-actively-cooled-intel-core-i7-1365ue-raptor-lake-embedded-system/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.476925"
  },
  {
    "title": "CHUWI CoreBook Air Plus 16 laptop review Part 1: Specs, unboxing, teardown, and first boot",
    "summary": "It s been a while since we ve tested a laptop, but CHUWI sent us their latest CoreBook AirPlay 16 laptop for review. It s powered by a mid-range AMD Ryzen 5 6600H hexa-core processor, paired with 16GB of LPDDR5 and a 512GB NVMe SSD, and features a 16-inch display with 1920 1200 resolution. I ll start the CoreBook Air Plus 16 review by listing the specifications, going through an unboxing and a teardown to check out the hardware, and finally boot it to the pre-installed Windows 11 Pro. We ll then test it in more detail with Windows 11 Pro and Ubuntu 24.04 or 26.04 (Snapshot 4) in the next parts of the review. CHUWI CoreBook Air Plus 16 specifications SoC AMD Ryzen 5 6600H CPU 6-core/12-thread Zen 3+ Rembrandt processor at up to 3.3 GHz / 4.5GHz (Turbo) GPU AMD Radeon 660M clocked at up to 1,900 MHz with [...] The post CHUWI CoreBook Air Plus 16 laptop review Part 1: Specs, unboxing, teardown, and first boot appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/12/chuwi-corebook-air-plus-16-laptop-review-part-1-specs-unboxing-teardown-and-first-boot/",
    "categories": [
      "Hardware",
      "GPUs"
    ],
    "quality_score": 25,
    "processed_date": "2026-02-15T18:20:49.477786"
  },
  {
    "title": "Open Stack standalone 4G LTE IoT board runs RTOS on Quectel EC200U LTE module (Crowdfunding)",
    "summary": "Open Stack is a standalone 4G LTE IoT connectivity board designed to run RTOS-based C applications directly on the Quectel EC200U series LTE module, meaning you don t need an external MCU like Arduino, ESP32, or Raspberry Pi. By removing the MCU, the board reduces power consumption, bill-of-materials (BOM) cost, and physical footprint. The board supports multi-band LTE with GSM fallback, GNSS, and Bluetooth 4.2, as well as IPv4/IPv6 client and server modes. It also includes a USB Type-C port, a Nano SIM card slot, LTE/GNSS/BLE antenna connectors, an OLED information display, status LEDs, control buttons, and a 40-pin Raspberry Pi HAT-compatible GPIO header. Networking support includes TCP/UDP, SSL/TLS, HTTP/HTTPS, MQTT, LwM2M, CoAP, FTP/FTPS, and PPP, making it suitable for asset tracking, industrial monitoring, BLE-to-LTE gateways, remote infrastructure, and always-connected IoT deployments without additional controller hardware. Open Stack specifications: Cellular Module Quectel EC200U-CN series (EC200UCNAA-N05-SGNSA) module Cellular Connectivity: LTE FDD [...] The post Open Stack standalone 4G LTE IoT board runs RTOS on Quectel EC200U LTE module (Crowdfunding) appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/11/open-stack-standalone-4g-lte-iot-board-runs-rtos-on-quectel-ec200-lte-module/",
    "categories": [
      "Hardware",
      "Tech News"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.478452"
  },
  {
    "title": "VU GPSDR A low-cost GPS-disciplined SDR expansion board for the Vivid Unit RK3399 touchscreen SBC",
    "summary": "UUGear s VU GPSDR is a low-cost GPS-disciplined SDR expansion board designed specifically for the Vivid Unit, a palm-sized Rockchip RK3399-based touchscreen SBC we covered back in 2024. The VU GPSDR is built around the RTL2832U ADC and Rafael Micro R860 tuner, but what makes it different from SDRs like the PhaseLatch Mini and DeepRad SDR is the integration of a u-blox NEO-M8N GPS module. This module provides a GPS-disciplined 24 MHz clock reference to the Si5351 local oscillator, which ensures high frequency stability and timing accuracy that is typically only found in much more expensive SDR hardware. VU GPSDR specifications: Supported Platform UUGear Vivid Unit via Vivid Unit Extender Gen 1/2 (See details below) MCU STM8S003F for board-level controls RF Tuner Rafael Micro R860 ADC Realtek RTL2832U Frequency Range 500 kHz to 1.766 GHz Bandwidth Up to 3.2 MHz (2.4 MHz recommended for stability) HF [...] The post VU GPSDR A low-cost GPS-disciplined SDR expansion board for the Vivid Unit RK3399 touchscreen SBC appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/11/vu-gpsdr-a-low-cost-gps-disciplined-sdr-expansion-board-for-the-vivid-unit-rk3399-touchscreen-sbc/",
    "categories": [
      "Hardware",
      "Semiconductors"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.479257"
  },
  {
    "title": "PicoClaw ultra-lightweight personal AI Assistant runs on just 10MB of RAM",
    "summary": "PicoClaw is an ultra-lightweight personal AI Assistant designed to work on less than 10 MB RAM and suitable for resource-constrained embedded boards such as the Sipeed LicheeRV Nano SBC going for around $15 and powered by a SOPHGO SG2002 RISC-V SoC with 256MB on-chip DDR3. I keep reading news about the OpenClaw personal AI assistant, after first finding out about it when the Cubie A7S SBC was launched. OpenClaw (previously ClawdBot) clears your inbox, sends emails, manages your calendar, and checks you in for flights from WhatsApp, Telegram, or any chat app. It s been shown to run a range of hardware platforms, but it can be resource-intensive, and HKUDS created the nanobot ultra-lightweight personal AI assistant with about ~4,000 lines of Python code, or roughly 99% smaller than Clawdbot s 430k+ lines. PicoClaw further builds on the nanobot project, and has been refactored from the ground up in Go through a [...] The post PicoClaw ultra-lightweight personal AI Assistant runs on just 10MB of RAM appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/10/picoclaw-ultra-lightweight-personal-ai-assistant-run-on-just-10mb-of-ram/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-15T18:20:49.479561"
  },
  {
    "title": "Beelink ME Pro 2-bay Intel N95/N150 NAS and mini PC supports 5GbE networking, up to 3x M.2 MVMe SSDs",
    "summary": "Beelink ME Pro is a compact 2-bay hybrid NAS and Windows 11 mini PC built around Intel N95 (Alder Lake-N) or N150 (Twin Lake) SoC, and equipped with two 3.5-/2.5-inch SATA bays and three M.2 2280 NVMe slots for storage. It also features a DIY drawer design that lets users swap the motherboard for upgrades. The system also features up to 16 GB of LPDDR5 memory, 5 GbE and 2.5 GbE networking, Wi-Fi 6, Bluetooth 5.4, and various I/Os, including USB-C (10 Gbps), USB-A, HDMI 2.0, and a 3.5 mm audio jack. An internal blower-based cooling system, an aluminum chassis with thermal pads, and anti-vibration drive mounts help with improved thermals and noise control. Target applications include home NAS, media server, Proxmox/TrueNAS host, small office file server, lightweight virtualization, backup appliance, and compact desktop PC. Beelink ME Pro specifications: SoC(one or the other) Intel Processor N95 quad-core Alder Lake-N processor [...] The post Beelink ME Pro 2-bay Intel N95/N150 NAS and mini PC supports 5GbE networking, up to 3x M.2 MVMe SSDs appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/10/beelink-me-pro-2-bay-intel-n95-n150-nas-and-mini-pc-supports-5gbe-networking-up-to-3x-m-2-mvme-ssds/",
    "categories": [
      "Hardware"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.479906"
  },
  {
    "title": "TOPST D3-G maker SBC is powered by Telechips TCT8050 Dolphin3 Cortex-A72/A53/R5 automotive-grade SoC",
    "summary": "TOPST D3-G is a single board computer (SBC) powered by a Telechips TCT8050 Dolphin3/3M 9-core automotive-grade SoC with four Cortex-A72 cores, four Cortex-A53 cores, and one real-time Cortex-R5 core. The board features 4GB or 8GB LPDDR4 RAM, 32GB eMMC flash and a microSD card for storage, a Gigabit Ethernet port, a DisplayPort 1.2 connector capable of driving four display through MST, two MIPI CSI connectors, a PCIe Gen3x 1 slot, a few USB ports, a 40-pin GPIO header compatible with Raspberry Pi HAT+, and three CAN Bus interfaces. TOPST D3-G specifications: SoC Telechips TCC8050 (Dolphin3) CPU(45,180 DMIPS ) Quad-core Arm Cortex-A72 @ 1.69 GHz, 31,840 DMIPS Quad-core Arm Cortex-A53 @1.45 GHz, 13,340 DMIPS Real-time MCU core Arm Cortex-R5 @ 600 MHz GPU Imagination Technologies PowerVR 9XTP (GT9524) delivering up to 168 GFLOPS; Supported APIs: OpenGL ES 1.1 / 2.0 / 3.2, Vulkan 1.2, OpenCL 2.0 / 3.0 System [...] The post TOPST D3-G maker SBC is powered by Telechips TCT8050 Dolphin3 Cortex-A72/A53/R5 automotive-grade SoC appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/10/topst-d3-g-maker-sbc-telechips-tct8050-dolphin3-cortex-a72-a53-r5-automotive-grade-soc/",
    "categories": [
      "Hardware",
      "Semiconductors"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.480290"
  },
  {
    "title": "Black Sesame Technologies Wudang C1200 cross-domain automotive SoCs feature up to 10x Cortex-A78AE cores",
    "summary": "I found two interesting automotive SoCs in the Linux 6.19 changelog: Renesas R-Car X5H 16-/32-core Cortex-A720AE SoC and Black Sesame Technologies Wudang C1200 8-/10-core Cortex-A78AE processor family. While announced in 2024, there s still no product page for the Renesas chip. So today, I ll focus on the Wudang C1200 family. They are designed to be automotive-grade cross-domain computing platforms capable of handling multiple functions such as in-cabin sensing systems (e.g., driver attention monitoring), infotainment, auto-parking systems, safety information, autonomous driving, and more. Wudang C1296 10-core SoC Wudang C1296 specifications: CPU 10x Arm Cortex-A78AE automotive-grade cores Dual-Core Lockstep (DCLS) supported, ASIL-D compliance Up to 32K DMIPS (or 16K DMIPS in DCLS) GPU Automotive-grade Arm Mali-G78AE GPU; DCLS supported, ASIL-D compliance NPU DynamAl NN Engine Hybrid precision 4-bit/8-bit MAC array Overall 80% utilization of convolution layers MAC Array Sparse support for storage and acceleration INT8/INT16, FP16 GEMM and nonlinear functions acceleration [...] The post Black Sesame Technologies Wudang C1200 cross-domain automotive SoCs feature up to 10x Cortex-A78AE cores appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/10/black-sesame-technologies-wudang-c1200-cross-domain-automotive-socs-feature-up-to-10x-cortex-a78ae-cores/",
    "categories": [
      "Hardware",
      "Semiconductors"
    ],
    "quality_score": 25,
    "processed_date": "2026-02-15T18:20:49.480785"
  },
  {
    "title": "Geniatech DB3506 is a full-featured Rockchip RK3506 development board and 3.5-inch industrial SBC",
    "summary": "Geniatech DB3506 is a full-featured Rockchip RK3506 development board and 3.5-inch SBC designed for industrial control, human machine interface (HMI) systems, IoT gateways, and other embedded applications. The board combines the tri-core Arm Cortex-A7 SoC with 256 MB to 1 GB LPDDR3 RAM and 256 MB or 512 MB NAND flash options, offers HDMI and RGB touchscreen display interfaces, dual Fast Ethernet, dual-band WiFi and Bluetooth 5.0, optional 4G LTE via a mini PCIe slot, two USB 2.0 ports, and a range of headers for CAN bus, RS-232/RS-485, Audio, GPIOs, and more. Geniatech DB3506 specifications: SoC Rockchip RK3506 CPU 3x Arm Cortex-A7 cores Arm Cortex-M0 real-time core GPU 2D GPU only with hardware-accelerated 2D rendering No VPU, no NPU System Memory 512MB LPDDR3 (option for 256MB or 1GB) Storage 256MB NAND flash (option for 512MB) Video Output HDMI output 50-pin RGB display FPC interface up to 1280 1280 @ 60 [...] The post Geniatech DB3506 is a full-featured Rockchip RK3506 development board and 3.5-inch industrial SBC appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/09/geniatech-db3506-full-featured-rockchip-rk3506-development-board-and-3-5-inch-industrial-sbc/",
    "categories": [
      "Hardware",
      "Semiconductors"
    ],
    "quality_score": 25,
    "processed_date": "2026-02-15T18:20:49.481253"
  },
  {
    "title": "Linux 6.19 Release Main changes, Arm, RISC-V, and MIPS architectures",
    "summary": "Linus Torvalds has just released Linux 6.19 on the Linux Kernel Mailing List (LKML): No big surprises anywhere last week, so 6.19 is out as expected just as the US prepares to come to a complete standstill later today watching the latest batch of televised commercials. The betting man would expect them all to be AI-generated, but maybe some enterprising company decides to buck the trend? Doubtful, but there s always a slight chance. But for anybody outside the US, maybe taking the newest kernel out for a spin instead is an option? I have more than three dozen pull requests for when the merge window opens tomorrow thank you to all the early maintainers. And as people have mostly figured out, I m getting to the point where I m being confused by large numbers (almost running out of fingers and toes again), so the next kernel is going to [...] The post Linux 6.19 Release Main changes, Arm, RISC-V, and MIPS architectures appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/09/linux-6-19-release-main-changes-arm-risc-v-and-mips-architectures/",
    "categories": [
      "AI & ML",
      "Hardware"
    ],
    "quality_score": 25,
    "processed_date": "2026-02-15T18:20:49.481532"
  },
  {
    "title": "86-type Smart Home control panel features a 3.5-inch display, physical buttons, Bluetooth SIG Mesh gateway",
    "summary": "The Tuya WiFi 3.5-inch Smart Center Control Panel (CCP-S05) is designed to replace traditional 86-type switches while adding a Bluetooth SIG Mesh gateway, a touchscreen interface, and three buttons for smart homes, apartments, and small commercial spaces. Compared to other 86-type control panels such as the Luckfox-Pico-86-Panel, Dusun DSGW-130, and Waveshare s ESP32-P4 Smart 86 Box, the Tuya device follows a hybrid approach, combining a capacitive touchscreen with three physical buttons for instant local control. Tuya WiFi 3.5-inch Smart Center Control Panel (CCP-S05) specifications: SoC Unknown (potentially based on Allwinner F1C100s ARM9 application processor, slightly more powerful Rockchip or Allwinner SoC) Display 3.5-inch capacitive touchscreen Audio Built-in microphone and speaker Networking Wi-Fi (2.4 GHz) Bluetooth Mesh USB USB Type-C port for debugging only Relays 3x independent relay channels (200 W per channel max 600W) Misc 3x programmable physical buttons Reset button (on the bottom side) RTC [...] The post 86-type Smart Home control panel features a 3.5-inch display, physical buttons, Bluetooth SIG Mesh gateway appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/09/86-type-smart-home-control-panel-features-a-3-5-inch-display-physical-buttons-bluetooth-sig-mesh-gateway/",
    "categories": [
      "Hardware",
      "Semiconductors"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.481832"
  },
  {
    "title": "Texas Instruments unveils MSPM33C321A mixed-signal Cortex-M33 microcontroller with 256KB SRAM, 1MB flash",
    "summary": "Texas Instruments MSPM33C321A is a new Arm Cortex-M33 mixed-signal microcontroller clocked at 160MHz, with up to 1MB of flash with ECC and 256kB SRAM with ECC, and a range of digital and analog peripherals. Those include 9.4MSPS dual SAR ADCs and comparators, QSPI, UART, SPI, I2C, I2S/TDM, & CAN-FD interfaces, and the company also highlights a separate VBAT power domain with RTC, integrated watchdog, and tamper I/O, as well as low power consumption with a 16 A standby current with 64kB SRAM and CPU/register retention. The MSPM33C321A also has a little brother with 512KB flash called the MSPM33C3219. MSPM33C321A specifications: MCU core 32-bit Arm Cortex-M33 CPU @ 160MHz with TrustZone, FPU, and DSP extensions Memory 256kB of SRAM with ECC Storage Up to 1MB of flash memory with error correction code (ECC); dual-bank with address swap EEPROM operations using 32kB high-endurance data flash Quad SPI (QSPI) for external memory [...] The post Texas Instruments unveils MSPM33C321A mixed-signal Cortex-M33 microcontroller with 256KB SRAM, 1MB flash appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/07/texas-instruments-mspm33c321a-mixed-signal-cortex-m33-microcontroller/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.482254"
  },
  {
    "title": "Compact, fanless DIN-Rail Intel Core Ultra 5 235U/7 265U industrial PC targets AMR, robotics, and computer vision",
    "summary": "ASUS IoT PE1000U is a compact (160 x 110 x 63 mm) fanless DIN-rail industrial Edge AI PC powered by an Intel Core Ultra 5 235U/ 7 265U (Series 2) processor and designed for AMR (Autonomous Mobile Robots), robotics, and computer vision applications. Housed in a fanless, MIL-STD-810H-rated, rugged IP40-rated chassis, the PE1000U supports SO-DIMM DDR5 memory, SATA and NVMe storage, features two 2.5GbE RJ45 ports, four USB ports, four COM ports, onboard CAN Bus and DIO interfaces, as well as DisplayPort and HDMI outputs for dual 4K display setups for HMI or machine-vision monitoring. As an industrial computer, it accepts a wide 9-36V DC power input, includes built-in ignition control, and can operate in environments with temperatures ranging between -25 C and 70 C. ASUS IoT PE1000U specifications: Arrow Lake SoC (one or the other) Intel Core Ultra 5 235U CPU 12-core (2P+8E+2LPE) / 14 threads processor @ 2.0 GHz [...] The post Compact, fanless DIN-Rail Intel Core Ultra 5 235U/7 265U industrial PC targets AMR, robotics, and computer vision appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/06/compact-fanless-din-rail-intel-core-ultra-5-235u-7-265u-industrial-pc-targets-amr-robotics-and-computer-vision/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.482505"
  },
  {
    "title": "$199+ M5Stack AI Pyramid Computing Box Linux AI mini PC is based on Axera AX8850 SoC",
    "summary": "M5Stack has just launched the AI Pyramid Computer Box AI mini PC powered by an Axera AX8850 octa-core Cortex-A55 SoC with a 24 TOPS NPU and featuring an unusual design since it s housed in a pyramidal enclosure. The mini PC features 4GB or 8GB of RAM, 32GB eMMC flash, a microSD card slot, two HDMI 2.0 ports (see specs for details), a 4-mic array, a built-in speaker, two Gigabit Ethernet ports, four USB 3.2 ports, and two USB-C ports for data and power. It serves as a desktop-grade Edge AI computing platform for systems such as AI vision gateways, smart security systems, and local smart photo albums. M5Stack AI Pyramid Computing Box specifications: SoC Axera AX8850 CPU Octa-core Cortex A55 processor at 1.7 GHz NPU 24 TOPS @ INT8 VPU Video Encoder 8K @ 30 fps H.264/H.265 encoding, supports scaling / cropping Video Decoder 8K @ 60 fps H.264/H.265 decoding, supports 16 channels 1080p parallel decoding, [...] The post $199+ M5Stack AI Pyramid Computing Box Linux AI mini PC is based on Axera AX8850 SoC appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/06/199-m5stack-ai-pyramid-computing-box-linux-ai-mini-pc-is-based-on-axera-ax8850-soc/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 25,
    "processed_date": "2026-02-15T18:20:49.482754"
  },
  {
    "title": "Review of XIAO ePaper DIY Kit EE02 13.3-inch color E-Ink display with SenseCraft HMI and Arduino",
    "summary": "Seeed Studio has sent us a sample of the XIAO ePaper DIY Kit EE02 for review. The kit is comprised of an ESP32-S3 board driving a 13.3-inch Spectra 6 color E-Ink display with 1600 x 1200 resolution. It supports Wi-Fi and Bluetooth 5.0 (LE) wireless connectivity, and features a USB Type-C port for power and programming, a battery connector with an on/off power switch, a built-in charging circuit, a Reset button, and three user buttons. In this review, we will test the XIAO ePaper DIY Kit EE02 with the SenseCraft HMI platform and the Arduino IDE. But first, let s go through an unboxing. XIAO ePaper DIY KIT EE02 unboxing We received the XIAO ePaper DIY Kit EE02 in a cardboard box with foam to protect the display. The package includes the 13.-inch ePaper display, the XIAO ePaper Display EE02 board, an external antenna, and a set of two 60-pin adapters [...] The post Review of XIAO ePaper DIY Kit EE02 13.3-inch color E-Ink display with SenseCraft HMI and Arduino appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/05/review-of-xiao-epaper-diy-kit-ee02-13-3-inch-color-e-ink-display-with-sensecraft-hmi-and-arduino/",
    "categories": [
      "Hardware"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-15T18:20:49.483328"
  },
  {
    "title": "Cubie A7S A compact Allwinner A733 SBC with USB-C DisplayPort, GbE, WiFi 6, PCIe Gen3 FFC connector, GPIO headers",
    "summary": "Radxa has launched its third Allwinner A733 octa-core Cortex-A76/A55 SBC with the compact Cubie A7S featuring up to 16GB LPDDR5 memory, up to 256GB eMMC flash and a microSD card slot for storage, a Gigabit Ethernet RJ45 port, and a WiFi 6 and Bluetooth 5.2 wireless module. Other features include two USB-C ports, including one supporting DisplayPort Alt mode for video output, a USB 2.0 Type-A port, a 16-pin PCIe Gen3 x1 FFC connector, 30-pin and 15-pin GPIO headers, and a 4-lane MIPI CSI camera connector. At 51 x 51 mm, it offers a middle ground between the credit card-sized Cubie A7A and the Pi Zero-sized Cubie A7Z. Cubie A7S specifications: SoC Allwinner A733 CPU Dual-core Arm Cortex-A76 @ up to 2.00 GHz Hexa-core Arm Cortex-A55 @ up to 1.8 GHz Single-core RISC-V E902 real-time core @ up to 200 MHz GPU Imagination Technologies BXM-4-64 MC1 GPU with [...] The post Cubie A7S A compact Allwinner A733 SBC with USB-C DisplayPort, GbE, WiFi 6, PCIe Gen3 FFC connector, GPIO headers appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/05/cubie-a7s-a-compact-allwinner-a733-sbc-with-usb-c-displayport-gbe-wifi-6-pcie-gen3-ffc-connector-gpio-headers/",
    "categories": [
      "Hardware",
      "GPUs"
    ],
    "quality_score": 25,
    "processed_date": "2026-02-15T18:20:49.483822"
  },
  {
    "title": "Qualcomm IPQ5424 embedded router board supports 22 Gbps tri-band Wi-Fi 7 and dual 10GbE networking",
    "summary": "Wallys Communications DR5424 is a new embedded router board powered by a Qualcomm IPQ5424 quad-core Cortex-A55 SoC (aka Dragonwing NPro A7 Platform) and offering tri-band Wi-Fi 7 connectivity up to around 22 Gbps, along with two 10 GbE RJ45 ports and four 2.5GbE RJ45 ports for wired networking. Based on Qualcomm AP.MI01.2 reference design, the board also features 4GB or 8GB DDR4 memory, 256MB NAND flash, and 32MB NOR flash, as well as a USB 3.0 port, a USB 2.0 port, and JTAG and serial debug ports. Target applications include Wi-Fi 7 (802.11be) access points, Internet of Things (IoT) gateways, and HD streaming and gaming. Qualcomm AP.MI01.2 specifications: SoC Qualcomm IPQ5424 (Qualcomm Dragonwing NPro A7 Platform / NPA7) CPU Quad-core Cortex-A55 Marina processor @ up to 1.5 GHz (Wallys) or 1.8 GHz (Qualcomm and Compex) Accelerator Integrated accelerator designed for AI models specific to Wi-Fi and [...] The post Qualcomm IPQ5424 embedded router board supports 22 Gbps tri-band Wi-Fi 7 and dual 10GbE networking appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/04/qualcomm-ipq5424-embedded-router-board-supports-22-gbps-tri-band-wi-fi-7-and-dual-10gbe-networking/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-15T18:20:49.484869"
  },
  {
    "title": "reComputer Jetson AGX Orin Developer Kit GMSL Bundle features 8x GMSL2 camera interfaces, 10GbE networking",
    "summary": "Seeed Studio s reComputer Jetson AGX Orin Developer Kit GMSL bundle is an NVIDIA Jetson AGX Orin 32GB/64GB equipped with eight GMSL2 camera interfaces through two FAKRA connectors. It s based on the company s reComputer Mini J501 carrier board a smaller version of the reServer Industrial J501 with 10GbE and GbE RJ45 ports, HDMI 2.1 video output, two USB 3.2 ports, two USB 2.0 Type-C Debug/Recovery ports, and fitted with a 128 M.2 NVMe SSD and an M.2 WiFi 5 and Bluetooth 5.0 module, besides the daughterboard with the GMSL2 camera interfaces. reComputer Jetson AGX Orin Developer Kit GMSL Bundle specifications: Supported system-on-modules (one or the other) NVIDIA Jetson AGX Orin 32GB with CPU 8-core Arm Cortex-A78AE v8.2 64-bit processor @ 2.2 GHz with 2MB L2 + 4MB L3 cache GPU and AI NVIDIA Ampere architecture with 1792 NVIDIA CUDA cores and 56 Tensor Cores @ 930 MHz DL Accelerator 2x [...] The post reComputer Jetson AGX Orin Developer Kit GMSL Bundle features 8x GMSL2 camera interfaces, 10GbE networking appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/04/recomputer-jetson-agx-orin-developer-kit-gmsl-bundle-features-8x-gmsl2-camera-interfaces-10gbe-networking/",
    "categories": [
      "Hardware",
      "GPUs"
    ],
    "quality_score": 25,
    "processed_date": "2026-02-15T18:20:49.485277"
  }
]