[
  {
    "title": "3DPrintopia 2025: filament, folding printers, and fun at the East Coast's largest 3D printing event",
    "summary": "3DPrintopia 2025 was a weeklong festival featuring a wide variety of 3D printers, ranging from established models to the latest innovations.  A key highlight was the introduction of new filament types. The event focused on showcasing advancements and trends within the 3D printing industry.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/3d-printing/3dprintopia-2025-filament-folding-printers-and-fun-at-the-east-coasts-largest-3d-printing-event"
  },
  {
    "title": "ASRock Challenger RX 9070 16GB drops to $549 get more VRAM than an RTX 5070 for the same amount of green",
    "summary": "The ASRock RX 9070 XT Challenger 16GB is currently priced at $549, matching the price of the cheapest RTX 5070. This offers consumers more VRAM compared to the RTX 5070 for the same cost. It's a compelling option for gamers seeking high performance.",
    "tags": [
      "Hardware",
      "NVIDIA",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/asrock-challenger-rx-9070-16gb-drops-to-usd549-get-more-vram-than-an-rtx-5070-for-the-same-amount-of-green"
  },
  {
    "title": "Three Steam Deck-ready 2230 SSD upgrades are at record low prices",
    "summary": "Several M.2-2230 SSD upgrades designed for the Steam Deck are currently available at record low prices. The Crucial P310 2TB is particularly discounted at $121.99, while WD and Kingston 1TB models have dropped to as low as $65. These SSDs are appealing for enhancing the performance of the handheld gaming device.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/ssds/three-steam-deck-ready-2230-ssd-upgrades-are-at-record-low-prices-crucial-p310-2tb-at-lowest-ever-49-percent-off-wd-and-kingston-1tb-models-dip-as-low-as-usd65"
  },
  {
    "title": "MSI gaming bundle lets you snag AMD's Ryzen 7 9800X3D for $400 when paired with an MSI X870 Tomahawk WiFi motherboard for Prime Day",
    "summary": "MSI is offering a fantastic gaming bundle featuring the AMD Ryzen 7 9800X3D and X870 Tomahawk WiFi motherboard for Prime Day.  The bundle is priced at $639 or $738 with a 2TB SSD, representing a great deal for a powerful gaming PC. This is an excellent opportunity to build a high-performance gaming rig.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/msi-gaming-bundle-lets-you-snag-amds-ryzen-7-9800x3d-for-usd400-when-paired-with-with-an-msi-x870-tomahawk-wifi-motherboard-usd639-for-the-pair-or-usd738-with-a-2tb-ssd"
  },
  {
    "title": "Nintendo asks for $4.5 million default judgment against ex-Reddit mod accused of pirating thousands of games",
    "summary": "Nintendo is pursuing a $4.5 million default judgment against former Reddit mod James 'Archbox' Williams for allegedly selling thousands of illegally-acquired Switch games. Williams failed to respond to a cease-and-desist notice, leading to the legal action. He reportedly used donations from buyers to facilitate faster access to his stolen game library.",
    "tags": [
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.tomshardware.com/video-games/nintendo/nintendo-asks-for-usd4-5-million-default-judgment-against-ex-reddit-mod-accused-of-pirating-thousands-of-games-archbox-allegedly-asked-for-donations-for-faster-access-to-his-stolen-library"
  },
  {
    "title": "Amazon Prime Big Deals Day has exceptional soldering iron deals",
    "summary": "Amazon is offering fantastic deals on soldering iron kits, making it a prime time to stock up on equipment. The author has researched extensively to identify the best available options and highlight significant savings. This is a great opportunity for hobbyists and professionals alike.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/maker-stem/soldering-irons/best-soldering-irons-amazon-prime-day-2025"
  },
  {
    "title": "Grab vital 3D printer maintenance tools for less this Amazon Prime Day up to 37% off HOTO, Creality, Wera",
    "summary": "This Amazon Prime Day offers discounted 3D printer maintenance tools, ensuring you can maintain optimal printing performance. The sale includes brands like HOTO, Creality, and Wera, providing essential tools for your 3D printing needs.  Investing in these tools will contribute to consistently high-quality prints.",
    "tags": [
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.tomshardware.com/3d-printing/best-3d-printer-tools-amazon-prime-day-2025"
  },
  {
    "title": "These are the tools we use to build and maintain our precious tech, and they're on sale for Amazon Prime Day",
    "summary": "This text highlights a selection of essential tools for maintaining electronics, currently discounted during Amazon Prime Day.  It emphasizes the need for these tools to ensure electronics are kept in good working order.  The offer is time-sensitive, coinciding with the Prime Day event.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "NVIDIA",
      "Raspberry Pi"
    ],
    "link": "https://www.tomshardware.com/desktops/pc-building/best-pc-tools-amazon-prime-day-2025"
  },
  {
    "title": "Microsoft says Xbox hardware isn't going anywhere company reaffirms commitment to AMD-powered next-gen console",
    "summary": "Microsoft has stated that plans to discontinue its Xbox hardware are not part of a strategy to leave the gaming console market. Recent price increases for Xbox Game Pass are unrelated to this shift. The company remains committed to its AMD-powered next-generation console. ",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/video-games/xbox/microsoft-says-xbox-hardware-isnt-going-anywhere-company-reaffirms-commitment-to-amd-powered-next-gen-console"
  },
  {
    "title": "One of the best 8TB SSDs is now also the cheapest at just 6 cents per GB save up to 14% on the 8TB WD Black SN850X and solve your storage needs for good",
    "summary": "The WD Black SN850X 8TB SSD is now available for $515.98, a significant discount from its previous price of $599.99. This price reduction makes it a highly affordable option for large storage needs.  At just 6 cents per GB, it represents an excellent value.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/ssds/one-of-the-best-8tb-ssds-is-now-also-the-cheapest-at-just-6-cents-per-gb-save-up-to-14-percent-on-the-8tb-wd-black-sn850x-and-solve-your-storage-needs-for-good"
  },
  {
    "title": "Best Prime Day Hard Drive deals 2025 HDD deals from WD, Seagate, and Toshiba",
    "summary": "This guide highlights the top hard drive deals available during Prime Day 2025, focusing on options from leading brands like WD, Seagate, and Toshiba.  It's designed to help consumers increase their PC's storage capacity affordably. Expect competitive pricing and a wide selection of HDDs.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/hdds/best-hard-drive-hdd-deals-amazon-prime-day-2025"
  },
  {
    "title": "Intel's upcoming Panther Lake family will reportedly feature new \"Core Ultra X\" branding for fully-spec'd iGPU configs",
    "summary": "Intel's Panther Lake mobile CPUs will debut with Xe3 graphics IP, with Core Ultra 7 and 9 processors tipped to have up to 12 Xe3 GPU cores. Top-tier SKUs will be designated as \"Core Ultra X,\" and this branding is now also rumored to extend to the Core Ultra 5. This signifies a significant upgrade in Intel's integrated graphics capabilities.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/cpus/intels-upcoming-panther-lake-family-will-reportedly-feature-new-core-ultra-x-branding-for-fully-specd-igpu-configs-core-ultra-7-and-9-processors-tipped-to-feature-12-xe3-gpu-cores"
  },
  {
    "title": "Intel's flagship Core Ultra 9 285K is down to its lowest price ever, at just $489",
    "summary": "The Intel Core Ultra 9 285K is now available at a significantly reduced price of $489, a prime opportunity considering its performance rivals the Ryzen 9 9950X while using less power. This discount makes it a compelling option for users seeking a high-performance CPU without the associated power consumption.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/intels-flagship-core-ultra-9-285k-is-down-to-its-lowest-price-ever-at-just-usd489-score-the-24-core-processor-for-usd110-off-this-prime-day"
  },
  {
    "title": "Acer chief says Nvidia s Intel investment will complicate PC supply chains",
    "summary": "Acer CEO Jason Chen believes Nvidia and Intel's partnership poses challenges for PC manufacturers' product planning and placement. He also expressed skepticism about the potential realization of a 50/50 joint venture proposal. This collaboration could significantly impact the established PC supply chain.",
    "tags": [
      "NVIDIA",
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/acer-chief-says-nvidias-intel-investment-will-complicate-pc-supply-chains-says-lutnicks-50-50-proposal-could-take-50-years-to-realize"
  },
  {
    "title": "Developer recreates classic shoot 'em up Zaxxon as a UEFI firmware isometric arcade game coded in x86 assembly for no-OS represents 'total freedom from big tech'",
    "summary": "A Zaxxon recreation has been developed as a UEFI application utilizing x86-64 Assembly language. This project creates an isometric arcade game without relying on a traditional operating system, aiming for complete independence from large technology corporations. The application is a self-contained gaming experience built at the lowest hardware level.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/software/programming/developer-recreates-classic-shoot-em-up-zaxxon-as-a-uefi-firmware-isometric-arcade-game-coded-in-x86-assembly-for-no-os-represents-total-freedom-from-big-tech"
  },
  {
    "title": "Logitech s new MX Master 4 is already $30 off on Best Buy and cheaper than its predecessor   Prime Day alternative yields unexpected discount just 7 days after launch",
    "summary": "The newly released Logitech MX Master 4 mouse is already discounted by $30 at Best Buy, a surprising early promotion. This discount represents a significant price drop compared to its previous generation. The reduced price is occurring shortly after the mouse's launch, resembling a Prime Day-like deal.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/logitechs-new-mx-master-4-is-already-usd30-off-on-best-buy-and-cheaper-than-its-predecessor-prime-day-alternative-yields-unexpected-discount-just-7-days-after-launch"
  },
  {
    "title": "Grab a 4TB SSD for 5 cents per gigabyte during Prime Day sales 8TB models start as low as 7 cents per GB",
    "summary": "During Prime Day, SSD prices have significantly decreased, with 4TB models available at an exceptionally low rate of 5 cents per gigabyte. Larger 8TB models are also becoming more affordable, with prices dropping to around 7 cents per GB. This represents a substantial reduction in cost compared to previous years.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/ssds/best-4tb-8tb-ssd-deals-2025"
  },
  {
    "title": "Cyberattacks hit 91% of universities and 43% of businesses in last 12 months in the UK",
    "summary": "A recent survey reveals a significant surge in cyberattacks targeting UK institutions, with 91% of universities and 43% of businesses experiencing at least one breach attempt over the last year. This has impacted a massive scale, potentially affecting over 600,000 businesses and 61,000 charities. The findings highlight a critical vulnerability within the UK's digital landscape.",
    "tags": [
      "Trends",
      "Hardware",
      "AI"
    ],
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/cyberattacks-hit-91-percent-of-universities-and-43-percent-of-businesses-in-last-12-months-in-the-uk-survey-suggests-more-than-600-000-businesses-61-000-charities-affected"
  },
  {
    "title": "Swiss lab where researchers are working to create computers powered by mini human brains revealed in new report   mini brain organoids revealed, developers say 'we shouldn't be scared of them'",
    "summary": "Researchers in a Swiss lab are developing computers utilizing miniature human brain organoids. The project aims to create functioning computer systems based on these bio-chips. Developers emphasize that the technology shouldn't be viewed with fear.",
    "tags": [
      "AI",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/cpus/swiss-lab-where-researchers-are-working-to-create-computers-powered-by-mini-human-brains-revealed-in-new-report-mini-brain-organoids-revealed-developers-say-we-shouldnt-be-scared-of-them"
  },
  {
    "title": "Best Amazon Prime Day Tech Deals Live Blog - The Best Tech & PC Hardware Deals on GPUs, CPUs, SSDs, and more",
    "summary": "This live blog provides real-time coverage of the top tech and PC hardware deals available during Amazon Prime Day. It highlights significant discounts on items like GPUs, CPUs, SSDs, laptops, peripherals, and accessories.  It's a resource for finding the best deals across a wide range of hardware.",
    "tags": [
      "Hardware",
      "NVIDIA"
    ],
    "link": "https://www.tomshardware.com/news/live/best-amazon-prime-day-deals-live-the-best-tech-and-pc-hardware-deals-on-gpus-cpus-ssds-and-more"
  },
  {
    "title": "The best cheap tech you can grab this Amazon Prime Day 13 bargains under $13 to improve your tech life",
    "summary": "This article highlights 13 affordable tech products discovered during the Amazon Prime Day sales. The selection offers budget-friendly solutions to enhance your tech life without breaking the bank.  These deals are curated from various Amazon Prime Day product listings.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/peripherals/best-cheap-tech-amazon-prime-day-13-under-13-dollars"
  },
  {
    "title": "OpenAI and AMD announce multibillion-dollar partnership",
    "summary": "AMD and OpenAI are joining forces in a massive multibillion-dollar partnership focused on developing AI-powered data centers using AMD's chip technology. AMD will supply 6 gigawatts of chips, and OpenAI could receive up to 10% of AMD's shares as part of the agreement. This collaboration represents a significant investment in the future of AI infrastructure.",
    "tags": [
      "AI",
      "Machine Learning",
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/openai-and-amd-announce-multibillion-dollar-partnership-amd-to-supply-6-gigawatts-in-chips-openai-could-get-up-to-10-percent-of-amd-shares-in-return"
  },
  {
    "title": "Incessant gamer reaches fabled edge of Minecraft map after more than 14 years",
    "summary": "A dedicated YouTuber has finally achieved a long-standing goal within Minecraft, reaching the Far Lands – the supposed edge of the game's early maps.  This player’s journey, spanning over 14 years, involved traversing approximately 12,500km within the game. The achievement highlights a sustained effort to explore a key area of the game's early development.",
    "tags": [
      "Trends",
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.tomshardware.com/video-games/pc-gaming/incessant-gamer-reaches-fabled-edge-of-minecraft-map-after-more-than-14-years-has-been-walking-towards-mythical-far-lands-at-the-edge-of-the-map-since-2011-covering-12-500km-in-game"
  },
  {
    "title": "Japanese tech giant deploys laser drones to protect chickens",
    "summary": "NTT has developed a laser drone system specifically designed for Japanese poultry farms. The drones are intended to deter and prevent the transmission of avian flu by targeting potential spreaders. This innovative technology offers a proactive approach to combating the disease.",
    "tags": [
      "AI",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/japanese-tech-giant-deploys-laser-drones-to-protect-chickens-drones-are-hoped-to-prevent-the-spread-of-avian-flu"
  },
  {
    "title": "Save over $1,200 on a RTX 4060 gaming laptop during Prime Day   pay less than half the normal price for the MSI Raider GE68HX",
    "summary": "The MSI Raider GE68HX, a popular model from last year, is currently available at a significantly discounted price during Prime Day. This offer represents a substantial savings—under half the typical cost—making it an exceptional value for gamers. It combines strong performance with premium features.",
    "tags": [
      "NVIDIA",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/pc-components/save-over-usd1-200-on-a-rtx-4060-gaming-laptop-during-prime-day-pay-less-than-half-the-normal-price-for-the-msi-raider-ge68hx"
  },
  {
    "title": "Ukraine s rotating barbed wire drone barriers discovered by Russians",
    "summary": "Ukraine has developed a new defense strategy using rotating barbed wire barriers controlled by remote systems. These barriers are designed to disable jamming-proof drones by physically damaging their fiber-optic trails. This innovative approach represents a significant challenge for enemy drone operations.",
    "tags": [
      "Trends",
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.tomshardware.com/tech-industry/ukraines-rotating-barbed-wire-drone-barriers-discovered-by-russians-motorized-barriers-tear-and-slice-the-fiber-optic-lines-that-jam-proof-drones-leave-in-their-trail"
  },
  {
    "title": "Nintendo Switch 2 supports two different types of Nvidia DLSS",
    "summary": "Nintendo is utilizing two versions of DLSS on the Switch 2, confirming previous speculation. One 'light' version enables upscaling beyond 1080p but compromises image quality, while the other employs a PC-like CNN model. This dual approach suggests a sophisticated optimization strategy for the console's graphical performance.",
    "tags": [
      "AI",
      "Machine Learning",
      "NVIDIA",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/video-games/nintendo/nintendo-switch-2-supports-two-different-types-of-nvidia-dlss-a-second-light-version-for-upscaling-beyond-1080p-along-with-the-standard-pc-like-cnn-model"
  },
  {
    "title": "Bitcoin rockets to all-time high of over $125,000",
    "summary": "Bitcoin surged to an unprecedented $125,000, driven by investors looking for alternative assets and significant movement of holdings into long-term storage. This surge is partly attributed to rising interest in Bitcoin ETFs and a broader trend of seeking diversification. The price increase reflects a combination of factors contributing to Bitcoin's growing prominence.",
    "tags": [
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/tech-industry/cryptocurrency/bitcoin-rockets-to-all-time-high-of-over-usd125-000-rise-fueled-by-increase-in-u-s-equities-and-interest-in-bitcoin-etfs"
  },
  {
    "title": "Intel s Core Ultra 5 225F is at an all-time low $170, making Arrow Lake more affordable ahead of Amazon's Prime Day sale",
    "summary": "The Intel Core Ultra 5 225F processor is currently priced at an all-time low of $170, offering a strong feature set including 10 cores and PCIe 5.0. This affordability makes the Arrow Lake platform more accessible, particularly as Amazon prepares for its Prime Day sale.  It represents a compelling entry point into Intel's new generation of processors.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends",
      "AI"
    ],
    "link": "https://www.tomshardware.com/pc-components/intels-core-ultra-5-225f-is-at-an-all-time-low-usd170-making-arrow-lake-more-affordable-ahead-of-amazons-prime-day-sale"
  },
  {
    "title": "The transistor was patented 75 years ago today   the age of silicon and software began with a three-electrode circuit element using semiconductor materials",
    "summary": "Today marks 75 years since the U.S. Patent was awarded for the invention of the transistor by Bell Labs scientists. This pivotal moment signified the beginning of the age of silicon and software, utilizing a three-electrode circuit element based on semiconductor materials. It marked the dawn of a new era in electronics.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/the-age-of-silicon-and-software-began-75-years-ago-with-the-patenting-of-the-transistor"
  },
  {
    "title": "OCuLink outpaces Thunderbolt 5 in Nvidia RTX 5070 Ti tests",
    "summary": "Independent tests show OCuLink's direct PCIe connection outperforms Thunderbolt 5 in gaming benchmarks, achieving significantly faster results. Specifically, the RTX 5070 Ti averaged up to 14% slower performance when using Thunderbolt 5. While offering improved eGPU performance, OCuLink's practicality for typical users remains limited.",
    "tags": [
      "NVIDIA",
      "Hardware",
      "Semiconductors",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/gpus/oculink-outpaces-thunderbolt-5-in-nvidia-rtx-5070-ti-tests-latter-up-to-14-percent-slower-on-average-in-gaming-benchmarks"
  },
  {
    "title": "Award-winning gaming keyboard reaches a historic low of $17 just before Prime Day get 66% off on the Apex 3 TKL for a limited time",
    "summary": "The SteelSeries Apex 3 TKL gaming keyboard is currently offered at a remarkable price of $16.99, representing a 66% discount from its original $49.99 price. This limited-time deal is available just before Prime Day. This offers a significant opportunity to acquire an award-winning gaming keyboard.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/peripherals/gaming-keyboards/award-winning-gaming-keyboard-reaches-a-historic-low-of-usd17-just-before-prime-day-get-66-percent-off-on-the-apex-3-tkl-for-a-limited-time"
  },
  {
    "title": "Microsoft reportedly mulls ad-infested free Xbox Cloud Gaming plan",
    "summary": "Microsoft is planning a new, ad-supported free tier for Xbox Cloud Gaming. This tier will feature two-minute ads before each session and limit playtime to one hour with five hours of total usage per month. The free tier will offer access to a limited selection of games.",
    "tags": [
      "Trends",
      "Hardware",
      "AI"
    ],
    "link": "https://www.tomshardware.com/video-games/cloud-gaming/microsoft-reportedly-mulls-ad-infested-free-xbox-cloud-gaming-plan-game-pass-ultimate-subscriber-allegedly-catches-ad-during-game-loading"
  },
  {
    "title": "Hyper 212 Pro CPU air cooler drops to an all-time low of $18 just before Prime Day   save big with a 49% discount",
    "summary": "The Cooler Master Hyper 212 Pro air cooler is currently discounted to an all-time low of $18, representing a 49% savings. This makes it an incredibly affordable option for CPU cooling, especially with it being offered just before Amazon's Prime Big Deals Day. It's a popular choice for budget-conscious PC builders and enthusiasts.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/air-cooling/hyper-212-pro-cpu-air-cooler-drops-to-an-all-time-low-of-usd18-just-before-prime-day-save-big-with-a-49-percent-discount"
  },
  {
    "title": "UK cops busted for faking productivity while working from home by holding down keys on keyboard",
    "summary": "Twenty-six UK police officers and staff were caught attempting to deceive keylogging software by physically holding down keys on their keyboards during remote work. This tactic was employed to artificially inflate productivity metrics. The incident highlights a creative, albeit unsuccessful, attempt to circumvent monitoring systems.",
    "tags": [
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/uk-cops-busted-for-faking-productivity-while-working-from-home-by-holding-down-keys-on-keyboard-26-officers-and-staff-reportedly-caught-trying-to-trick-keylogging-software"
  },
  {
    "title": "One of the fastest 2TB PCIe 5.0 SSDs is down to its lowest price ever, 8 cents per gigabyte this Prime Day   Enjoy blazing-fast PCIe 5.0 storage for only $159",
    "summary": "Crucial's T705 2TB PCIe 5.0 SSD is currently priced at $160 during Prime Day, offering exceptional performance with read/write speeds of 14.5 GB/s and 12.7 GB/s, respectively. This high-performance SSD utilizes a Phison E26 controller and Micron TLC NAND, boasting 1,200 TBW and an Editor's Choice award. It represents an incredible value at 8 cents per gigabyte.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/ssds/one-of-the-fastest-2tb-pcie-5-0-ssds-is-down-to-its-lowest-price-ever-8-cents-per-gigabyte-this-prime-day-enjoy-blazing-fast-pcie-5-0-storage-for-only-usd159"
  },
  {
    "title": "Discord data hacked in latest customer service breach to expose user information",
    "summary": "Discord experienced a data breach due to hackers accessing its support systems through a third-party provider. The attackers attempted extortion but were stopped after Discord cut off access. The breach exposed some user information, prompting an ongoing investigation.",
    "tags": [
      "Trends",
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.tomshardware.com/video-games/pc-gaming/discord-data-hacked-in-latest-customer-service-breach-to-expose-user-information-hackers-gained-access-via-third-party-support-systems-but-didnt-steal-passwords"
  },
  {
    "title": "Samsung s QD-OLED 4K 240 Hz gaming monitors are now at their lowest-ever price for Prime Day",
    "summary": "Samsung's new Odyssey G8 QD-OLED gaming monitors, featuring 4K resolution and 240 Hz refresh rates, are available at their lowest prices during Prime Day. These monitors deliver flagship-level visuals and include advanced burn-in protection. The 27-inch model is priced at $879, while the 32-inch option costs $999.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/samsungs-qd-oled-4k-240-hz-gaming-monitors-are-now-at-their-lowest-ever-price-for-prime-day-usd879-for-the-27-inch-usd999-for-the-32-inch"
  },
  {
    "title": "Ultra-rare unreleased Pentium 4 with 4.0 GHz clock speed discovered",
    "summary": "An extremely rare Intel engineering sample of a Pentium 4 processor has been found online.  The sample, identified as an Intel Pentium Extreme Edition 980, boasts a significant 4.0 GHz clock speed. This discovery provides a glimpse into the final stages of development for the Pentium 4 architecture.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/cpus/ultra-rare-unreleased-pentium-4-with-4-0-ghz-clock-speed-discovered-cpu-z-confirms-it-is-an-intel-pentium-extreme-edition-980"
  },
  {
    "title": "AOL's dial-up internet service killed with a final modem screech after 34 years",
    "summary": "America Online's long-running dial-up internet service has been discontinued after 34 years of operation. This marks the end of an era for the service, which relied on modem connections. While AOL's service is offline, other dial-up services continue to exist.",
    "tags": [
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/service-providers/network-providers/aols-dial-up-internet-service-killed-with-a-final-modem-screech-this-week-after-34-years-america-online-goes-offline-but-other-dual-up-services-still-exist"
  },
  {
    "title": "Classic Snake game now playable in your browser URL address bar",
    "summary": "A unique remake of the classic Snake game allows playback directly from the browser's URL bar, offering a nostalgic experience with Unicode Braille rendering, reminiscent of high-resolution devices.",
    "tags": [
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/video-games/classic-snake-game-now-playable-in-your-browser-url-address-bar-javascript-remake-uses-unicode-braille-characters-to-render-the-game"
  },
  {
    "title": "Best MicroSD Express Cards for Nintendo Switch 2 in 2025",
    "summary": "This guide reviews the top microSD Express cards specifically designed for the Nintendo Switch 2, selected after rigorous lab testing. We've evaluated cards to ensure they meet the varied needs and budgets of Switch 2 users. The rankings are based on detailed performance benchmarks.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/microsd-cards/best-microsd-express-cards-for-nintendo-switch-2"
  },
  {
    "title": "Crazy Google Japan keyboard design switches keys for dials",
    "summary": "Google Japan's Gboard team has created a unique keyboard that replaces traditional keys with dials. This innovative design, recently open-sourced, represents a significant departure from conventional keyboard layouts. The project highlights a potential design constraint within Google's software team.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/peripherals/keyboards/crazy-google-japan-keyboard-design-switches-keys-for-dials-the-gboard-dial-edition-shows-why-the-software-team-isnt-allowed-to-design-hardware"
  },
  {
    "title": "Jeff Bezos envisions space-based data centers in 10 to 20 years",
    "summary": "Jeff Bezos proposes building gigawatt-scale orbital data centers within two decades, leveraging continuous solar energy and space-based cooling. However, the ambitious project faces significant hurdles due to the high cost and technical complexity of launching vast quantities of hardware into space. Currently, the concept is commercially unviable.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/jeff-bezos-envisions-space-based-data-centers-in-10-to-20-years-could-allow-for-natural-cooling-and-more-effective-solar-power"
  },
  {
    "title": "China to launch commercial underwater data center   facility expected to consume 90% less power for cooling",
    "summary": "Chinese company Highlander is set to launch the world's first commercial underwater data center, located off the coast of Shanghai. This facility will primarily serve state-owned companies and is designed to drastically reduce energy consumption for cooling – reportedly by 90%.  It represents a novel approach to data center infrastructure.",
    "tags": [
      "Trends",
      "Hardware",
      "AI"
    ],
    "link": "https://www.tomshardware.com/desktops/servers/china-to-launch-commercial-underwater-data-center-facility-expected-to-consume-90-percent-less-power-for-cooling"
  },
  {
    "title": "Crucial's 20Gb/s X10 Pro 2TB external SSD is only $149 in this early Amazon Prime Day deal   rugged and portable USB-C storage for tech lovers",
    "summary": "Crucial is offering an early Prime Day deal on its X10 Pro 2TB external SSD for $149, representing a $59 discount. This rugged and portable drive provides large-capacity storage via USB-C, making it ideal for tech enthusiasts.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/external-ssds/crucials-20gb-s-x10-pro-2tb-external-ssd-is-only-usd149-in-this-early-amazon-prime-day-deal-rugged-and-portable-usb-c-storage-for-tech-lovers"
  },
  {
    "title": "AI data centers are swallowing the world’s memory and storage supply, setting the stage for a pricing apocalypse that could last a decade",
    "summary": "Rising demand for flash memory and shortages of nearline HDDs are driving up storage prices across the board. This trend is largely driven by the increasing needs of AI data centers which are rapidly adopting higher-density QLC SSDs.  The combination of these factors suggests a prolonged period of elevated storage costs.",
    "tags": [
      "AI",
      "Hardware",
      "Trends",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/storage/perfect-storm-of-demand-and-supply-driving-up-storage-costs"
  },
  {
    "title": "BlackRock subsidiary buys up 78 data centers totaling 5 gigawatts in $40 billion deal   AI vendor Aligned added to company's portfolio",
    "summary": "BlackRock subsidiary Global Infrastructure Partners is acquiring Aligned Data Centers for $40 billion. The deal encompasses 78 data centers, representing a total capacity of 5 gigawatts. This acquisition also integrates Aligned, an AI vendor, into BlackRock's portfolio.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/blackrock-subsidiary-buys-up-78-data-centers-totaling-5-gigawatts-in-usd40-billion-deal-ai-vendor-aligned-added-to-companys-portfolio"
  },
  {
    "title": "Nvidia details efficiency of the NVFP4 format for LLM training",
    "summary": "Nvidia has proven that its NVFP4 4-bit format, designed for inference, is effective for stable LLM training, achieving substantial compute and memory savings compared to FP8 and BF16. This innovative use of NVFP4 minimizes accuracy loss during large-scale training. The results highlight a new approach to LLM training efficiency.",
    "tags": [
      "AI",
      "Machine Learning",
      "NVIDIA",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/nvidia-details-efficiency-of-the-nvfp4-format-for-llm-training-new-paper-reveals-how-nvfp4-offers-benefits-over-fp8-and-bf16"
  },
  {
    "title": "Samsung's 49-inch OLED gaming monitor drops to lowest-ever price",
    "summary": "Amazon is currently selling the Samsung Odyssey G9 gaming monitor for $879.99, a significant drop from its usual price of $1,599.99. This represents the lowest price ever offered for this high-performance 49-inch OLED gaming monitor, allowing consumers to maximize their GPU investment without overspending.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/samsungs-49-inch-oled-gaming-monitor-drops-to-lowest-ever-price-max-out-your-gpu-not-your-credit-card-for-just-usd879"
  },
  {
    "title": "wafer.space lets you design your custom silicon just for $7 per die (Crowdfunding)",
    "summary": "wafer.space is offering custom ASIC fabrication through a Crowd Supply campaign, enabling users to order 1,000 custom silicon dies based on a GlobalFoundries 180nm process for a fixed price of $7 per die. The company handles the fabrication, dicing, and shipping, while users are responsible for pad ring and I/O layout design. This provides a low-cost entry point for custom silicon design.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/07/wafer-space-lets-you-design-your-custom-silicon-just-for-7-per-die/"
  },
  {
    "title": "The latest Raspberry Pi OS images are now based on Debian 13 Trixie",
    "summary": "Raspberry Pi OS has updated its images to Debian 13 'Trixie,' bringing new packages and features including 64-bit time support. While primarily cosmetic with a new theme and icons, the update also includes some beneficial under-the-hood changes. According to a Raspberry Pi engineer, the changes are largely driven by updates within Debian itself.",
    "tags": [
      "Raspberry Pi",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/06/raspberry-pi-os-debian-13-trixie/"
  },
  {
    "title": "1GHz Renesas RA8T2 Cortex-M85 MCUs feature MRAM and EtherCAT for industrial motor control",
    "summary": "Renesas has released the RA8T2, a high-performance Cortex-M85 MCU with a 1GHz core and MRAM, designed for advanced motor control applications. This MCU offers enhanced networking capabilities including EtherCAT and multiple connectivity options, alongside security features like TrustZone and a cryptographic engine. It's positioned as a direct upgrade to the RA8T1 and is targeted at industrial robotics and motor control systems.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "AI",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/06/1ghz-renesas-ra8t2-cortex-m85-mcus-feature-mram-and-ethercat-for-industrial-motor-control/"
  },
  {
    "title": "Easily add 80+ Mbps Ethernet to microcontrollers with WIZ630io QSPI RJ45 module",
    "summary": "The WIZnet WIZ630io module enables easy integration of Ethernet connectivity into microcontrollers, specifically RP2350 boards, via a QSPI interface.  Featuring a W6300 controller, it offers speeds up to 80+ Mbps and includes 64KB of SRAM with 8 independent sockets. This module simplifies adding Ethernet to projects utilizing SPI or QSPI interfaces.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Raspberry Pi"
    ],
    "link": "https://www.cnx-software.com/2025/10/05/easily-add-80-mbps-ethernet-to-microcontrollers-with-wiz630io-qspi-rj45-module/"
  },
  {
    "title": "kv4p HT Turn an Android smartphone into a ham radio transceiver",
    "summary": "The kv4p HT is an open-source hardware accessory that transforms an Android smartphone into a handheld ham radio transceiver. It utilizes an ESP32 wireless module and an SA818 radio module, allowing for off-grid VHF/UHF voice and text communication.  The V2.0 version features an ESP32 SoC with dual-core processing and WiFi/Bluetooth connectivity.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/04/kv4p-ht-turn-an-android-smartphone-into-an-ham-radio-transceiver/"
  },
  {
    "title": "Linux-based Vega OS replaces Android-based Fire OS in Amazon Fire TV Stick 4K Select",
    "summary": "Amazon has switched from its previous Fire OS to a new Linux-based Vega OS for the Fire TV Stick 4K Select. This new OS utilizes a MediaTek MT8698 processor and offers features like HDMI 2.1 and WiFi 5. The change represents a significant departure from Amazon’s previous approach to Fire TV software.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/03/linux-based-vega-os-replaces-android-based-fire-os-in-amazon-fire-tv-stick-4k-select/"
  },
  {
    "title": "M5Stack LLM-8850 card",
    "summary": "The M5Stack LLM-8850 card is an M.2 AI accelerator module utilizing the Axera AX8850 24 TOPS SoC, designed for accelerating AI workloads on devices like Raspberry Pi 5 and Rockchip SBCs. It features 8GB of LPDDR4x RAM, 32MB of flash storage, and supports 8K video encoding/decoding capabilities with 16 channels.  An active cooling system ensures stable operation.",
    "tags": [
      "AI",
      "Machine Learning",
      "Edge AI",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/03/m5stack-llm-8850-card-an-m-2-m-key-ai-accelerator-module-based-on-axera-ax8850-24-tops-soc/"
  },
  {
    "title": "Snapdragon X2 Elite Extreme and X2 Elite processors target high-end Windows PCs",
    "summary": "Qualcomm has unveiled three new 3nm Snapdragon X2 Elite processors – Extreme, Elite (88 and 80), designed for high-end Windows laptops. These processors boast powerful performance cores, advanced AI capabilities (Hexagon NPU), and cutting-edge connectivity features like WiFi 7 and PCIe Gen5. The lineup promises fastest and most efficient performance for laptops.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "AI",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/10/02/snapdragon-x2-elite-extreme-and-x2-elite-processors-target-high-end-windows-pcs/"
  },
  {
    "title": "DDR4 supply/demand stress leads to Raspberry Pi CM4/CM5 price increases",
    "summary": "Rising DDR4 memory costs, driven by increased demand for AI workloads, are significantly impacting the Raspberry Pi Compute Module 4 and 5 (CM4/CM5) and associated products.  Due to these higher memory costs, Raspberry Pi is increasing prices by $5-$10 for CM4/CM5 modules and the Raspberry Pi 500 keyboard PC. This price adjustment reflects the current market realities of DDR4 supply constraints.",
    "tags": [
      "Raspberry Pi",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/02/ddr4-supply-demand-stress-leads-to-raspberry-pi-cm4-cm5-price-increases/"
  },
  {
    "title": "AAEON GENE-ARH6",
    "summary": "The AAEON GENE-ARH6 is a 3.5-inch subcompact industrial SBC featuring the Intel Core Ultra 200H/U series processors, offering up to 96 TOPS of AI performance. It supports significant memory, display outputs, and extensive connectivity options, including multiple M.2 slots for expansion. This robust SBC is designed for demanding applications like robotics and industrial deployments requiring high performance and flexibility.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/01/aaeon-gene-arh6-a-3-5-inch-subcompact-industrial-sbc-with-intel-core-ultra-200h-u-soc/"
  },
  {
    "title": "ARIES MSRZG3E OSM-compliant SiP with Renesas RZ/G3E MPU targets industrial HMI and Edge AI",
    "summary": "The ARIES MSRZG3E is an OSM-compliant system-in-package (SiP) utilizing the Renesas RZ/G3E MPU, designed for industrial applications, particularly HMI and Edge AI.  It boasts a powerful Cortex-A55 CPU, a Cortex-M33 core, and an Ethos-U55 NPU for AI acceleration, alongside comprehensive connectivity options.  The SiP offers flexible memory configurations and supports dual displays and video codecs.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/01/aries-msrzg3e-osm-compliant-sip-with-renesas-rz-g3e-mpu-targets-industrial-hmi-and-edge-ai/"
  },
  {
    "title": "Fogwise AIRbox Q900 $599 Qualcomm IQ-9075 AI Box delivers up to 200 TOPS of AI performance",
    "summary": "The Fogwise AIRbox Q900 is a new AI box utilizing a Qualcomm IQ-9075 SoC, offering 200 TOPS of AI performance, 36GB of RAM, and 128GB of storage. It's positioned as a cost-effective alternative to the NVIDIA Jetson Orin NX, boasting similar performance and efficiency. The box includes real-time cores and multiple processing units for versatile AI applications.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware",
      "Rockchip",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/09/30/fogwise-airbox-q900-599-qualcomm-iq-9075-ai-box-delivers-up-to-200-tops-of-ai-performance/"
  },
  {
    "title": "Orange Pi AI Studio Pro A Huawei Ascend 310 AI box with up to 352 TOPS, 192GB RAM",
    "summary": "The Orange Pi AI Studio Pro is an AI box featuring two Huawei Ascend 310 processors, delivering up to 352 TOPS of processing power and 192GB of RAM. It builds upon the previous Orange Pi AIPro and prioritizes AI performance through its octa-core architecture.  However, it has limited connectivity with only a USB 4.0 Type-C port.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware"
    ],
    "link": "https://www.cnx-software.com/2025/09/30/orange-pi-ai-studio-pro-huawei-ascend-310-ai-mini-pc-with-up-to-352-tops-192gb-ram/"
  },
  {
    "title": "Intel N97 mini-ITX motherboard targets industrial automation, digital signage, networking appliances",
    "summary": "The Jetway DMTX-ADN1 mini-ITX motherboard utilizes the Intel N97 Alder Lake-N SoC, designed for demanding applications like industrial automation, digital signage, and networking. It offers robust features including DDR5 memory support, multiple display outputs, and extensive I/O capabilities. This versatile motherboard is ideal for kiosks and other embedded systems needing high performance and reliability.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/09/30/intel-n97-mini-itx-motherboard-targets-industrial-automation-digital-signage-networking-appliances/"
  },
  {
    "title": "Linux 6.17 release Main changes, Arm, RISC-V, and MIPS architectures",
    "summary": "Linux kernel 6.17 was released with primarily minor fixes, including Bluetooth locking fixes to prevent use-after-free errors. Driver updates, particularly for GPUs and networking, along with filesystem and core kernel improvements, comprised the majority of the changes. The merge window for 6.18 is opening with a substantial backlog of pull requests.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/09/29/linux-6-17-release-main-changes-arm-risc-v-and-mips-architectures/"
  },
  {
    "title": "Olimex RP2350-PICO2 open hardware boards expose all 48 GPIOs for breadboard prototyping",
    "summary": "Olimex has released the RP2350-PICO2-BB48 and BB48R open hardware boards based on the RP2350B MCU, offering all 48 GPIOs for easy breadboard prototyping. These boards feature a breadboard-friendly design with options for PSRAM and microSD, alongside USB-C power, and various connectors. They are ideal for DIY projects and hardware experimentation.",
    "tags": [
      "Hardware",
      "Raspberry Pi",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/09/29/olimex-rp2350-pico2-open-hardware-boards-expose-all-48-gpios-for-breadboard-prototyping/"
  },
  {
    "title": "LUNYEE 4040 PRO CNC router review with Candle software",
    "summary": "The LUNYEE 4040 PRO CNC router is a robust machine designed for milling and engraving, featuring a larger work volume and a comprehensive accessory set including a probe system. This review utilizes Candle software, contrasting it with the previous 3018 Pro Ultra. It's particularly well-suited for beginners due to the included accessories and ease of setup.",
    "tags": [
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/09/28/lunyee-4040-pro-cnc-router-review-with-candle-software/"
  },
  {
    "title": "Fing Agent Raspberry Pi Kit",
    "summary": "Fing has launched the Fing Agent Raspberry Pi Kit, a plug-and-play network monitoring solution based on a Raspberry Pi 4. This kit simplifies setup compared to the previous Fingbox appliance, offering features like device monitoring, uptime tracking, intrusion detection, and alerts. It integrates with the Fing app and supports advanced diagnostic tools.",
    "tags": [
      "Raspberry Pi",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/27/fing-agent-raspberry-pi-kit-an-all-in-one-raspberry-pi-4-based-network-monitoring-solution/"
  },
  {
    "title": "Nordic nRF54LM20A Cortex-M33 wireless MCU doubles the SRAM to 512 KB, increases flash capacity",
    "summary": "The Nordic nRF54LM20A is a new Cortex-M33-based wireless MCU featuring significantly increased memory – 512 KB of SRAM and higher flash capacity – compared to the nRF54L15. Targeted for diverse applications like HID peripherals and gaming, it integrates advanced features including a RISC-V coprocessor and a 2.4 GHz ultra-low-power radio. This enhanced MCU offers improved performance, efficiency, and power consumption compared to previous nRF52 series devices.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/26/nordic-nrf54lm20a-cortex-m33-wireless-mcu-doubles-the-sram-to-512-kb-increases-flash-capacity/"
  },
  {
    "title": "Arduino cloud adds Bluetooth based provisioning, starting with UNO R4 WiFi",
    "summary": "Arduino has launched a new Bluetooth-based provisioning flow for the UNO R4 WiFi board through the Arduino IoT Cloud Remote app, simplifying initial setup and eliminating the need for cables. This new feature allows users to power, connect, and configure the board, and once provisioned, it can be managed with a suite of cloud features. Future updates will extend this functionality to more Arduino boards.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/26/arduino-cloud-adds-bluetooth-based-provisioning-starting-with-uno-r4-wifi/"
  },
  {
    "title": "A Catalyst for Open Source: NextPCB Launches KiCad Projects Platform to Fuel the Future of KiCad (Sponsored)",
    "summary": "NextPCB has launched kicadprojects.com, a platform designed to foster the KiCad open-source community by enabling project sharing, collaboration, and streamlining workflows.  As a platinum KiCad sponsor, NextPCB is committed to supporting the community through this initiative and donating $10 USD per approved project. This platform aims to accelerate innovation and growth within the open-source electronics design space.",
    "tags": [
      "Hardware",
      "Trends",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/09/26/a-catalyst-for-open-source-nextpcb-launches-kicad-projects-platform-to-fuel-the-future-of-kicad/"
  },
  {
    "title": "Espressif s EchoEar ESP32-S3 voice-controlled AI chatbot runs esp-brookesia firmware",
    "summary": "The Espressif EchoEar is a compact ESP32-S3 AI chatbot featuring a circular touch display, dual microphones, and support for large AI models like OpenAI and Gemini. It leverages the ESP32-S3-WROOM-1 SoC with a dual-core Tensilica LX7 processor and utilizes edge AI capabilities. The device includes a speaker, microSD card slot, and IMU for a versatile voice-controlled experience.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware"
    ],
    "link": "https://www.cnx-software.com/2025/09/26/espressif-echoear-esp32-s3-voice-controlled-ai-chatbot-with-circular-touchscreen-and-mic-array/"
  },
  {
    "title": "Raspberry Pi 500+ mechanical keyboard PC gets 256 GB NVMe SSD, 16GB RAM, RGB LED lighting",
    "summary": "The Raspberry Pi 500+ is a significant upgrade to the original Pi 500 keyboard PC, featuring a mechanical keyboard, RGB LED lighting, and upgraded storage with a 256GB NVMe SSD and 16GB RAM. It retains the original's ports and features including micro HDMI ports, Gigabit Ethernet, and WiFi 5. This enhanced model offers improved performance for demanding tasks while maintaining compatibility with existing accessories.",
    "tags": [
      "Raspberry Pi",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/25/raspberry-pi-500-mechanical-keyboard-pc-gets-256-gb-nvme-ssd-16gb-ram-rgb-led-lighting/"
  },
  {
    "title": "5 Ways Embedded AI Processors are Revolutionizing Device Performance (Sponsored)",
    "summary": "Edge AI is shifting processing from the cloud to devices, driven by the need for faster responses and enhanced privacy. Embedded AI processors enable real-time decision-making by running optimized models locally, crucial for applications like industrial automation. This trend is fueling significant investment, projected to reach $261 billion by 2025.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/25/5-ways-embedded-ai-processors-are-revolutionizing-device-performance/"
  },
  {
    "title": "BIOSTAR MU-N150   A Twin Lake fanless Industrial PC with 2.5GbE, triple 4K video output",
    "summary": "The BIOSTAR EdgeComp MU-N150 is a fanless industrial PC utilizing the Intel Processor N150 Twin Lake SoC, designed for applications like edge computing and HMI. It boasts dual 2.5GbE ports, triple 4K video output, and expansion slots for storage and wireless connectivity.  Built for industrial environments, it offers robust durability and compatibility with various operating systems.",
    "tags": [
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/09/25/biostar-mu-n150-a-twin-lake-fanless-industrial-pc-with-2-5gbe-triple-4k-video-output/"
  },
  {
    "title": "Particle Tachyon Review A Qualcomm QCM6490 Edge AI and 5G cellular SBC tested with Ubuntu",
    "summary": "This review examines the Particle Tachyon SBC, a board based on the Qualcomm QCM6490 platform, designed for edge AI and connectivity applications. It features an octa-core CPU, 5G, Wi-Fi 6E, and Bluetooth 5.2, alongside Raspberry Pi-compatible I/O and various connectivity options. The board arrived fully packaged and ready for testing with Ubuntu.",
    "tags": [
      "Edge AI",
      "Hardware",
      "Semiconductors",
      "Rockchip"
    ],
    "link": "https://www.cnx-software.com/2025/09/24/particle-tachyon-review-a-qualcomm-qcm6490-edge-ai-and-5g-cellular-sbc-tested-with-ubuntu/"
  },
  {
    "title": "Renesas RA0L1 low-cost Cortex-M23 MCUs adds capacitive, EMI-resistant touch",
    "summary": "Renesas has launched the RA0L1 MCU, the first in its RA0 series, incorporating integrated capacitive touch technology alongside features like a 1% on-chip oscillator and safety functions. Targeted at low-cost, battery-powered applications, the RA0L1 offers a robust combination of memory, peripherals, and capacitive touch capabilities. It’s designed for responsive touch control with ultra-low current consumption.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/24/renesas-ra0l1-low-cost-cortex-m23-mcus-adds-capacitive-emi-resistant-touch/"
  },
  {
    "title": "Raspberry Pi CM0 castellated module features Raspberry Pi RP3A0 System-in-Package",
    "summary": "A new Raspberry Pi CM0 Compute Module based on the RP3A0 SiP is emerging, similar to the Raspberry Pi Zero 2 W and CM3E. It utilizes a Broadcom BCM2710A1 quad-core Cortex-A53 processor and features options for 8GB or 16GB eMMC flash storage. This module is likely targeting business customers and offers a familiar Raspberry Pi experience.",
    "tags": [
      "Raspberry Pi",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/09/23/raspberry-pi-cm0-castellated-module-features-raspberry-pi-rp3a0-system-in-package/"
  },
  {
    "title": "DuckyPad Pro 20-key ESP32-S3 macropad supports up to 3700+ macros using duckyScript language",
    "summary": "The DuckyPad Pro is a powerful macropad built on an ESP32-S3, allowing users to create complex macros up to 3700+ using the duckyScript language. Featuring hot-swappable switches, rotary encoders, and an OLED display, it's designed for automation and scripting across various applications and workflows. With features like microSD storage and Bluetooth connectivity, this device caters to a wide range of users, including developers, streamers, and security researchers.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/23/duckypad-pro-20-key-esp32-s3-macropad-supports-up-to-3700-macros-using-duckyscript-language/"
  },
  {
    "title": "Luckfox PicoKVM   A low-cost IP-KVM with 1080p HDMI capture, Wake-on-LAN, virtual storage emulation",
    "summary": "The Luckfox PicoKVM is a compact and affordable IP-KVM device enabling remote control of PCs and development boards. It features 1080p60 HDMI capture with low latency and supports Wake-on-LAN, alongside virtual storage emulation. Powered by a Rockchip RV1106 processor, it offers extensive management capabilities including web and serial terminals.",
    "tags": [
      "Hardware",
      "Rockchip",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/09/23/luckfox-picokvm-low-cost-ip-kvm-with-1080p-hdmi-capture-wake-on-lan-virtual-storage-emulation/"
  },
  {
    "title": "Using an overpowered vape as a secondary display",
    "summary": "A hacker has demonstrated running DOOM on an Aspire PIXO vape, utilizing its internal MCU, LCD, and USB-C port as a surprisingly capable secondary display. The project leverages an Aspire PIXO vape with a Cortex-M4F microcontroller and other components like Bluetooth and a color LCD. This showcases the potential for repurposing vape hardware for unconventional computing tasks.",
    "tags": [
      "Hardware",
      "Trends",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/09/22/using-an-overpowered-vape-as-a-secondary-display/"
  },
  {
    "title": "Compex JustWiFi driverless, Ethernet-connected Wi-Fi 7 module delivers up to 10 Gbps throughput (Sponsored)",
    "summary": "Compex Systems has introduced the JustWiFi module, a driverless Wi-Fi 7 solution that connects via Ethernet, offering up to 10 Gbps throughput. This innovative module simplifies Wi-Fi integration by eliminating the need for drivers and associated compatibility issues often encountered with traditional Wi-Fi modules.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/22/compex-justwifi7-driverless-ethernet-connected-wi-fi-7-module-delivers-up-to-10-gbps-throughput/"
  }
]