[
  {
    "title": "Clean-sheet open source 8-bit gaming console surprisingly preparing for launch in 2025",
    "summary": "A new open-source 8-bit gaming console, dubbed GameTank, is being developed and is slated for launch in 2025.  Notably, the console utilizes twin 6502 processors rather than more common technologies like FPGAs or microcontrollers. This represents a unique approach in the burgeoning 8-bit console market.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/video-games/retro-gaming/clean-sheet-open-source-8-bit-console-surprisingly-preparing-for-launch-in-2025-the-gametank-uses-twin-6502-processors-instead-of-fpgas-or-microcontrollers"
  },
  {
    "title": "Corsair Sabre v2 Pro review: 36g but maybe too lightweight on features",
    "summary": "The Corsair Sabre v2 Pro is praised for its incredibly light weight (36g) and smooth gliding performance. However, its reliance on web-based software results in a lack of physical customization options like DPI switching. This makes it feel somewhat limited compared to other high-end mice.",
    "tags": [
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.tomshardware.com/peripherals/gaming-mice/corsair-sabre-v2-pro-review"
  },
  {
    "title": "The world's tiniest GPU heads to production",
    "summary": "TinyGPU v2.0, a GPU featuring 200,000 transistors, has been released for real-time 3D rendering. It can handle up to 1,000 triangles with gamepad manipulation and incorporates transformation and lighting technologies. This marks a significant update for this incredibly small GPU.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/gpus/the-worlds-tiniest-gpu-heads-to-production-200-000-200-000-transistor-tinygpu-v2-0-can-render-gamepad-manipulated-3d-images-with-up-to-1k-triangles-in-real-time"
  },
  {
    "title": "Hard drives on backorder for two years as AI data centers trigger HDD shortage   delays forcing rapid transition to QLC SSDs",
    "summary": "The AI industry's rapid growth is causing a significant shortage of high-capacity server HDDs, with production backorders extending for two years. Cloud providers are reacting by quickly adopting QLC NAND SSDs to bypass these extended lead times. This highlights a broader hardware shortage impacting the industry.",
    "tags": [
      "AI",
      "Hardware",
      "Trends",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/hdds/ai-triggers-hard-drive-shortage-amidst-dram-squeeze-enterprise-hard-drives-on-backorder-by-2-years-as-hyperscalers-switch-to-qlc-ssds"
  },
  {
    "title": "No Longer Evil Thermostat hack strips Google from Nest thermostat to heat your home better",
    "summary": "A developer's open-source project, No Longer Evil Thermostat, has revived discontinued Google Nest Gen 1 and Gen 2 thermostats. This allows users to gain more precise control over their home heating by replacing Google's firmware. The project offers an alternative to Google's sunsetted hardware.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/software/no-longer-evil-thermostat-heats-your-home-better-by-removing-google-revive-sunsetted-hardware-gain-more-precise-control-open-source"
  },
  {
    "title": "Laid-off Intel employee allegedly steals 'Top Secret' files, then disappears",
    "summary": "A former Intel software engineer, following a layoff, is accused of stealing confidential documents, including over 18,000 files. The engineer reportedly vanished after downloading the files. Authorities are investigating the circumstances surrounding his disappearance and the theft.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/laid-off-intel-employee-allegedly-steals-top-secret-files-goes-on-the-run-ex-engineer-downloaded-18-000-files-before-disappearing"
  },
  {
    "title": "DIY Amiga sound sampler circuit mystery solved 32 years later",
    "summary": "A long-standing mystery surrounding a DIY Amiga sound sampler circuit has been resolved thanks to a TechTuber's investigation. The solution revealed errors in the original magazine's component specifications. This 32-year-old puzzle was finally brought to light.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/sound-cards/diy-amiga-sound-sampler-circuit-mystery-solved-32-years-later-magazine-instructions-had-key-component-spec-typos"
  },
  {
    "title": "500 disposable vapes recycled into a powerwall to power a house and workshop",
    "summary": "A UK-based YouTuber, Chris Doel, has created a 50V power system using 500 recycled disposable vape batteries. This innovative system is capable of powering his workshop and home for up to eight hours or three days of work. The project demonstrates a sustainable solution for energy storage.",
    "tags": [
      "Hardware",
      "Trends",
      "Recycling"
    ],
    "link": "https://www.tomshardware.com/tech-industry/500-disposable-vapes-recycled-into-a-powerwall-to-power-a-house-and-workshop-enough-juice-for-up-to-eight-hours-of-home-usage-or-three-days-of-work"
  },
  {
    "title": "This week in 1982, Compaq announced the first true IBM PC clone   it was portable, too, as long as you were comfortable lugging 28 pounds",
    "summary": "In November 1982, Compaq unveiled the first genuine IBM PC clone, a significant moment in computing history. Notably, the Compaq model was also designed to be portable, though this portability came with a hefty 28-pound weight. IBM's response to this innovation wouldn't arrive for another year.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/desktops/pc-building/this-week-in-1982-compaq-announced-the-first-true-ibm-pc-clone-it-was-a-portable-too-as-long-as-you-were-comfortable-lugging-28-pounds"
  },
  {
    "title": "Corsair's premium SFF case sees a massive 70% price drop to $59 iCUE Link 2500X hits a new historic low",
    "summary": "The Corsair iCUE Link 2500X SFF case, known for its support for m-ATX and mini-ITX boards, extensive fan support, and large GPU clearance, has dramatically reduced in price to $59. This significant drop makes the case’s impressive features more accessible to a wider range of users.  It represents a new historic low in pricing for this dual-chamber design.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/pc-cases/corsairs-premium-sff-case-sees-a-massive-70-percent-price-drop-to-usd59-icue-link-2500x-hits-a-new-historic-low"
  },
  {
    "title": "OpenAI asks U.S. to expand CHIPS Act tax credit to cover AI infrastructure despite firm's denial wanting a government 'backstop' for its massive loans",
    "summary": "OpenAI is requesting the U.S. government to broaden the CHIPS Act's tax credits to finance the construction of AI infrastructure, encompassing elements like servers and data centers. This request comes despite OpenAI’s previous stance against relying on a government 'backstop' for its significant loans. The aim is to bolster the development of AI capabilities within the United States.",
    "tags": [
      "AI",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/openai-asks-us-to-expand-chips-act-tax-credit-to-cover-ai-infrastructure"
  },
  {
    "title": "Chipmaking industry pushes back on U.S. Patent Office considering imposing annual fee based on assessed value",
    "summary": "The semiconductor industry is strongly opposing a proposed change to the U.S. Patent Office's fee structure, which would shift from fixed rates to a percentage based on assessed value. This move is drawing significant resistance from the Semiconductor Industry Association. The change raises concerns about the cost of patent maintenance.",
    "tags": [
      "Semiconductors",
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/chipmaking-industry-pushes-back-on-u-s-patent-office-considering-imposing-annual-fee-based-on-assessed-value-tax-on-innovation-draws-strong-statement-from-semiconductor-industry-association"
  },
  {
    "title": "Japanese PC shops limit SSD, HDD, and RAM purchases to prevent hoarding as storage and memory shortage takes hold",
    "summary": "Japanese PC retailers are restricting the quantity of SSDs, HDDs, and RAM customers can buy due to increased demand driven by the growing need for storage and memory – largely fueled by AI applications. This measure is intended to prevent hoarding and address a burgeoning shortage.  Purchasing a complete PC now unlocks higher purchase limits.",
    "tags": [
      "AI",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/japanese-pc-shops-limit-ssd-hdd-and-ram-purchases-to-prevent-hoarding-as-storage-and-memory-shortage-takes-hold-buying-a-full-pc-unlocks-higher-purchase-limits"
  },
  {
    "title": "New DirectX7 emulation tool brings more games to Steam Deck, SteamOS, and other Linux distros through Vulkan, with caveats",
    "summary": "An independent developer is creating a DXVK-based tool that allows DirectX 7 games to run on Linux distributions like SteamOS and the Steam Deck, utilizing Vulkan for emulation. This project expands the range of playable DirectX 7 titles on Linux. However, it's important to note that this technology comes with certain limitations and caveats.",
    "tags": [
      "Hardware",
      "NVIDIA",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/video-games/pc-gaming/new-directx7-emulation-tool-brings-more-games-to-steam-deck-steamos-and-other-linux-distros-through-vulkan-with-caveats"
  },
  {
    "title": "Investigators recover black boxes from UPS plane crash, detail data recovery process",
    "summary": "The National Transportation Safety Board (NTSB) has successfully retrieved the cockpit audio from the wreckage of UPS Flight 2967. This was achieved by extracting data from the charred remains of the aircraft. The recovery represents a significant step in the investigation into the cause of the crash.",
    "tags": [
      "Trends",
      "Hardware",
      "AI",
      "Edge AI"
    ],
    "link": "https://www.tomshardware.com/tech-industry/investigators-recover-black-boxes-from-ups-plane-crash-detail-data-recovery-process-ntsb-successfully-extracts-cockpit-audio-from-charred-remains"
  },
  {
    "title": "Modern motherboard features explained: Connectors, headers, ports, and chipsets decoded",
    "summary": "This text provides a guide to understanding the key components of modern motherboards, including expansion slots, RAM, and form factors. It includes a diagram illustrating common ports, headers, and slots found on contemporary boards. The guide aims to decode the technical aspects of motherboard design.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/motherboards/modern-motherboard-features-explained-connectors-headers-ports-and-chipsets-decoded"
  },
  {
    "title": "Retro PC Gaming the Easy Way with DOSBox Pure Unleashed",
    "summary": "DOSBox Pure Unleashed offers a convenient way to enjoy classic PC games, preserving gaming history even with declining reflexes. It simplifies the process of running these older titles, allowing enthusiasts to revisit nostalgic experiences. The software bridges the gap between modern systems and the legacy of DOS gaming.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/software/retro-pc-gaming-the-easy-way-with-dosbox-pure-unleashed"
  },
  {
    "title": "Gigabyte Aorus FO27Q5P 27-inch 500 Hz QD-OLED gaming monitor review: Superb in every respect",
    "summary": "The Gigabyte Aorus FO27Q5P is a new QD-OLED gaming monitor featuring a 27-inch display with QHD resolution, a 500 Hz refresh rate, and HDR500 support. It boasts an extra-wide gamut Quantum Dot color and Adaptive-Sync technology, promising a premium gaming experience. Overall, it delivers exceptional performance and image quality.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/gigabyte-aorus-fo27q5p-27-inch-500-hz-qd-oled-gaming-monitor-review"
  },
  {
    "title": "SanDisk reportedly jacks up flash prices by 50% as memory makers cash in on AI-fueled demand",
    "summary": "Rising demand from AI data centers is driving up the prices of both DRAM and flash memory. SanDisk is reportedly increasing flash prices by 50% as memory manufacturers capitalize on this increased demand. This trend is likely due to limited wafer supply for these components.",
    "tags": [
      "AI",
      "Semiconductors",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/storage/sandisk-reportedly-jacks-up-flash-prices-by-50-percent-as-memory-makers-cash-in-on-ai-fueled-demand"
  },
  {
    "title": "Samsung teases radical new modular SSD design with swappable NAND and SSD controller that can be detached independently   tiny 4TB PCIe 5.0 M.2 drive is also ready",
    "summary": "Samsung is preparing to unveil the AM9C1 E1.A Detachable AutoSSD and PM9E1 M.2 22x42 SSDs at CES 2026. These SSDs feature a radical modular design with the ability to swap both the NAND and SSD controller independently. A 4TB PCIe 5.0 M.2 drive is also slated to be available.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/ssds/samsung-teases-modular-ssd-with-swappable-nand-and-ssd-controller-compact-4tb-pcie-5-0-m-2-2242-drive-is-also-ready-to-deploy"
  },
  {
    "title": "AMD warns the Intel and Nvidia partnership is a risk to its business",
    "summary": "AMD has identified Nvidia's $5 billion investment in Intel as a significant risk, according to its quarterly report. The report highlights concerns about 'increased competition and pricing pressure' stemming from this partnership. This represents a potential threat to AMD's business operations.",
    "tags": [
      "NVIDIA",
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/amd-warns-intel-nvidia-partnership-is-a-business-risk-quarterly-report-outlines-risk-from-increased-competition-and-pricing-pressure"
  },
  {
    "title": "CPU collector peels the lid off a Soviet-era fish can chip to peer inside with multiple microscopes",
    "summary": "A CPU collector meticulously examined a Soviet-era computer chip, originally used in devices like the Apple II and IBM PC. Using multiple microscopes, the collector documented the internal components of the K565RU3 chip, a Cold War-era clone of Western designs. This project showcases a unique piece of retro electronics history.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/dram/cpu-collector-peels-the-lid-off-a-soviet-era-fish-can-chip-to-peer-inside-with-multiple-microscopes-k565ru3-was-a-soviet-era-clone-of-western-chips-like-the-intel-designed-4116"
  },
  {
    "title": "Radical gamer repurposes $1,700 ROG Astral RTX 5080 into a working DIY skateboard rides graphics card down the street while walking dog",
    "summary": "A PC Master Race user creatively transformed a high-end ROG Astral RTX 5080 graphics card into a skateboard. The card’s cooler serves as the deck, and the user rides it down the street while walking their dog. This unique project showcases ingenuity and a passion for gaming hardware.",
    "tags": [
      "Hardware",
      "NVIDIA"
    ],
    "link": "https://www.tomshardware.com/pc-components/gpus/radical-gamer-repurposes-usd1-700-rog-atral-rtx-5080-into-a-diy-skateboard-rides-graphics-card-down-the-street-while-walking-dog"
  },
  {
    "title": "Nvidia's RTX 5000 Super could be cancelled or get pricier due to AI-induced GDDR7 woes",
    "summary": "Rumors suggest Nvidia's planned RTX 5000 Super series might be canceled due to a shortage of 3GB GDDR7 memory chips. This shortage is being driven by increased demand from AI applications. Consequently, the cards could become significantly more expensive.",
    "tags": [
      "NVIDIA",
      "Semiconductors",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/gpus/nvidias-rtx-5000-super-could-be-cancelled-or-get-pricier-due-to-ai-induced-gddr7-woes-rumor-claims-3-gb-memory-chips-are-now-too-valuable-for-consumer-gpus"
  },
  {
    "title": "AMD s record quarter shows strength in client and AI, as Ryzen leads the charge but data center dominance could be out of reach",
    "summary": "AMD achieved a record-breaking $9.2 billion in revenue for Q3 2025, driven by strong performance in both client and AI segments. The Ryzen 7 9800X3D fueled a recovery in laptop and desktop sales. Despite this success, the company faces a challenge in fully overtaking data center dominance.",
    "tags": [
      "AI",
      "Semiconductors",
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/amd-record-quarter-shows-strength-but-data-center-dominance-could-be-out-of-reach"
  },
  {
    "title": "China suspends rare-earth export control measures, easing key flashpoint in US-China trade war",
    "summary": "China has decided to temporarily halt its strict export controls on rare-earth materials for one year. This action is intended to provide a window for continued trade negotiations with the United States, addressing a significant point of contention in the ongoing trade war.",
    "tags": [
      "Trends",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/china-suspends-rare-earth-export-control-measures-easing-key-flashpoint-in-us-china-trade-war-one-year-reprieve-allows-for-trade-talks-with-the-u-s-to-continue"
  },
  {
    "title": "Elon Musk says building his own 'TeraFab' chip fab may be the only answer to Tesla's colossal AI semiconductor demand   Nvidia CEO Jensen Huang warns against 'extremely hard' challenge",
    "summary": "Elon Musk believes Tesla requires a massive 'TeraFab' chip factory to meet its surging AI processor needs, potentially making Tesla a major chip producer. However, Nvidia CEO Jensen Huang cautions that establishing a modern semiconductor fab is a significantly more difficult undertaking than Musk anticipates. This highlights the immense technical challenges involved in independent chip manufacturing.",
    "tags": [
      "AI",
      "Semiconductors",
      "NVIDIA",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/elon-musk-says-terafab-chip-fab-may-be-the-only-answer-to-teslas-colossal-ai-semiconductor-demand-nvidia-ceo-jensen-huang-warns-against-extremely-hard-challenge"
  },
  {
    "title": "Print big, spend small with this early Black Friday deal on the Halot-X1 resin 3D printer now with $130 off the MSRP",
    "summary": "This Black Friday, get a large-format resin 3D printer with the Halot-X1, now discounted by $130. It's designed for precision and speed while operating quietly.  This offers a cost-effective way to enjoy high-quality 3D printing.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/3d-printing/print-big-spend-small-with-this-early-black-friday-deal-on-the-halot-x1-resin-3d-printer-now-with-usd130-off-the-msrp"
  },
  {
    "title": "Explosive AI buildout brings into question water supply concerns exploring how data centers could curb water demands",
    "summary": "The rapid growth of AI is driving a surge in data center construction, raising concerns about the significant water demands these facilities place on local water sources. This increased demand could lead to competition with communities for access to clean drinking water.  Addressing these water supply challenges is becoming a critical consideration.",
    "tags": [
      "AI",
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/tech-industry/explosive-ai-buildout-brings-into-question-water-supply-concerns-exploring-how-data-centers-could-curb-water-demands"
  },
  {
    "title": "Sam Altman backs away from OpenAI's statements about possible U.S. gov't AI industry bailouts   company continues to lobby for financial support from the industry",
    "summary": "OpenAI CEO Sam Altman retracted previous statements suggesting the company sought government guarantees for its data centers. Despite this, OpenAI continues to actively lobby for financial support from the industry. This shift indicates a more cautious approach regarding direct government involvement.",
    "tags": [
      "AI",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/sam-altman-distances-openai-from-data-center-bailout-talk"
  },
  {
    "title": "Dutch government allegedly folds to supply chain pressure, will relinquish control of Nexperia in China spat",
    "summary": "The Dutch government is considering ceding control of Nexperia to resolve a trade dispute with China. This decision hinges on China's agreement to permit the resumption of chip exports from the firm's Chinese factory. It appears the Dutch government is prioritizing supply chain stability over maintaining control of the company.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/dutch-government-allegedly-folds-to-supply-chain-pressure-will-relinquish-control-of-nexperia-in-china-spat-reports-say-deal-contingent-upon-china-allowing-firm-to-resume-chip-exports"
  },
  {
    "title": "Jensen Huang confirms there are no plans to ship Blackwell GPUs to China right now, chipmaker at Beijing's mercy",
    "summary": "Nvidia CEO Jensen Huang has stated that there are currently no active discussions regarding shipping its Blackwell GPUs to China, following U.S. government restrictions. The company also needs approval from Chinese authorities to conduct any sales. This highlights Nvidia's dependence on Chinese approval for market access.",
    "tags": [
      "NVIDIA",
      "Semiconductors",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/jensen-huang-confirms-there-are-no-plans-to-ship-blackwell-gpus-to-china-right-now-chipmaker-at-beijings-mercy-nvidia-ceo-says-shipments-havent-been-approved-by-chinese-authorities"
  },
  {
    "title": "It's rare, but we found an RTX 5070 that's at actual MSRP Just $479.99",
    "summary": "Newegg is offering an MSI RTX 5070 GPU at a surprising price of $479.99, significantly below the typical MSRP. This represents a rare find in the current GPU market.",
    "tags": [
      "NVIDIA",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/gpus/its-rare-but-we-found-an-rtx-5070-thats-at-actual-msrp-just-usd479-99-for-this-msi-rtx-5070-in-neweggs-early-black-friday-sales"
  },
  {
    "title": "This 249 MSI gaming monitor unlocks 4K on a budget save 100 on this dual-mode display with up to 320Hz refresh rate",
    "summary": "This MSI gaming monitor offers 4K gaming capabilities and a refresh rate of up to 320Hz, making it a budget-friendly option. A discount of $100 is available on this dual-mode display.  It’s a compelling choice for gamers seeking high refresh rates and 4K resolution.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/this-gbp249-msi-gaming-monitor-unlocks-4k-on-a-budget-save-gbp100-on-this-dual-mode-display-with-up-to-320hz-refresh-rate"
  },
  {
    "title": "Linux software management made simple with Discover",
    "summary": "Discover provides a user-friendly interface for managing software on Linux, addressing the complexity often faced by new users. It's presented as a powerful solution, simplifying the process of software management. The article highlights Discover's ease of use as a key benefit.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/software/linux/linux-software-management-made-simple-with-discover"
  },
  {
    "title": "QIDI Q2 Combo review: Great high temp printer, but skip the QIDI Box",
    "summary": "The QIDI Q2 3D printer itself is highly recommended, particularly for its ability to handle high temperatures. However, the accompanying QIDI Box accessory is deemed underwhelming and not worth purchasing. The reviewer suggests omitting the box for a better overall experience.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/3d-printing/qidi-q2-combo-review"
  },
  {
    "title": "The world is overly reliant on one US-located mine for critical chipmaking material, but China is working to break the stranglehold",
    "summary": "The global semiconductor industry heavily depends on a single North Carolina mine for high-purity quartz, a vital component in chip manufacturing. Recognizing this vulnerability, China is investing heavily in synthetic quartz production to reduce its reliance on the US source. This strategic move aims to diversify supply chains and mitigate potential disruptions.",
    "tags": [
      "Semiconductors",
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/tech-industry/the-world-is-overly-reliant-on-one-us-located-mine-for-critical-chipmaking-material-but-china-is-working-to-break-the-stranglehold-china-investing-over-usd14-million-in-synthetic-quartz-manufacturing-to-diversify-away-from-us-dependency"
  },
  {
    "title": "Substrate's claims about revolutionary ASML-beating chipmaking technology scrutinized, analyst likens the venture to a fraud report pokes holes in the startup's technology, messaging, and leaders",
    "summary": "An analyst has labeled Substrate's claims of ASML-beating chipmaking technology as fraudulent, citing issues with the startup's technology, messaging, and leadership. A recent report reveals significant doubts surrounding Substrate's capabilities. This assessment casts serious questions on the company's ambitious promises.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/substrates-claims-about-revolutionary-asml-beating-chipmaking-technology-scrutinized-analyst-likens-the-venture-to-a-fraud-report-pokes-holes-in-the-startups-technology-messaging-and-leaders"
  },
  {
    "title": "Asus to include sag detection for monstrous new ROG Matrix RTX 5090 GPU Level Sense can warn users of a mere 0.10 degree shift",
    "summary": "Asus's new ROG Matrix RTX 5090 GPU will launch with Level Sense technology to combat GPU sag. This feature utilizes precise detection, capable of identifying shifts as small as 0.10 degrees. It will proactively warn users about potential instability caused by GPU movement.",
    "tags": [
      "Hardware",
      "NVIDIA",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/gpus/asus-to-include-sag-detection-for-monstrous-new-rog-matrix-rtx-5090-gpu-level-sense-can-warn-users-of-a-mere-0-10-degree-shift"
  },
  {
    "title": "Corsair HX1000i SHIFT 1000W power supply review",
    "summary": "The Corsair HX1000i SHIFT is a premium 1000W power supply boasting revolutionary cable management through side-mounted connectors and iCUE ecosystem integration. It's designed for high-performance builds but requires specific motherboard compatibility and comes with a higher price tag.  This power supply prioritizes cutting-edge design and control for serious PC builders.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/power-supplies/corsair-hx1000i-shift-1000w-power-supply-review"
  },
  {
    "title": "Defying anti-cheat, creator gets Battlefield 6 running on 12-year-old AMD FX-9590 CPU, playable at 40+ FPS in 786p with an RX 5700 GPU",
    "summary": "A surprising experiment revealed that an 12-year-old AMD FX-9590 CPU could run Battlefield 6 at playable frame rates (40+ FPS at 786p) with an RX 5700 GPU.  The key to bypassing anti-cheat measures was only SecureBoot, not the required TPM. This indicates TPM is not necessary for Battlefield 6's anti-cheat system.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/video-games/pc-gaming/youtuber-gets-battlefield-6-running-on-12-year-old-amd-fx-9590-cpu-playable-at-40-fps-in-786p-with-an-rx-5700-gpu-experiment-reveals-only-secureboot-not-tpm-is-necessary-for-javelin-anti-cheat"
  },
  {
    "title": "Storied Windows dev reminisces about Microsoft's first hardware product 45 years ago   the Z-80 SoftCard was an Apple II add-in card",
    "summary": "Raymond Chen recently discussed Microsoft's initial foray into hardware, specifically the 1980 Z-80 SoftCard, an add-in card for the Apple II. This product represents Microsoft's first hardware development effort, dating back 45 years. The SoftCard’s creation offers a glimpse into the early stages of Microsoft’s hardware ambitions.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/software/storied-windows-dev-reminisces-about-microsofts-first-hardware-product-45-years-ago-the-z-80-softcard-was-an-apple-ii-add-in-card"
  },
  {
    "title": "GTA 6 delayed again, this time to November 2026",
    "summary": "Rockstar Games has pushed back the release of Grand Theft Auto VI to November 19, 2026, citing the need to deliver the high quality players expect. This represents a six-month delay from the originally planned May 26, 2026 launch. The delay is attributed to Rockstar's commitment to meeting player expectations.",
    "tags": [
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/video-games/gta-6-delayed-again-this-time-to-november-2026-rockstar-says-extra-time-needed-to-deliver-quality-that-players-have-come-to-expect-and-deserve"
  },
  {
    "title": "Apple's latest MacBook Air, MacBook Pro, and Mac Mini are on sale ahead of Black Friday several models drop to all-time low prices",
    "summary": "Apple's MacBook Air, MacBook Pro, and Mac Mini are currently available at record-low prices in anticipation of Black Friday. These iconic laptops, featuring the M4 chip, represent an excellent opportunity for consumers.  The discounted prices make them a particularly attractive purchase.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/laptops/macbooks/apples-latest-macbook-air-macbook-pro-and-mac-mini-are-on-sale-ahead-of-black-friday-several-models-drop-to-all-time-low-prices"
  },
  {
    "title": "This $234.99 Intel Arc B580 is a brilliant budget-friendly graphics card upgrade 12GB of VRAM unlocks 1440p gaming, with Battlefield 6 thrown in for free",
    "summary": "An Intel Arc B580 graphics card is being offered at a discounted price of $234.99, making it an excellent budget-friendly option for 1440p gaming. It boasts 12GB of VRAM, allowing for smooth performance, and includes a free copy of Battlefield 6. This card is designed for gamers looking to upgrade their systems affordably.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/gpus/this-usd234-99-intel-arc-b580-is-a-brilliant-budget-friendly-graphics-card-upgrade-12gb-of-vram-unlocks-1440p-gaming-with-battlefield-6-thrown-in-for-free"
  },
  {
    "title": "AMD's budget Ryzen 5 7500X3D leaks out in early benchmarks, scores hint at performance on par with existing 7600X3D   budget offering could pack a punch in both single and multi-core tests",
    "summary": "Early benchmarks of AMD's upcoming Ryzen 5 7500X3D reveal performance comparable to the 7600X3D, indicating a strong budget X3D option. The chip features the same 96MB of L3 cache, but the high cost of DDR5 memory may limit its appeal to budget-conscious gamers. This represents a potentially competitive entry into the AM5 platform.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/cpus/amds-budget-ryzen-5-7500x3d-leaks-out-in-early-benchmarks-scores-hint-at-performance-on-par-with-existing-7600x3d-budget-offering-could-pack-a-punch-in-both-single-and-multi-core-tests"
  },
  {
    "title": "As expected, Nvidia's $3,999 mini AI supercomputer is terrible for gaming",
    "summary": "A Redditor tested the Nvidia DGX Spark, a $3,999 mini AI supercomputer, for gaming performance. The results showed it struggled significantly, only achieving around 50 FPS at 1080p with medium settings in Cyberpunk 2077. This highlights the DGX Spark's unsuitability for mainstream gaming.",
    "tags": [
      "NVIDIA",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/video-games/pc-gaming/as-expected-nvidias-usd3-999-mini-ai-supercomputer-is-terrible-for-gaming-dgx-spark-struggles-to-hit-50-fps-at-1080p-on-medium-settings-in-cyberpunk-2077"
  },
  {
    "title": "Google deploys new Axion CPUs and seventh-gen Ironwood TPU training and inferencing pods beat Nvidia GB300 and shape 'AI Hypercomputer' model",
    "summary": "Google Cloud has introduced new Axion CPUs and seventh-generation Ironwood TPUs designed for AI acceleration, combining Arm processors with significant AI performance. These Ironwood pods, boasting up to 9,216 chips and 42.5 FP8 ExaFLOPS, outperform Nvidia's GB300 systems and are central to Google's 'AI Hypercomputer.'  This represents a new competitive offering for large-scale AI model training and inference.",
    "tags": [
      "AI",
      "Machine Learning",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/google-deploys-new-axion-cpus-and-seventh-gen-ironwood-tpu-training-and-inferencing-pods-beat-nvidia-gb300-and-shape-ai-hypercomputer-model"
  },
  {
    "title": "$5,000 Corsair pre-built keeps on frying Intel CPUs due to lack of BIOS update, tech alleges kills three Intel Core i9 chips because latest version still doesn t have fix for Intel crashing issues",
    "summary": "A Corsair pre-built computer is causing Intel CPUs to fail repeatedly due to a missing BIOS update.  Specifically, the 0x12F Vmin instability fix is absent, leading to the destruction of multiple Intel Core i9 processors.  This issue highlights a critical software deficiency impacting customer hardware.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/cpus/usd5-000-corsair-pre-built-keeps-on-frying-intel-cpus-due-to-lack-of-bios-update-tech-alleges-kills-three-intel-core-i9-chips-because-latest-version-still-doesnt-have-fix-for-intel-crashing-issues"
  },
  {
    "title": "US govt committee slams Nvidia over shared campus with banned Huawei affiliate   says China has been in Nvidia s backyard for a decade, literally",
    "summary": "A U.S. government committee has criticized NVIDIA for sharing a campus with a former Huawei affiliate, Futurewei, which operated an office there for approximately ten years. This allowed China significant presence near NVIDIA's operations. The situation highlights a long-standing strategic concern about China's access to U.S. technology and innovation.",
    "tags": [
      "NVIDIA",
      "Semiconductors",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/us-govt-committee-slams-nvidia-over-shared-campus-with-banned-huawei-affiliate-says-china-has-been-in-nvidias-backyard-for-a-decade-literally"
  },
  {
    "title": "Using the Raspberry Pi 500+ keyboard PC as a regular Bluetooth keyboard",
    "summary": "The Raspberry Pi 500+ keyboard PC can also function as a standard Bluetooth mechanical keyboard. This was utilized when a faulty wireless keyboard was returned for repair, leading to an excess of keyboards. The btferret project enabled this functionality, allowing the author to write this article using the Pi 500+ as a Bluetooth input device.",
    "tags": [
      "Raspberry Pi",
      "Hardware"
    ],
    "link": "https://www.cnx-software.com/2025/11/09/using-the-raspberry-pi-500-keyboard-pc-as-a-regular-bluetooth-keyboard/"
  },
  {
    "title": "Giveaway Week 2025 RAKwireless Blues.ONE LoRaWAN, LTE-M, and NB-IoT devkit",
    "summary": "CNX Software is hosting a giveaway featuring three companies offering devkits. RAKwireless is providing a Blues.ONE devkit, a versatile LoRaWAN, LTE-M, and NB-IoT device suitable for industrial automation and asset tracking. This is a repeat prize from last year, offering another opportunity for readers to win.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/11/09/giveaway-week-2025-rakwireless-blues-one-lorawan-lte-m-and-nb-iot-devkit/"
  },
  {
    "title": "Raspberry Pi 500+ mechanical keyboard PC review with Raspberry Pi OS Trixie",
    "summary": "This review examines the Raspberry Pi 500+ mechanical keyboard PC, utilizing the new Raspberry Pi OS Trixie. The device boasts improvements over the original 500, including increased memory, a larger SSD, and a fully mechanical keyboard with RGB lighting. The focus of the review is on evaluating these enhanced features within the Raspberry Pi OS environment.",
    "tags": [
      "Raspberry Pi",
      "Hardware"
    ],
    "link": "https://www.cnx-software.com/2025/11/08/raspberry-pi-500-mechanical-keyboard-pc-review-with-raspberry-pi-os-trixie/"
  },
  {
    "title": "Giveaway Week 2025 VOIPAC iMX93 Pro industrial development kit",
    "summary": "CNX Software is giving away a VOIPAC iMX93 Pro industrial development kit, featuring an NXP i.MX 93 SoC and offering connectivity options for AI, HMI, and embedded applications.  This kit includes dual Gigabit Ethernet, WiFi 6, and other features, with an alternative option of the iMX91 kit available. The giveaway targets developers working on projects involving Edge AI and embedded systems.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/11/08/giveaway-week-2025-voipac-imx93-pro-industrial-development-kit/"
  },
  {
    "title": "Nexalta Guardian NXG0042AI",
    "summary": "The Nexalta Guardian NXG0042AI is a high-performance networking gateway utilizing a Qualcomm IPQ9574 chipset, boasting 10GbE, WiFi 7, and 5G connectivity alongside local AI capabilities. It supports multiple modems, eSIMs, and various storage options, including AI accelerator modules, making it suitable for diverse IoT and industrial networking applications.  This versatile gateway offers a complete solution for demanding connectivity and processing needs.",
    "tags": [
      "AI",
      "Hardware",
      "Semiconductors",
      "Edge AI",
      "Rockchip"
    ],
    "link": "https://www.cnx-software.com/2025/11/07/nexalta-guardian-nxg0042ai-qualcomm-ipq9574-based-networking-solution-with-10gbe-wifi-7-5g-local-ai/"
  },
  {
    "title": "Giveaway Week 2025 USB Vsense USB PD voltage indicator",
    "summary": "The fifth prize of the CNX Software Giveaway Week 2025 is a USB Vsense USB PD voltage indicator, a device designed to display USB PD voltage levels from 5V to 48V. This multi-layered device, constructed with seven PCBs, was tested with USB PD adapters and a Raspberry Pi 5. Participants can enter the draw by leaving a comment on the CNX Software website.",
    "tags": [
      "Hardware",
      "Raspberry Pi",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/11/07/giveaway-week-2025-usb-vsense-usb-pd-voltage-indicator/"
  },
  {
    "title": "AAEON PICO-ARU4 Arrow Lake Pico-ITX SBC is powered by up to an Intel Core Ultra 7 255U processor",
    "summary": "The AAEON PICO-ARU4 is a groundbreaking Pico-ITX SBC featuring up to an Intel Core Ultra 7 255U processor, representing one of the first of its kind. It offers a robust configuration including up to 32GB LPDDR5 RAM, multiple networking options, and storage solutions. This SBC is designed for versatile applications, leveraging the Arrow Lake processor family.",
    "tags": [
      "Hardware",
      "AI",
      "Edge AI",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/11/07/aaeon-pico-aru4-arrow-lake-pico-itx-sbc-is-powered-by-up-to-an-intel-core-ultra-7-255u-processor/"
  },
  {
    "title": "Review of SONOFF s latest Matter Smart Switches Basic Gen5 and Tx Gen2",
    "summary": "SONOFF has released the Basic Gen5 and Tx Gen2 Matter Smart Switches, offering Matter connectivity over Wi-Fi. The Basic Gen5 builds upon the existing Basic series with Matter and Bluetooth control, while the Tx Gen2 introduces features like adjustable backlight and Detach Relay mode. Both switches support voice control and are designed to control a variety of devices.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/11/06/review-sonoff-basic-gen5-matter-switch-and-tx-gen2-matter-smart-wall-switch/"
  },
  {
    "title": "Giveaway Week 2025 5-inch Raspberry Pi Touch Display 2",
    "summary": "CNX Software is giving away a 5-inch Raspberry Pi Touch Display 2 as the fourth prize in their Giveaway Week 2025 contest.  The reviewer hasn't found a specific use for it, so they’re offering it to a lucky participant.  Entries require a country specified in the comment, and there are restrictions on entries from the same IP/email address.",
    "tags": [
      "Raspberry Pi",
      "Hardware"
    ],
    "link": "https://www.cnx-software.com/2025/11/06/giveaway-week-2025-5-inch-raspberry-pi-touch-display-2/"
  },
  {
    "title": "CamThink NeoEyes NE301",
    "summary": "The CamThink NeoEyes NE301 is an ultra-low-power Edge AI camera utilizing an STM32N6 MCU and a Neural-ART NPU for enhanced performance. It supports various camera sensors and connectivity options, including WiFi 6, Bluetooth 5.4, and optional 4G LTE. This camera offers significant improvements over previous ESP32-S3 based models.",
    "tags": [
      "Edge AI",
      "AI",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/11/06/camthink-neoeyes-ne301-an-ultra-low-power-stm32n6-based-edge-ai-camera/"
  },
  {
    "title": "WCH BLE Analyzer Pro",
    "summary": "WCH BLE Analyzer Pro is a USB-based tool for real-time sniffing and analysis of Bluetooth Low Energy (BLE) communication. It allows users to capture, decode, and inspect BLE packets with features like adjustable polling intervals and detailed statistics. This analyzer is designed for R&D, testing, and debugging of BLE-enabled devices such as IoT and wearable products.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Rockchip"
    ],
    "link": "https://www.cnx-software.com/2025/11/05/wch-ble-analyzer-pro-a-bluetooth-le-sniffer-analyzer-and-debugging-tool/"
  },
  {
    "title": "Bluetooth 6.2 gets more responsive, improves security, USB communication, and testing capabilities",
    "summary": "The newly released Bluetooth 6.2 specification focuses on enhancing responsiveness through shorter connection intervals, bolstering security against RF attacks, and improving communication with a new Bulk Serialization Mode for USB Bluetooth LE audio.  A bi-annual release schedule has been adopted by the Bluetooth SIG. These changes will benefit high-performance devices, AR/VR, and gaming applications.",
    "tags": [
      "Trends",
      "Semiconductors",
      "Hardware"
    ],
    "link": "https://www.cnx-software.com/2025/11/05/bluetooth-6-2-gets-more-responsive-improves-security-usb-communication-and-testing-capabilities/"
  },
  {
    "title": "Giveaway Week 2025 Banana Pi BPI-R4 Lite",
    "summary": "CNX Software is giving away a Banana Pi BPI-R4 Lite router board as the third prize in their Giveaway Week 2025. This cost-down version of the BPI-R4 features a MediaTek Filogic 850 processor, ample memory, and multiple Ethernet ports, with expansion capabilities via mini PCIe and M.2 slots. It's designed for connectivity and integration with Mikroe Click modules.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Raspberry Pi",
      "Rockchip"
    ],
    "link": "https://www.cnx-software.com/2025/11/05/giveaway-week-2025-banana-pi-bpi-r4-lite/"
  },
  {
    "title": "Progress on upstream Linux for MediaTek Genio IoT SoCs and boards",
    "summary": "Collabora has made significant progress in upstreaming Linux support for MediaTek Genio IoT SoCs, particularly the Genio 1200 EVK and Radxa NIO 12L, now booting with mainline Linux. The collaboration includes support for key features like the Audio DSP, video codecs, and Mali-G57 GPU.  Further development is planned for newer Genio and Kompanio processors within IoT and Chromebook solutions.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/11/04/progress-on-upstream-linux-for-mediatek-genio-iot-socs-and-boards/"
  },
  {
    "title": "Giveaway Week 2025 Elecrow Pi Terminal Raspberry CM4 industrial HMI display",
    "summary": "CNX Software is offering an Elecrow Pi Terminal, a Raspberry Pi CM4-based industrial HMI with a 7-inch touchscreen, as a prize in the Giveaway Week 2025 contest. This device features a Broadcom BCM2711 SoC, 4GB of LPDDR4 RAM, and pre-loaded software, making it ideal for industrial applications. The giveaway aims to put this sample device to good use instead of discarding it.",
    "tags": [
      "Raspberry Pi",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/11/04/giveaway-week-2025-elecrow-pi-terminal-raspberry-cm4-industrial-hmi-display/"
  },
  {
    "title": "$200 SpecFive Spectre Pro Android 12 smartphone integrates LoRa Mesh connectivity",
    "summary": "SpecFive has released the Spectre Pro smartphone, priced at around $200, which incorporates LoRa Mesh connectivity through the addition of a LoRa module. Running Android 12, the phone comes pre-loaded with Meshtastic and other mesh applications, offering off-grid messaging and GPS capabilities. This innovative approach leverages existing smartphone hardware to make LoRa Mesh technology more accessible and affordable.",
    "tags": [
      "Hardware",
      "Trends",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/11/04/200-specfive-spectre-pro-android-12-smartphone-integrates-lora-mesh-connectivity/"
  },
  {
    "title": "This battery-powered NB-IoT/LTE-M industrial data logger is designed to run for years",
    "summary": "The NORVI EC-M12-BC-C6-C-A is a robust, battery-powered industrial data logger offering NB-IoT and LTE-M connectivity. It features a long battery life of 5-7 years, utilizing two non-rechargeable Lithium batteries, and includes features like 2G fallback, microSD storage, and a versatile M8 connector for sensor inputs.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/11/03/this-battery-powered-nb-iot-lte-m-industrial-data-logger-is-designed-to-last-for-years/"
  },
  {
    "title": "HackBEE is a Raspberry Pi RP2350 USB-C dongle for developers (Crowdfunding)",
    "summary": "HackBEE is a small, programmable USB-C dongle based on the Raspberry Pi RP2350 microcontroller, offering versatile functionality as a keyboard, host device, automation tool, or educational platform. It features dual-core processing, RGB LED feedback, and support for multiple programming languages. This device is designed for developers and embedded systems education.",
    "tags": [
      "Raspberry Pi",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/11/03/hackbee-is-a-raspberry-pi-rp2350-usb-c-dongle-for-developers/"
  },
  {
    "title": "Giveaway Week 2025 M5Stack Tab5 ESP32-P4 IoT devkit",
    "summary": "CNX Software is hosting Giveaway Week 2025, offering seven prizes including the M5Stack Tab5 ESP32-P4 IoT development kit. This kit features a 5-inch touchscreen and various connectivity options, and the contest is open worldwide with a separate Thailand-specific contest.  The giveaway aims to provide readers with review samples and industrial development kits.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/11/03/giveaway-week-2025-m5stack-tab5-esp32-p4-iot-devkit/"
  },
  {
    "title": "Creality Sermoon S1 high-end 3D scanner review Part 1: specifications and unboxing",
    "summary": "This review begins with an examination of the Creality Sermoon S1 3D scanner's specifications, including its dual scanning modes (blue laser line and infrared structured light) and impressive accuracy of up to 0.02mm. The scanner boasts a large scanning range of 5 x 5 x 5 m3 to 4000 x 4000 x 4000 mm3, and the initial post details the unboxing process.  The reviewer plans to delve deeper into testing in the next part of the review.",
    "tags": [
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/11/02/creality-sermoon-s1-high-end-3d-scanner-review-part-1-specifications-and-unboxing/"
  },
  {
    "title": "Review of Intel-based UP AI development kits Part 1: Unboxing and first boot to Ubuntu Pro 24.04",
    "summary": "This review covers three Intel-based UP AI development kits – UP TWL, UP Squared Pro TWL, and UP Xtreme ARL – offering alternatives to the AAEON NV8600-Nano. The kits ship with Ubuntu Pro 24.04 and associated software tools. The initial part focuses on unboxing and a quick first boot of one of the boards.",
    "tags": [
      "Hardware",
      "AI",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/11/01/review-of-intel-based-up-ai-development-kits-part-1-unboxing-and-first-boot-to-ubuntu-pro-24-04/"
  },
  {
    "title": "HUSKYLENS 2",
    "summary": "The DFRobot HUSKYLENS 2 is an AI vision camera equipped with a 6 TOPS AI accelerator and a Kendryte K230 SoC, designed for easy AI development. It boasts pre-loaded AI models for tasks like object tracking, alongside a self-learning classifier for custom model training. This upgrade from the HUSKYLENS utilizes a 64-bit RISC-V processor and offers 1GB of LPDDR4 and 8GB eMMC storage.",
    "tags": [
      "AI",
      "Machine Learning",
      "Edge AI",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/31/huskylens-2-a-6-tops-llm-and-ai-vision-camera-with-self-learning-capabilities/"
  },
  {
    "title": "Sakura Pi RK3308B SBC offers RGB LCD interface, supports mainline Linux",
    "summary": "The Sakura Pi RK3308B is a small single-board computer (SBC) featuring a Rockchip RK3308B processor and an RGB LCD interface, enabling connection to external displays. It includes standard SBC components like DDR3 memory, microSD storage, and USB-C ports, alongside WiFi 5 and Bluetooth 4.2.  The board is compatible with mainline Linux, making it suitable for various embedded applications.",
    "tags": [
      "Rockchip",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/31/sakura-pi-rk3308b-sbc-offers-rgb-lcd-interface-supports-mainline-linux/"
  },
  {
    "title": "ESP32JTAG An open-source wireless JTAG and logic analyzer (Crowdfunding)",
    "summary": "The ESP32JTAG is an open-source device utilizing an ESP32-S3 to function as a wireless JTAG and logic analyzer, aiming to replace traditional tools. It boasts a 16-channel logic analyzer, integrated UART, and connectivity options including Wi-Fi, Bluetooth, and USB-C, along with a small LCD display. The device is built for high-speed signal processing and supports target voltage monitoring.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/10/31/esp32jtag-an-open-source-wireless-jtag-and-logic-analyzer/"
  },
  {
    "title": "ESWIN EBC7702 Mini-DTX motherboard offers EIC7702X RISC-V SoC, up to 64GB RAM, Ubuntu 24.04 support",
    "summary": "ESWIN has released the EBC7702 Mini-DTX motherboard, featuring the EIC7702X RISC-V SoC, designed for demanding AI and data processing tasks. This board boasts an 8-core RISC-V CPU with an integrated AI accelerator and supports up to 64GB of RAM, along with Ubuntu 24.04. It includes connectivity options suitable for video analysis and edge AI applications.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/30/eswin-ebc7702-mini-dtx-motherboard-offers-eic7702x-risc-v-soc-up-to-64gb-ram-ubuntu-24-04-support/"
  },
  {
    "title": "Palm-sized PocketPD USB-C programmable power supply delivers up to 21V/5A output (Crowdfunding)",
    "summary": "The PocketPD is a palm-sized, programmable USB-C power supply developed by CentyLab, offering precise voltage and current control up to 21V/5A. Featuring an OLED display and powered by a Raspberry Pi RP2040, it allows for fine adjustments and includes built-in protections. Available with various connector options, it's designed for customization and real-time monitoring.",
    "tags": [
      "Hardware",
      "Raspberry Pi",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/30/palm-sized-pocketpd-usb-c-programmable-power-supply-pps-21v-5a-output/"
  },
  {
    "title": "Waveshare MK20 macro keyboard features twenty mechanical keys with 0.85-inch color LCD keycaps",
    "summary": "The Waveshare MK20 is a macro keyboard boasting twenty mechanical keys and 0.85-inch color LCD keycaps. It’s an upgraded version with a 2.8-inch secondary display, two control knobs, and supports AI voice interaction and smart home integration.  Built with an aluminum alloy top case and a 2.5D acrylic lens, it uses a dual-system architecture for optimal performance.",
    "tags": [
      "Hardware",
      "AI",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/10/29/waveshare-mk20-macro-keyboard-features-twenty-mechanical-keys-with-0-85-inch-color-lcd-keycaps/"
  },
  {
    "title": "TerraMaster launches Intel N150 NAS systems with 5GbE networking, AI photo recognition",
    "summary": "TerraMaster has released updated NAS systems, the F4-425 Plus and F2-425 Plus, featuring an Intel N150 processor and 5GbE networking for improved performance. These hybrid AI NAS systems boast increased storage capacity with up to 144TB of M.2 SSD support and offer advanced features like 4K/8K video transcoding and TerraMaster’s TRAID technology.",
    "tags": [
      "AI",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/29/terramaster-intel-n150-nas-systems-5gbe-networking-ai-photo-recognition-privacy-protection/"
  },
  {
    "title": "NXP i.MX 952 processor supports local dimming for AI-enhanced automotive and industrial HMIs",
    "summary": "NXP's new i.MX 952 processor is designed for AI-powered automotive and industrial HMIs, boasting an eIQ Neutron NPU and features like local dimming for improved display efficiency. This processor integrates several key components including Arm cores, an ISP, and robust security features like EdgeLock.  It's also designed for seamless integration with NXP's other products and is compliant with relevant safety standards.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/28/nxp-i-mx-952-processor-supports-local-dimming-for-ai-automotive-and-industrial-hmis/"
  },
  {
    "title": "Microchip PIC32-BZ6 BLE 6.0, Thread, and Matter wireless MCU integrates touch and motor control",
    "summary": "The Microchip PIC32-BZ6 is a new wireless MCU designed for smart home, industrial, and automotive applications, supporting Bluetooth LE 6.0, Thread, Matter, and offering wired connectivity. It includes touch and motor control interfaces alongside security features like a hardware-based security engine and OTA updates. This versatile MCU is available in various package options and automotive-grade variants.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/28/microchip-pic32-bz6-ble-6-0-thread-and-matter-wireless-mcu-integrates-touch-and-motor-control/"
  },
  {
    "title": "Radxa Dragon Q6A   A $60+ Qualcomm QCS6490 Edge AI SBC with GbE, WiFi 6, three camera connectors",
    "summary": "The Radxa Dragon Q6A is a compact, credit card-sized single board computer featuring a Qualcomm QCS6490 Edge AI processor with an AI accelerator and 16GB of LPDDR5 memory. It includes Gigabit Ethernet, WiFi 6, and three MIPI CSI camera connectors, alongside standard SBC ports like USB and HDMI. This board is designed for applications requiring edge AI processing and connectivity.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/27/radxa-dragon-q6a-a-qualcomm-qcs6490-edge-ai-sbc-with-gbe-wifi-6-three-camera-connectors/"
  },
  {
    "title": "1GHz Renesas RA8D2 and RA8M2 Cortex-M85 MCUs feature up to 1MB MRAM, 2MB SRAM",
    "summary": "Renesas has launched the RA8D2 and RA8M2 MCU groups, offering up to 1 GHz performance and up to 1MB MRAM and 2MB SRAM. The RA8D2 is designed for graphics and AI applications with display and audio support, while the RA8M2 targets high-performance IoT and industrial control. Both MCUs include common features such as Gigabit Ethernet and USB connectivity, alongside integrated security features.",
    "tags": [
      "AI",
      "Hardware",
      "Semiconductors",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/10/27/1ghz-renesas-ra8d2-and-ra8m2-cortex-m85-mcus-feature-up-to-1mb-mram-2mb-sram/"
  }
]