[
  {
    "title": "Save $80 off this humongous, enterprise-class hard drive   WD Gold 14TB HDD on clearance sale, just 1.7 cents per gigabyte",
    "summary": "Western Digital is offering a clearance sale on a 14TB enterprise-grade hard drive for $240, representing an incredible price of just 1.7 cents per gigabyte. This discount makes it a compelling option for users needing substantial mass storage. The WD Gold series is known for reliable performance.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/hdds/save-usd80-off-this-humongous-enterprise-class-hard-drive-wd-gold-14tb-hdd-can-be-yours-for-usd240-thats-just-1-7-cents-per-gigabyte"
  },
  {
    "title": "Cambridge University launches project to rescue data trapped on old floppy disks",
    "summary": "Cambridge University Library is undertaking a project to recover data stored on obsolete floppy disks. The initiative invites individuals to contribute their old disks, hoping to unlock lost information. This effort addresses the growing problem of data preservation from outdated storage media.",
    "tags": [
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/pc-components/storage/cambridge-university-rescues-data-from-old-floppy-disks"
  },
  {
    "title": "Nintendo allegedly hacked by Crimson Collective hacking group",
    "summary": "The Crimson Collective hacking group is claiming responsibility for breaching Nintendo's security and obtaining sensitive data. Leaked materials include production assets, developer files, and backups, suggesting a significant data compromise. This incident highlights concerns about the security of major gaming companies.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/nintendo-allegedly-hacked-by-crimson-collective-hacking-group-screenshot-shows-leaked-folders-production-assets-developer-files-and-backups"
  },
  {
    "title": "Battlefield 6 has an epic launch bug where it fails to recognize that the game is already installed EA boss suggests one affected user to refund and buy on Steam",
    "summary": "Battlefield 6 launched with a significant bug causing the game to fail to recognize existing installations. EA initially took six hours to address the issue. A senior executive suggested one affected user attempt a refund and purchase the game on Steam.",
    "tags": [
      "Hardware",
      "AI"
    ],
    "link": "https://www.tomshardware.com/video-games/battlefield-6-has-an-epic-launch-bug-where-it-fails-to-recognize-that-the-game-is-already-installed-ea-boss-suggests-one-affected-user-to-refund-and-buy-on-steam"
  },
  {
    "title": "New 7-Zip high-severity vulnerabilities expose systems to remote attackers users should update to version 25 ASAP",
    "summary": "New vulnerabilities in 7-Zip pose a significant security risk, allowing attackers to execute arbitrary code through specially crafted ZIP archives. These flaws could be exploited to compromise systems remotely. Users are strongly advised to immediately update to version 25 to mitigate this threat.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/7-zip-flaws-open-door-to-remote-code-execution"
  },
  {
    "title": "UPS reportedly destroying packages due to customs confusion   thousands of parcels per day are seemingly affected by delays due to documentation issues",
    "summary": "UPS is facing significant problems with thousands of packages, primarily due to incomplete customs documentation. These delays are causing substantial delays and, alarmingly, some packages are being destroyed. The root cause appears to be inconsistencies in the paperwork submitted to customs authorities.",
    "tags": [
      "AI",
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/tech-industry/ups-reportedly-destroying-packages-due-to-customs-confusion-thousands-of-parcels-per-day-are-seemingly-affected-by-delays-due-to-documentation-issues"
  },
  {
    "title": "AmeraLabs introduces elastic 3D printing resin with long-lasting squish",
    "summary": "AmeraLabs' FLX-300 resin offers exceptional elasticity, demonstrated by its low compression set. This allows printed parts to maintain their shape after repeated bending and deformation. The full bottle of resin is priced at $140.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/3d-printing/ameralabs-introduces-elastic-3d-printing-resin-with-long-lasting-squish-a-full-bottle-is-priced-at-usd140"
  },
  {
    "title": "Trump strikes back at China with a 100% tariff and critical software ban",
    "summary": "President Trump implemented a significant escalation by imposing a 100% tariff on Chinese goods and enacting export controls on unspecified 'critical software.' This action targets China’s technology and manufacturing sectors, potentially more severely than traditional tariffs. The move represents a retaliation against China’s existing restrictions on rare earth elements.",
    "tags": [
      "Trends",
      "Semiconductors",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/trump-strikes-back-at-china-with-a-100-percent-tariff-and-critical-software-ban-major-escalation-retaliates-for-chinas-rare-earth-restrictions"
  },
  {
    "title": "I was forced to update to Windows 11, and it wasn t as bad as I thought How to upgrade from Windows 10 to Windows 11 without tearing your hair out",
    "summary": "Despite preferring Linux, the author found upgrading from Windows 10 to Windows 11 surprisingly easy. This guide is designed for users who are hesitant about the upgrade, reassuring them that it’s a simpler process than anticipated. It offers guidance for those facing pressure to update before October 14th.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/software/windows/i-was-forced-to-update-to-windows-11-and-it-wasnt-as-bad-as-i-thought-how-to-upgrade-from-windows-10-to-windows-11-without-tearing-your-hair-out"
  },
  {
    "title": "Bride surprises new husband with an RTX 5090 on wedding day   Chinese number slang reveals surprise gift",
    "summary": "A wedding video surfaced online showing the bride gifting her new husband an RTX 5090 graphics card. This unexpected present quickly went viral, highlighting a significant tech offering. The incident showcased a memorable and extravagant wedding surprise.",
    "tags": [
      "NVIDIA",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/gpus/bride-surprises-new-husband-with-an-rtx-5090-on-wedding-day-chinese-number-slang-reveals-surprise-gift"
  },
  {
    "title": "Oklahoma man charged with supplying over one hundred 3D-printed machine gun conversion kits to a person he thought was an al-Qaida operative",
    "summary": "A Tulsa, Oklahoma resident is accused of providing over 100 3D-printed gun components to an individual believed to be associated with al-Qaida. The individual intended to use the parts for potential terrorist attacks, leading to charges and the possibility of a 20-year prison sentence. The case highlights concerns about the misuse of 3D-printed firearms technology.",
    "tags": [
      "Hardware",
      "Trends",
      "Edge AI"
    ],
    "link": "https://www.tomshardware.com/3d-printing/oklahoma-man-charged-with-supplying-over-one-hundred-3d-printed-machine-gun-conversion-kits-to-a-person-he-thought-was-an-al-qaida-operative-suspect-allegedly-shipped-a-range-of-firearms-parts-intended-for-terrorist-attacks"
  },
  {
    "title": "Secretlab Titan Evo NanoGen Review: The Next Generation",
    "summary": "The Secretlab Titan Evo NanoGen introduces a revamped design featuring a new leatherette fabric and enhanced padding for improved comfort during extended gaming and work sessions. This update focuses on delivering a more comfortable user experience compared to previous Titan Evo models. It represents the next iteration of the popular Secretlab Titan Evo series.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/peripherals/gaming-chairs/secretlab-titan-evo-nanogen-review-the-next-generation"
  },
  {
    "title": "Converted school bus turned into mobile retro computing museum   historic array includes Sinclair (Timex) ZX Spectrum 48K and Commodore 64",
    "summary": "A father and son have transformed an old school bus into a unique mobile museum dedicated to retro computing. The museum features a collection of classic computers, notably the ZX Spectrum 48K and Commodore 64. This project highlights a revival of vintage gaming and computing.",
    "tags": [
      "Hardware",
      "Raspberry Pi",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/video-games/retro-gaming/converted-school-bus-turned-into-mobile-retro-computing-museum-historic-array-includes-sinclair-timex-zx-spectrum-48k-and-commodore-64"
  },
  {
    "title": "Battlefield 6 peaks at 747,000 concurrent players   newly launched game ranks among the top three most-played on Steam today",
    "summary": "Battlefield 6 achieved a significant launch, with over 747,000 concurrent players on Steam shortly after release. This impressive figure places the game among the top three most-played titles on the platform. The strong player base indicates a successful launch for the new Battlefield title.",
    "tags": [
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/video-games/pc-gaming/battlefield-6-peaks-at-747-000-concurrent-players-newly-launched-game-ranks-among-the-top-three-most-played-on-steam-today"
  },
  {
    "title": "InferenceMax AI benchmark tests software stacks, efficiency, and TCO",
    "summary": "The InferenceMax AI benchmark is a vendor-neutral suite that continuously evaluates software stacks, efficiency, and total cost of ownership (TCO) for AI applications. It runs nightly, providing ongoing performance tracking and insights. This comprehensive approach helps identify optimal solutions for AI deployments.",
    "tags": [
      "AI",
      "Machine Learning",
      "Edge AI",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/inferencemax-ai-benchmark-tests-software-stacks-efficiency-and-tco-vendor-neutral-suite-runs-nightly-and-tracks-performance-changes-over-time"
  },
  {
    "title": "President Trump warns of massively increased tariffs in wake of China's rare earth mineral 'monopoly position'   Xi Jinping meeting cancelled as Trump promises retaliation for Beijing's expanded export controls",
    "summary": "President Trump is threatening new tariffs on China in response to Beijing's expanded export controls of rare earth minerals. He claims America possesses twice the resources and is considering further retaliatory measures. This follows the cancellation of a planned meeting between Trump and Xi Jinping.",
    "tags": [
      "Trends",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/tech-industry/president-trump-warns-of-massively-increased-tariffs-in-wake-of-chinas-rare-earth-mineral-monopoly-position-xi-jinping-meeting-cancelled-as-trump-promises-retaliation-for-beijings-expanded-export-controls"
  },
  {
    "title": "Intel's 18A production starts before TSMC s competing N2 tech",
    "summary": "Intel has successfully initiated mass production of its Core Ultra 3 processors using the 18A process at Fab 52 in Arizona. This deployment precedes TSMC's N2 technology launch, representing an early win for Intel's advancements in process node production. The move highlights Intel's strategy to independently develop and deploy cutting-edge process technologies.",
    "tags": [
      "Semiconductors",
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/pc-components/cpus/intels-18a-production-starts-before-tsmcs-competing-n2-tech-heres-how-the-two-process-nodes-compare"
  },
  {
    "title": "U.S. Senate passes bill that forces AI chipmakers to prioritize sales to American companies",
    "summary": "The U.S. Senate has approved a bill requiring Nvidia and AMD to prioritize sales to American companies. This legislation aims to bolster domestic semiconductor production and reduce reliance on exports. The House is now expected to either pass or amend the bill.",
    "tags": [
      "AI",
      "Semiconductors",
      "NVIDIA",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/u-s-senate-passes-bill-that-forces-ai-chipmakers-to-prioritize-sales-to-american-companies-house-now-set-to-amend-or-pass-legislation"
  },
  {
    "title": "SoftBank is seeking $5 billion loan to invest in OpenAI, plans to use Arm shares as collateral rapid AI expansion continues, investment could top $30 billion",
    "summary": "SoftBank is obtaining a $5 billion loan secured by Arm shares to fuel investments in OpenAI and broader AI infrastructure. This move further escalates SoftBank's leveraged strategy for rapid AI expansion, and brings total Arm-backed debt to $18.5 billion. The overall investment could potentially reach $30 billion.",
    "tags": [
      "AI",
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/softbank-is-seeking-usd5-billion-loan-to-invest-in-openai-plans-to-use-arm-shares-as-collateral-rapid-ai-expansion-continues-investment-could-top-usd30-billion"
  },
  {
    "title": "Microsoft cancels Wisconsin data center after community pushback",
    "summary": "Microsoft has halted its construction of a 244-acre data center in Caledonia, Wisconsin, due to significant opposition from the local community. Despite this setback, Microsoft maintains its commitment to the region. The project's cancellation reflects community concerns about the data center's impact.",
    "tags": [
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.tomshardware.com/desktops/servers/microsoft-cancels-wisconsin-data-center-after-community-pushback-244-acre-caledonia-site-on-hold-but-redmond-says-it-remains-committed-to-the-region"
  },
  {
    "title": "Back to its all-time low price, Alienware's AW3225QF4K QD-OLED gaming monitor is reduced by $350 in Dell's post-Prime Day deal",
    "summary": "Alienware's AW3225QF4K QD-OLED gaming monitor is currently available at its lowest price. Dell is offering a $350 discount on this gorgeous 4K curved monitor as part of a post-Prime Day deal. This represents a significant savings for potential buyers.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/back-to-its-all-time-low-price-alienwares-aw3225qf4k-qd-oled-gaming-monitor-is-reduced-by-usd350-in-dells-post-prime-day-deal"
  },
  {
    "title": "China's new rare-earth curbs target chipmaking industry in retaliation to US restrictions",
    "summary": "China is imposing new restrictions on rare-earth exports, specifically targeting the semiconductor industry. These controls extend back to older technologies like 14nm process chips and 256-layer memory, representing a retaliatory measure against US restrictions. This action directly impacts the production of advanced chips.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/chinas-new-rare-earth-curbs-hit-14nm-and-256-layer-chipmaking"
  },
  {
    "title": "China bans research company that helped unearth Huawei's use of TSMC tech despite U.S. bans",
    "summary": "China has banned TechInsights, a research company, from operating within the country due to accusations of violating objections to cooperation with Taiwan and making negative statements about China. The ban stems from TechInsights' assistance in uncovering Huawei's use of TSMC technology, leading to accusations of suppressing Chinese companies. This action highlights China's concerns regarding technological collaboration with entities perceived as supporting U.S. sanctions.",
    "tags": [
      "Semiconductors",
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/tech-industry/china-bans-research-company-that-helped-unearth-huaweis-use-of-tsmc-tech-despite-u-s-bans-techinsights-added-to-unreliable-entity-list-by-state-authorities"
  },
  {
    "title": "Microsoft deploys world's first 'supercomputer-scale' GB300 NVL72 Azure cluster",
    "summary": "Microsoft has launched a massive GB300 NVL72 supercluster on Azure, utilizing 4,608 GPUs interconnected for unprecedented performance. This cluster achieves a staggering 92.1 exaFLOPS of FP4 inference and 1.44 PFLOPS of FP4 Tensor Core performance thanks to NVLink and InfiniBand.  It represents a significant step in accelerating AI workloads.",
    "tags": [
      "AI",
      "Machine Learning",
      "NVIDIA",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/microsoft-deploys-worlds-first-supercomputer-scale-gb300-nvl72-azure-cluster-4-608-gb300-gpus-linked-together-to-form-a-single-unified-accelerator-capable-of-1-44-pflops-of-inference"
  },
  {
    "title": "China issues port crackdown on all Nvidia AI chip imports, says report",
    "summary": "China has initiated a significant crackdown on unlicensed Nvidia chip shipments, deploying enforcement teams across major ports. The operation focuses on inspecting hardware shipments, specifically targeting H20 and RTX 6000D models. This action indicates a heightened concern regarding the import of AI-related hardware.",
    "tags": [
      "AI",
      "NVIDIA",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/gpus/china-launches-port-crackdown-on-nvidia-chips"
  },
  {
    "title": "Singapore company allegedly helped China smuggle $2 billion worth of Nvidia AI processors, report claims",
    "summary": "A U.S. investigation revealed that a Singapore-based firm with Chinese connections purchased $2 billion in Nvidia GPUs via a U.S. subsidiary, intending to ship them to Malaysia and Indonesia. These GPUs were reportedly used by clients in China or resold to customers in the PRC. Nvidia denies any involvement of the accused company, while a U.S. investigation is ongoing.",
    "tags": [
      "AI",
      "NVIDIA",
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/singapore-company-alleged-to-have-helped-china-get-usd2-billion-worth-of-nvidia-ai-processors-report-claims-nvidia-denies-that-the-accused-has-any-china-ties-but-a-u-s-investigation-is-underway"
  },
  {
    "title": "Spacious 24TB hard drive is a mere 1 cent per GB Seagate's BarraCuda 24TB HDD is back on sale for $249",
    "summary": "Seagate's BarraCuda 24TB HDD is currently available at Newegg for $249, representing a significant price reduction and a compelling deal. This offers a large amount of storage at an incredibly low cost of just 1 cent per GB.  It's a good option for anyone needing substantial data storage.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/hdds/spacious-24tb-hard-drive-is-at-an-all-time-low-of-a-mere-1-cent-per-gb-seagates-barracuda-24tb-hdd-is-back-on-sale-for-usd239"
  },
  {
    "title": "Sony and AMD tease likely PlayStation 6 GPU upgrades Radiance Cores and a new interconnect for boosting AI rendering performance",
    "summary": "Sony and AMD are developing upgrades for the upcoming PlayStation 6, codenamed Project Amethyst. These include new 'Radiance Cores' designed for real-time path tracing rendering and a new interconnect aimed at improving AI rendering performance. This suggests a significant focus on AI-driven graphics capabilities for the next-generation console.",
    "tags": [
      "AI",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/video-games/console-gaming/sony-and-amd-tease-likely-playstation-6-gpu-upgrades-radiance-cores-and-a-new-interconnect-for-boosting-ai-rendering-performance"
  },
  {
    "title": "The best 1TB microSD Express card for your Switch 2 is still 28% off save $62 on the Lexar Play Pro 1TB",
    "summary": "Despite Amazon Prime Day ending, you can still purchase the Lexar Play Pro 1TB microSD Express card for your Switch 2 at a significant discount of 28%. This card is currently priced $62 lower than its original cost. It’s a great deal for expanding storage on your Nintendo Switch 2.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/microsd-cards/the-best-1tb-microsd-express-card-for-your-switch-2-is-still-28-percent-off-save-usd62-on-the-lexar-play-pro-1tb"
  },
  {
    "title": "Grab vital 3D printer maintenance tools in these prime Day deals you can still get",
    "summary": "This article highlights significant discounts on 3D printer maintenance tools during a Prime Day sale. These tools are essential for ensuring high-quality 3D printing results.  Deals include brands like HOTO, Creality, and Wera.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/3d-printing/best-3d-printer-tools-amazon-prime-day-2025-you-can-still-get"
  },
  {
    "title": "3D Printer Sales Bonanza is still ongoing after Prime Day",
    "summary": "Several excellent 3D printer deals are still available following the recent sales events, including Prime Day. This page consolidates the best deals found across multiple sales. Consumers can take advantage of these discounts to purchase a 3D printer.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/3d-printing/3d-printer-sale-prime-day-2025-roundup-best-deals-at-five-sales-elegoo-creality-anycubic-matterhackers"
  },
  {
    "title": "Concerns grow after spate of social media posts showing SpaceX Starlink satellites burning in the sky",
    "summary": "A recent increase in satellite re-entries – currently a couple per day – is raising concerns about the risk of satellites falling to Earth. This trend highlights the growing congestion of space and the potential for collisions. An astrophysicist has commented on this escalating issue.",
    "tags": [
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/networking/concerns-grow-after-spate-of-social-media-posts-showing-spacex-starlink-satellites-burning-in-the-sky-we-are-currently-seeing-a-couple-of-satellite-re-entries-a-day-says-respected-astrophysicist"
  },
  {
    "title": "South Korean government learns the importance of backups the hard way after catastrophic fire",
    "summary": "A catastrophic fire has destroyed 858 terabytes of data belonging to the South Korean government, highlighting a critical lack of backups. The incident underscores the vulnerability of government data and the importance of robust data protection measures. This event has prompted a realization of the need for reliable data backups.",
    "tags": [
      "Trends",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/pc-components/storage/south-korean-government-learns-the-importance-of-backups-the-hard-way-after-catastrophic-fire-858-terabytes-of-data-goes-up-in-magic-smoke"
  },
  {
    "title": "AMD will beat Nvidia to launching AI GPUs on the cutting-edge 2nm node",
    "summary": "AMD is utilizing TSMC's 2nm process for its upcoming Instinct MI450 AI accelerators, marking the first AMD GPU to leverage this technology. This MI450 will be based on the CDNA 5 architecture. While Nvidia's Rubin may offer higher raw compute power, AMD's move signifies a key step in their AI GPU strategy.",
    "tags": [
      "AI",
      "Machine Learning",
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/amd-could-beat-nvidia-to-launching-ai-gpus-on-the-cutting-edge-2nm-node-instinct-mi450-is-officially-the-first-amd-gpu-to-launch-with-tsmcs-finest-tech"
  },
  {
    "title": "Intel's Xe3 graphics architecture breaks cover   Panther Lake's 12 Xe Core iGPU promises 50+% better performance than Lunar Lake",
    "summary": "Intel's new Xe3 graphics architecture is featured in the Panther Lake CPUs, resulting in a significantly upgraded integrated GPU. This architecture boasts 50% better performance compared to the Lunar Lake iGPU. It represents Intel’s largest and most powerful integrated GPU to date.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/gpus/intels-xe3-graphics-architecture-breaks-cover-panther-lakes-12-xe-core-igpu-promises-50-percent-better-performance-than-lunar-lake"
  },
  {
    "title": "Intel takes the wraps off Panther Lake   first 18A client processor brings the best of Lunar Lake and Arrow Lake together in one package",
    "summary": "Intel has unveiled Panther Lake, its initial line of laptop SoCs utilizing 18A process technology. These chips combine the efficiency of Lunar Lake with the scalability of the upcoming Arrow Lake-H architecture, featuring Cougar Cove P-cores, Darkmont E-cores, and up to 12 Xe3 graphics.  This represents Intel's strategy to integrate advancements across its future product families.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/cpus/intel-takes-the-wraps-off-panther-lake-first-18a-client-processor-brings-the-best-of-lunar-lake-and-arrow-lake-together-in-one-package"
  },
  {
    "title": "Best Amazon Prime Day Tech Deals You Can Still Get Live Blog Best Tech & PC Hardware Deals on GPUs, CPUs, SSDs, and more",
    "summary": "This live blog provides updates on the top tech and PC hardware deals currently available during Amazon Prime Big Deals Day. It covers a wide range of products including GPUs, CPUs, SSDs, laptops, peripherals, and accessories.  Readers can find the best deals on hardware across various categories.",
    "tags": [
      "Hardware",
      "NVIDIA"
    ],
    "link": "https://www.tomshardware.com/news/live/best-amazon-prime-day-deals-you-can-still-get-live-best-tech-and-pc-hardware-deals-gpus-cpus-ssds-and-more-2025"
  },
  {
    "title": "China expands rare-earth export controls, creating risks for PC component supply",
    "summary": "China is increasing its control over rare-earth elements, adding new materials and technologies to a restricted list. This expansion aims to safeguard national security, specifically targeting components used in HDDs and other products. The move poses potential risks to the supply chain of PC components globally.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/china-expands-rare-earth-export-controls"
  },
  {
    "title": "Washington's ambition for a 50/50 semiconductor deal with Taiwan is missing a key component lack of a mature homegrown supply chain could be the missing link",
    "summary": "Secretary Lutnick's plan to equally share chip production with Taiwan aims for self-sufficiency but is hampered by a lack of a robust U.S. supply chain for crucial materials and tools. The initiative's symbolic nature is further underscored by ongoing reliance on other nations like Japan, Europe, and Korea. Ultimately, the plan’s success hinges on developing a mature domestic semiconductor ecosystem.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/washingtons-ambition-for-a-50-50-semiconductor-deal-with-taiwan-is-missing-a-key-component-lack-of-a-mature-homegrown-supply-chain-could-be-the-missing-link"
  },
  {
    "title": "Valve's next-gen 'Deckard' VR headset reportedly enters mass production, company allegedly plans to ship up to 600K units annually",
    "summary": "Valve's highly anticipated 'Deckard' VR headset has begun mass production, with plans to ship up to 600,000 units annually. The headset, potentially named the 'Steam Frame', is slated for release before the end of the year and is expected to cost around $1,200. This marks a significant step in Valve's push into the next generation of VR hardware.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/virtual-reality/valves-next-gen-deckard-vr-headset-reportedly-enters-mass-production-company-allegedly-plans-to-ship-up-to-600k-units-annually-upcoming-steam-frame-could-launch-before-the-end-of-the-year"
  },
  {
    "title": "Legendary Microsoft developer reveals the true story behind the most famous product activation key of all time   infamous Windows XP 'FCKGW' licensing key was actually 'a disastrous leak'",
    "summary": "A former Microsoft developer has stated that the widely circulated 'FCKGW' Windows XP volume licensing key was not the result of a sophisticated hack, but rather a significant, unintentional leak. This revelation challenges the long-held belief that the key was obtained through illicit means. The developer’s account suggests a far less dramatic origin for the infamous activation code.",
    "tags": [
      "Trends",
      "Hardware"
    ],
    "link": "https://www.tomshardware.com/software/windows/legendary-microsoft-developer-reveals-the-true-story-behind-the-most-famous-product-activation-key-of-all-time-infamous-windows-xp-fckgw-licensing-key-was-actually-a-disastrous-leak"
  },
  {
    "title": "Bank of England, IMF, warn AI bubble risk has shades of 2000 dotcom crash   Goldman Sachs cautions we're not there 'yet'",
    "summary": "Leading financial institutions, including the Bank of England and IMF, are expressing concerns about a potential market correction in AI stocks, echoing the 2000 dot-com bubble.  Increased investment among major players is fueling inflated valuations, leading to predictions of a significant price drop. Goldman Sachs acknowledges the risk but suggests a full correction is still to come.",
    "tags": [
      "AI",
      "Trends",
      "Machine Learning"
    ],
    "link": "https://www.tomshardware.com/tech-industry/bank-of-england-imf-warn-ai-bubble-risk-has-shades-of-2000-dotcom-crash-goldman-sachs-cautions-were-not-there-yet"
  },
  {
    "title": "U.S. finally grants Nvidia license to ship AI GPUs to UAE: 500,000 Blackwell GPUs coming to the Gulf region",
    "summary": "The United States has authorized Nvidia to export tens of billions of dollars' worth of AI hardware, specifically 500,000 Blackwell GPUs, to the UAE. This approval is part of a new agreement involving $1.4 trillion in Emirati investment and represents a significant expansion of Nvidia's AI hardware presence in the Gulf region. The deal underscores the growing importance of AI infrastructure and geopolitical investment in advanced technologies.",
    "tags": [
      "AI",
      "NVIDIA",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/u-s-finally-grants-nvidia-license-to-ship-ai-gpus-to-uae-500-000-blackwell-gpus-coming-to-the-gulf-region"
  },
  {
    "title": "Discord says only 70,000 government ID photos exposed in third-party service breach, denies 2.1 million figure   says it won't pay $3.5 million ransom and has cut communications with hackers, who are threatening to go public",
    "summary": "Discord is disputing earlier reports that a breach exposed data for 2.1 million users, stating that only 70,000 government ID photos were compromised. The company has refused to pay a $3.5 million ransom demand and has severed all communication with the hackers threatening to release the data publicly.",
    "tags": [
      "Trends",
      "Hardware",
      "AI"
    ],
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/discord-says-only-70-000-government-id-photos-exposed-in-third-party-service-breach-denies-2-1-million-figure-says-it-wont-pay-usd3-5-million-ransom-and-has-cut-communications-with-hackers-who-are-threatening-to-go-public"
  },
  {
    "title": "AI adoption far outpaces that of the early Internet   report sheds light on worldwide AI penetration and usage patterns",
    "summary": "A recent Financial Times report details the rapid global adoption of AI, highlighting how it's already significantly more widespread than the initial stages of the internet. The report examines current worldwide AI penetration and the various ways it's being utilized. This indicates a much faster evolution of AI's integration into numerous industries and applications.",
    "tags": [
      "AI",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/ai-adoption-far-outpaces-that-of-the-early-internet-report-sheds-light-on-worldwide-ai-penetration-and-usage-patterns"
  },
  {
    "title": "Lucky PC builder snipes RTX 5090 for just $1,119   humbles proud shopper who scored one for $1,399 just two days earlier",
    "summary": "Two online Redditors engaged in a competitive price hunt for the GeForce RTX 5090 graphics card. One user managed to snag a card for $1,119, significantly lower than the $1,399 price another had paid just two days prior. This created a humorous situation as one user 'humiliated' the other's earlier purchase.",
    "tags": [
      "NVIDIA",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/pc-components/gpus/lucky-pc-builder-snipes-rtx-5090-for-just-usd1-119-humbles-proud-shopper-who-scored-one-for-usd1-399-just-two-days-earlier"
  },
  {
    "title": "RISC-V set to announce 25% market penetration",
    "summary": "RISC-V International is predicting 25% market penetration for its open-standard ISA, a significant milestone that surpasses previous projections. This rapid growth indicates a quickly expanding silicon footprint within the industry. The announcement highlights the ISA’s accelerating adoption rate.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/risc-v-set-to-announce-25-percent-market-penetration-open-standard-isa-is-ahead-of-schedule-securing-fast-growing-silicon-footprint"
  },
  {
    "title": "Anker s 25,000 mAh Laptop Power Bank",
    "summary": "During Prime Day, the Anker Laptop Power Bank is available for $89 and boasts a massive 25,000 mAh capacity. It features two integrated USB-C cables and a powerful 165W maximum output, making it ideal for charging laptops and other devices.  It's TSA-approved for travel convenience.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.tomshardware.com/peripherals/ankers-25-000-mah-laptop-power-bank-is-usd89-for-prime-day-this-discounted-portable-charger-includes-two-integrated-usb-c-cables-and-165w-max-output"
  },
  {
    "title": "These are the best CPU cooler deals we found this Prime Day, up to 37% off deals from Cooler Master, Thermalright, MSI, Corsair, and Thermaltake for every budget",
    "summary": "Prime Day offers remain available for CPU cooler deals, with significant discounts up to 37% across brands like Cooler Master and Thermalright. The Thermalright Grand Vision 360 currently stands out as the top deal, but many other options cater to various budgets. This article highlights the best CPU cooler deals for Prime Big Deals Day.",
    "tags": [
      "Hardware",
      "NVIDIA"
    ],
    "link": "https://www.tomshardware.com/pc-components/these-are-the-best-cpu-cooler-deals-we-found-this-prime-day-up-to-37-percent-off-deals-from-cooler-master-thermalright-msi-corsair-and-thermaltake-for-every-budget"
  },
  {
    "title": "Samsung's speedy 24-inch 180Hz gaming monitor hits historical all-time $109 low   nearly half-price Odyssey G3 G30D is $90 off on stellar sale for Prime Day",
    "summary": "The Samsung Odyssey G3 G30D gaming monitor is currently available at a record low price of $139 on Amazon. This represents a nearly half-price reduction, offering a significant discount for Prime Day shoppers.  The monitor's impressive 180Hz refresh rate makes it a compelling gaming option.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/samsung-24-inch-180hz-gaming-monitor-prime-day-2025"
  },
  {
    "title": "ESP32-based dual-port WLED controller features Ethernet port, 24V DC input",
    "summary": "The 2-Port ESP32 ETH0 WLED Controller offers an alternative to popular WLED controllers like Adafruit's, boasting Ethernet connectivity and dual 5V-24V LED outputs. This board includes an onboard DC-DC converter and fuses for each output channel, ensuring stable power and safety. It combines Ethernet and Wi-Fi capabilities for versatile WLED control.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "ESP32"
    ],
    "link": "https://www.cnx-software.com/2025/10/11/esp32-based-dual-port-wled-controller-features-ethernet-port-24v-dc-input/"
  },
  {
    "title": "FoBE IDEA Mesh Tracker C1",
    "summary": "The FoBE IDEA Mesh Tracker C1 is a LoRa-powered GPS tracker utilizing an nRF52840 MCU and designed for remote outdoor applications. It integrates GPS, LoRa, BLE, and sensors like an OLED display, accelerometer, and gyroscope, offering location tracking and environmental monitoring capabilities. The device features a battery-powered design with a 2-pin MX1.25 interface and extensive connectivity options.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/10/fobe-idea-mesh-tracker-c1-an-nrf52840-based-lora-gps-tracker-with-sensors-oled-knob-and-more/"
  },
  {
    "title": "Avalue EPC-ASL Intel N97 fanless industrial mini PC is designed for 24/7 operation",
    "summary": "The Avalue EPC-ASL is a rugged, fanless industrial mini PC featuring an Intel N97 processor, built for continuous 24/7 operation and edge computing applications. It offers robust connectivity with dual 2.5GbE, ample storage options, and supports up to 16GB of DDR5 memory. This PC is suitable for demanding industrial environments like smart manufacturing and surveillance.",
    "tags": [
      "Hardware",
      "Edge AI",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/10/avalue-epc-asl-intel-n97-fanless-industrial-mini-pc-is-designed-for-24-7-operation/"
  },
  {
    "title": "Weffort Outdoor Smart Shade Review with Home Assistant over Matter/Thread",
    "summary": "This review examines Weffort's custom-made, smart outdoor motorized shades, highlighting their compatibility with Home Assistant and other smart home platforms via Matter/Thread. The shades offer extensive customization options and can be installed by the user. The review emphasizes the ease of setup and the custom-made nature of the product.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/09/weffort-outdoor-smart-shade-review-with-home-assistant-over-matter-thread/"
  },
  {
    "title": "upyOS modular MicroPython-based OS for microcontrollers works with ESP32, RP2040, etc",
    "summary": "upyOS is a modular, lightweight operating system for microcontrollers, primarily designed for devices like the ESP32 and RP2040. It offers a Unix-like environment with features such as remote development, OTA updates, and a built-in web server, thanks to its modular architecture and support for background execution and scripting.",
    "tags": [
      "Hardware",
      "Raspberry Pi",
      "Microcontrollers"
    ],
    "link": "https://www.cnx-software.com/2025/10/09/upyos-modular-micropython-based-os-for-microcontrollers-esp32-rp2040/"
  },
  {
    "title": "Ampetronic Auri is a Bluetooth Auracast audio system for public spaces",
    "summary": "Ampetronic's Auri system utilizes Bluetooth Auracast technology to provide wireless audio to compatible devices in public spaces. It comprises transmitters, receivers, and docking stations, managed through software, and offers features like IP audio and Dante support. This system is designed for a wide range of environments including corporate, education, and hospitality.",
    "tags": [
      "Hardware",
      "Trends",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/08/ampetronic-auri-bluetooth-auracast-audio-system-for-public-spaces/"
  },
  {
    "title": "Qualcomm acquires Arduino, introduces Arduino UNO Q dual-brain SBC",
    "summary": "Qualcomm's acquisition of Arduino aims to integrate Qualcomm's technologies with Arduino's ecosystem, launching the Arduino UNO Q SBC, a dual-brain board powered by Qualcomm and STMicroelectronics components. The acquisition seeks to unify development environments for diverse operating systems and AI flows. Despite the change in ownership, Arduino will maintain its open approach and community focus.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/10/07/qualcomm-acquires-arduino-introduces-arduino-uno-q-dual-brain-sbc/"
  },
  {
    "title": "Sub $7 CH32V317 board offers 10/100Mbps Ethernet, dual USB 2.0 Type-C, DVP interface",
    "summary": "The nanoCH32V317 development board from MuseLab utilizes a 32-bit RISC-V WCH CH32V317 MCU and is designed for prototyping embedded systems. Key features include 10/100Mbps Ethernet, dual USB Type-C ports, a DVP interface for video input, and advanced motor control capabilities. This low-cost board is suitable for a range of projects, including IoT and automation.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/07/sub-7-ch32v317-board-offers-10-100mbps-ethernet-dual-usb-2-0-type-c-dvp-interface/"
  },
  {
    "title": "wafer.space lets you design your custom silicon just for $7 per die (Crowdfunding)",
    "summary": "wafer.space is offering custom ASIC fabrication at an incredibly low price of $7 per die through a Crowd Supply campaign. They manage the entire process – fabrication, dicing, and shipping – allowing users to order 1,000 custom chips based on a GlobalFoundries 180nm process, with options for bare dies or chip-on-board packaging. Designs are submitted as GDSII files, and wafer.space handles the verification and production aspects.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/07/wafer-space-lets-you-design-your-custom-silicon-just-for-7-per-die/"
  },
  {
    "title": "The latest Raspberry Pi OS images are now based on Debian 13 Trixie",
    "summary": "Raspberry Pi OS has updated to Debian 13 'Trixie', bringing with it new packages and features including 64-bit time support. While largely cosmetic with a new theme and icons, the update also incorporates some important under-the-hood changes.  Simon Long highlights that the changes are primarily focused on appearance and minor refinements.",
    "tags": [
      "Raspberry Pi",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/06/raspberry-pi-os-debian-13-trixie/"
  },
  {
    "title": "1GHz Renesas RA8T2 Cortex-M85 MCUs feature MRAM and EtherCAT for industrial motor control",
    "summary": "Renesas has released the RA8T2, a high-performance Cortex-M85 MCU with a 1GHz core and MRAM, designed for advanced motor control applications. It offers enhanced networking capabilities including EtherCAT and multiple connectivity options, alongside security features like TrustZone. This MCU is a direct upgrade to the RA8T1 and targets industrial robotics and motor control systems.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends",
      "AI"
    ],
    "link": "https://www.cnx-software.com/2025/10/06/1ghz-renesas-ra8t2-cortex-m85-mcus-feature-mram-and-ethercat-for-industrial-motor-control/"
  },
  {
    "title": "Easily add 80+ Mbps Ethernet to microcontrollers with WIZ630io QSPI RJ45 module",
    "summary": "The WIZnet WIZ630io module provides an easy way to integrate Ethernet connectivity into microcontrollers, specifically RP2350 boards, via a QSPI interface.  Featuring a W6300 controller, it supports speeds up to 80+ Mbps and includes 64KB of SRAM for each of its eight sockets. This module simplifies adding Ethernet to projects using SPI or QSPI communication.",
    "tags": [
      "Hardware",
      "Semiconductors",
      "Raspberry Pi"
    ],
    "link": "https://www.cnx-software.com/2025/10/05/easily-add-80-mbps-ethernet-to-microcontrollers-with-wiz630io-qspi-rj45-module/"
  },
  {
    "title": "kv4p HT Turn an Android smartphone into a ham radio transceiver",
    "summary": "The kv4p HT is an open-source device that transforms an Android smartphone into a handheld ham radio transceiver by utilizing an ESP32 wireless module and an SA818 radio module. It's designed for off-grid VHF/UHF communication and relies on the smartphone's existing battery. The V2.0 version features an ESP32-WROOM-32E-N4 SoC with dual-core microcontroller and 2.4 GHz WiFi and Bluetooth connectivity.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/04/kv4p-ht-turn-an-android-smartphone-into-an-ham-radio-transceiver/"
  },
  {
    "title": "Linux-based Vega OS replaces Android-based Fire OS in Amazon Fire TV Stick 4K Select",
    "summary": "Amazon is shifting away from its Fire OS, using it on previous Fire TV devices, and is now deploying a new Linux-based Vega OS on the Fire TV Stick 4K Select. This new OS comes with a MediaTek MT8698 processor and includes features like HDMI 2.1 and WiFi 5. The change represents a significant departure from Amazon's previous strategy.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/03/linux-based-vega-os-replaces-android-based-fire-os-in-amazon-fire-tv-stick-4k-select/"
  },
  {
    "title": "M5Stack LLM-8850 card",
    "summary": "The M5Stack LLM-8850 card is an M.2 AI accelerator module utilizing the Axera AX8850 24 TOPS SoC, designed for accelerating AI workloads on host devices like Raspberry Pi and Rockchip SBCs. It features 8GB of LPDDR4x RAM and supports 8K video encoding/decoding, alongside an active cooling system. This card is a versatile hardware solution for edge AI applications.",
    "tags": [
      "AI",
      "Machine Learning",
      "Edge AI",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/03/m5stack-llm-8850-card-an-m-2-m-key-ai-accelerator-module-based-on-axera-ax8850-24-tops-soc/"
  },
  {
    "title": "Snapdragon X2 Elite Extreme and X2 Elite processors target high-end Windows PCs",
    "summary": "Qualcomm has launched the Snapdragon X2 Elite Extreme and X2 Elite processors designed for high-end Windows laptops. These 3nm processors boast impressive specs, including high clock speeds, advanced AI capabilities with an 80 TOPS Hexagon NPU, and cutting-edge connectivity features like WiFi 7 and PCIe Gen5. Qualcomm aims to deliver the fastest and most efficient performance for demanding laptop applications.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends",
      "AI"
    ],
    "link": "https://www.cnx-software.com/2025/10/02/snapdragon-x2-elite-extreme-and-x2-elite-processors-target-high-end-windows-pcs/"
  },
  {
    "title": "DDR4 supply/demand stress leads to Raspberry Pi CM4/CM5 price increases",
    "summary": "Rising DDR4 memory prices, driven by increased demand for AI workloads and limited supply, are impacting Raspberry Pi's Compute Module 4 and 5 (CM4/CM5) products. Consequently, Raspberry Pi is increasing prices for CM4/CM5 modules and the Raspberry Pi 500 unit-only PC by $5 to $10. This reflects the new cost realities of DDR4 memory.",
    "tags": [
      "Raspberry Pi",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/10/02/ddr4-supply-demand-stress-leads-to-raspberry-pi-cm4-cm5-price-increases/"
  },
  {
    "title": "AAEON GENE-ARH6",
    "summary": "The AAEON GENE-ARH6 is a 3.5-inch industrial SBC featuring Intel Core Ultra 200H/U SoCs, offering up to 96 TOPS of AI performance. It supports high memory capacity, multiple display outputs, and extensive connectivity options, alongside expansion slots like M.2 and PCIe. Designed for robust industrial applications, it includes security features and a wide operating temperature range.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/10/01/aaeon-gene-arh6-a-3-5-inch-subcompact-industrial-sbc-with-intel-core-ultra-200h-u-soc/"
  },
  {
    "title": "Aries MSRZG3E OSM-compliant SiP with Renesas RZ/G3E MPU targets industrial HMI and Edge AI",
    "summary": "The ARIES MSRZG3E is an OSM-compliant system-in-package (SiP) utilizing the Renesas RZ/G3E MPU, specifically designed for industrial HMI and Edge AI applications.  It features a quad-core Arm Cortex-A55 CPU, a Cortex-M33 real-time core, and an Ethos-U55 NPU offering significant AI processing capabilities, alongside a range of connectivity options.  The SiP comes with various memory and storage options, ensuring flexibility for diverse industrial deployments.",
    "tags": [
      "AI",
      "Edge AI",
      "Semiconductors",
      "Hardware"
    ],
    "link": "https://www.cnx-software.com/2025/10/01/aries-msrzg3e-osm-compliant-sip-with-renesas-rz-g3e-mpu-targets-industrial-hmi-and-edge-ai/"
  },
  {
    "title": "Fogwise AIRbox Q900 $599 Qualcomm IQ-9075 AI Box delivers up to 200 TOPS of AI performance",
    "summary": "The Fogwise AIRbox Q900 is a new AI micro-server boasting a Qualcomm IQ-9075 SoC with 200 TOPS of AI performance, 36GB of RAM, and 128GB of storage. Designed as a competitor to the NVIDIA Jetson Orin NX, it offers comparable performance and efficiency at a lower overall cost.  Key features include real-time cores, high-speed networking, and a dedicated VPU.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware",
      "Rockchip",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/09/30/fogwise-airbox-q900-599-qualcomm-iq-9075-ai-box-delivers-up-to-200-tops-of-ai-performance/"
  },
  {
    "title": "Orange Pi AI Studio Pro A Huawei Ascend 310 AI box with up to 352 TOPS, 192GB RAM",
    "summary": "The Orange Pi AI Studio Pro is an AI box utilizing two Huawei Ascend 310 processors, offering up to 352 TOPS of performance and 192GB of RAM. It builds upon the Orange Pi AIPro and is designed for AI applications, though it lacks common ports like HDMI and Ethernet. This device is a significant step forward in accessible AI hardware.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware"
    ],
    "link": "https://www.cnx-software.com/2025/09/30/orange-pi-ai-studio-pro-huawei-ascend-310-ai-mini-pc-with-up-to-352-tops-192gb-ram/"
  },
  {
    "title": "Intel N97 mini-ITX motherboard targets industrial automation, digital signage, networking appliances",
    "summary": "The Jetway DMTX-ADN1 mini-ITX motherboard utilizes the Intel N97 Alder Lake-N SoC and supports DDR5 memory, multiple displays, and a wide temperature range, making it suitable for demanding applications. Designed for industrial automation, digital signage, and networking appliances, it offers robust connectivity options like dual-channel LVDS/eDP and multiple I/O ports.  Its specifications include a quad-core processor, ample storage options, and supports up to 32GB of DDR5 RAM.",
    "tags": [
      "Hardware",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/09/30/intel-n97-mini-itx-motherboard-targets-industrial-automation-digital-signage-networking-appliances/"
  },
  {
    "title": "Linux 6.17 release Main changes, Arm, RISC-V, and MIPS architectures",
    "summary": "Linux kernel 6.17 has been released with primarily minor fixes, including critical locking fixes to address Bluetooth use-after-free vulnerabilities. The release features typical driver updates, mostly in GPU and networking, alongside updates for Arm, RISC-V, and MIPS architectures.  The merge window for 6.18 is opening with a substantial number of pull requests pending.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/29/linux-6-17-release-main-changes-arm-risc-v-and-mips-architectures/"
  },
  {
    "title": "Olimex RP2350-PICO2 open hardware boards expose all 48 GPIOs for breadboard prototyping",
    "summary": "Olimex has released the RP2350-PICO2-BB48 and BB48R open hardware boards based on the RP2350B MCU, offering all 48 GPIOs for easy breadboard prototyping. These boards feature a breadboard-friendly design with options for PSRAM and microSD, alongside standard connectivity like USB-C and various connectors. The pre-soldered headers and dual-core processor options make them perfect for DIY projects and hardware experimentation.",
    "tags": [
      "Hardware",
      "Raspberry Pi",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/09/29/olimex-rp2350-pico2-open-hardware-boards-expose-all-48-gpios-for-breadboard-prototyping/"
  },
  {
    "title": "LUNYEE 4040 PRO CNC router review with Candle software",
    "summary": "LUNYEE's 4040 PRO CNC router is designed for precision milling and engraving, supporting wood, plastic, and acrylic, and comes with a comprehensive accessory set including a probe system. The review focuses on using Candle software with this larger machine, replacing the previous Easel software review. It's particularly suitable for beginners due to its included accessories and robust construction.",
    "tags": [
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/09/28/lunyee-4040-pro-cnc-router-review-with-candle-software/"
  },
  {
    "title": "Fing Agent Raspberry Pi Kit",
    "summary": "Fing has released the Fing Agent Raspberry Pi Kit, a simplified network monitoring solution based on a Raspberry Pi 4. This kit, including a pre-installed microSD card and accessories, offers a plug-and-play alternative to the older Fingbox, allowing users to monitor devices, track uptime, and detect security threats through the Fing app or interface.",
    "tags": [
      "Raspberry Pi",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/27/fing-agent-raspberry-pi-kit-an-all-in-one-raspberry-pi-4-based-network-monitoring-solution/"
  },
  {
    "title": "Nordic nRF54LM20A Cortex-M33 wireless MCU doubles the SRAM to 512 KB, increases flash capacity",
    "summary": "The Nordic nRF54LM20A is a new Cortex-M33 based wireless MCU boasting significantly increased memory – 512 KB SRAM and higher flash capacity – compared to the nRF54L15.  Designed for applications like HID peripherals and gaming, it integrates advanced features including a RISC-V coprocessor and a powerful 2.4 GHz radio supporting multiple low-power protocols. This new MCU offers improved processing power, efficiency, and reduced power consumption compared to the nRF52 series.",
    "tags": [
      "Semiconductors",
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/26/nordic-nrf54lm20a-cortex-m33-wireless-mcu-doubles-the-sram-to-512-kb-increases-flash-capacity/"
  },
  {
    "title": "Arduino cloud adds Bluetooth based provisioning, starting with UNO R4 WiFi",
    "summary": "Arduino Cloud now offers a Bluetooth-based provisioning flow, beginning with the UNO R4 WiFi board, streamlining the initial setup process without cables. The Arduino IoT Cloud Remote app guides users through powering, connecting, and setting up the board, offering visual feedback and access to full Arduino Cloud features. This new flow includes 3 months of free Arduino Cloud Maker Plan access with the initial UNO R4 WiFi board release.",
    "tags": [
      "Hardware",
      "Trends"
    ],
    "link": "https://www.cnx-software.com/2025/09/26/arduino-cloud-adds-bluetooth-based-provisioning-starting-with-uno-r4-wifi/"
  },
  {
    "title": "A Catalyst for Open Source: NextPCB Launches KiCad Projects Platform to Fuel the Future of KiCad (Sponsored)",
    "summary": "NextPCB has launched kicadprojects.com, a platform designed to foster the KiCad open-source community by providing a space for sharing projects, collaborating, and streamlining PCB design workflows.  As a platinum KiCad sponsor, NextPCB is committing to donate $10 per approved project to support the KiCad Project, promoting innovation within the ecosystem. This initiative aims to strengthen the KiCad community and encourage the development of open-source hardware solutions.",
    "tags": [
      "Hardware",
      "Trends",
      "Semiconductors"
    ],
    "link": "https://www.cnx-software.com/2025/09/26/a-catalyst-for-open-source-nextpcb-launches-kicad-projects-platform-to-fuel-the-future-of-kicad/"
  },
  {
    "title": "Espressif s EchoEar ESP32-S3 voice-controlled AI chatbot runs esp-brookesia firmware",
    "summary": "The Espressif EchoEar is a compact AI chatbot based on the ESP32-S3, designed for voice interaction and edge AI applications. It features a circular touch display, dual microphones, and support for large AI models.  The device utilizes the ESP32-S3-WROOM-1 module and includes peripherals like a speaker and microSD card slot.",
    "tags": [
      "AI",
      "Edge AI",
      "Hardware"
    ],
    "link": "https://www.cnx-software.com/2025/09/26/espressif-echoear-esp32-s3-voice-controlled-ai-chatbot-with-circular-touchscreen-and-mic-array/"
  },
  {
    "title": "Raspberry Pi 500+ mechanical keyboard PC gets 256 GB NVMe SSD, 16GB RAM, RGB LED lighting",
    "summary": "The Raspberry Pi 500+ builds upon the original Raspberry Pi 500 keyboard PC, incorporating a mechanical keyboard with RGB lighting and enhanced storage with a 256GB NVMe SSD and 16GB RAM. It retains the original's key features including micro HDMI ports, Gigabit Ethernet, WiFi 5, and Bluetooth 5.0, alongside the Broadcom BCM2712 processor.",
    "tags": [
      "Raspberry Pi",
      "Hardware",
      "Edge AI"
    ],
    "link": "https://www.cnx-software.com/2025/09/25/raspberry-pi-500-mechanical-keyboard-pc-gets-256-gb-nvme-ssd-16gb-ram-rgb-led-lighting/"
  },
  {
    "title": "5 Ways Embedded AI Processors are Revolutionizing Device Performance (Sponsored)",
    "summary": "Edge AI is shifting processing power from the cloud to devices, enabling faster decision-making and enhanced privacy by running AI models locally. This trend, fueled by significant enterprise investment estimated at $261 billion by 2025, is driven by the ability to eliminate cloud latency and protect sensitive data.  The move to on-device AI processing is transforming industries like automation with real-time applications.",
    "tags": [
      "AI",
      "Edge AI",
      "Trends",
      "Hardware"
    ],
    "link": "https://www.cnx-software.com/2025/09/25/5-ways-embedded-ai-processors-are-revolutionizing-device-performance/"
  }
]