[
  {
    "title": "Samsung introduces SOCAMM2 LPDDR5X memory module for AI data centers   new standard set to offer reduced power consumption and double the bandwidth versus DDR5 RDIMMs",
    "link": "https://www.tomshardware.com/tech-industry/samsung-introduces-socamm2-lpddr5x-memory-module-for-ai-data-centers",
    "summary": "Samsung has announced its own SOCAMM2 LPDDR5-based memory module designed specifically for AI data center platforms, pitching it as as a way to bring the power efficiency and bandwidth advantages of LPDDR5X into servers."
  },
  {
    "title": "Here's why HBM is coming for your PC's RAM    HBM consumes around three times the wafer capacity of DDR5 per gigabyte, as AI supercharges demand for chips and advanced packaging",
    "link": "https://www.tomshardware.com/pc-components/ram/hbm-is-eating-your-ram",
    "summary": "AI s appetite for high-bandwidth memory is reshaping the global DRAM and NAND market, diverting wafer capacity and advanced packaging away from consumer products and driving sharp price increases across markets."
  },
  {
    "title": "LG responds swiftly to user backlash, will allow users to remove Microsoft Copilot link from TVs   clarifies service is not an app, future update will include tile removal option from WebOS",
    "link": "https://www.tomshardware.com/monitors/televisions/lg-says-microsoft-copilot-on-webos-tvs-is-a-browser-shortcut-not-a-built-in-app",
    "summary": "LG has clarified how Microsoft Copilot appears on its webOS smart TVs following recent coverage that described the feature as a non-removable app bundled into the operating system."
  },
  {
    "title": "Grab a new Elegoo 3D printer from just $149, thanks to huge holiday sale   up to 53% savings on FDM and resin machines before Christmas",
    "link": "https://www.tomshardware.com/3d-printing/grab-a-new-elegoo-3d-printer-from-just-usd149-thanks-to-huge-holiday-sale-up-to-53-percent-savings-on-fdm-and-resin-machines-before-christmas",
    "summary": "Elegoo has slashed the prices on its 3D printers for the holidays, with up to 53% off."
  },
  {
    "title": "Taiwan considers TSMC export ban that would prevent manufacturing its newest chip nodes in U.S.   limit exports to two generations behind leading-edge nodes, could slow down U.S. expansion",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/taiwan-considers-tsmc-export-ban-that-would-prevent-manufacturing-its-newest-chip-nodes-in-u-s-limit-exports-to-two-generations-behind-leading-edge-nodes-could-slow-down-u-s-expansion",
    "summary": "Taiwan's government is considering imposing N+2 export rule on TSMC's advanced process technologies, which would make it significantly harder for the foundry to develop overseas."
  },
  {
    "title": "Prusa Research introduces the Open Community License to protect open source 3D Printing hardware   new rules aimed at addressing industry abuses",
    "link": "https://www.tomshardware.com/3d-printing/prusa-research-introduces-the-open-community-license-to-protect-open-source-3d-printing-hardware-new-rules-aimed-at-addressing-industry-abuses",
    "summary": "Full STEP and Fusion CAD files for the CORE One+ and CORE One L are now available on Printables under the new OCL license."
  },
  {
    "title": "Helping to fight the RAM-pocalypse, this $470 Newegg combo pairs an Asus RoG Strix X870E-H WiFi 7 motherboard with 32GB of G.Skill Flare X5 Series DDR5-6000 RAM",
    "link": "https://www.tomshardware.com/pc-components/helping-to-fight-the-ram-pocalypse-this-usd470-newegg-combo-pairs-an-asus-rog-strix-x870e-h-wifi-7-motherboard-with-32gb-of-g-skill-flare-x5-series-ddr5-6000-ram",
    "summary": "Save $119 when you pick up this Newegg motherboard and RAM bundle: Asus's X870E-H motherboard and G.Skill DDR5-6000 32GB RAM kit paired together to save you money."
  },
  {
    "title": "Ongoing YouTube, Google outage reported   outage spikes across popular services",
    "link": "https://www.tomshardware.com/news/live/ongoing-youtube-google-outage-reported-outage-spikes-across-popular-services",
    "summary": "Multiple reports indicate that YouTube, YouTube TV, and Google are all down."
  },
  {
    "title": "OpenAI's Stargate data center gets approval to receive 1.4 gigawatts of power in Michigan   some residents furious as energy company is given go-ahead by regulatory body without hearing opposition",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/openais-stargate-data-center-gets-approval-to-receive-1-4-gigawatts-of-power-in-michigan-some-residents-furious-as-energy-company-is-given-go-ahead-by-regulatory-body-without-hearing-opposition",
    "summary": "The Michigan Public Service Commission approved the 1.4-gigawatt contract between DTE Energy and a Stargate data center, raising fears that energy prices will spike for residents in the area."
  },
  {
    "title": "HP Omen 34c G2 34-inch WQHD 180 Hz gaming monitor review: Delivering style, speed and value",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/hp-omen-34c-g2-34-inch-wqhd-180-hz-gaming-monitor-review",
    "summary": "HP brings solid performance and value to the 34-inch ultra-wide segment with the Omen 34c G2. It s a VA panel with WQHD 3440x1440 resolution, 1500R curve, 180 Hz, Adaptive-Sync, MPRT backlight strobe, HDR400 and wide gamut color."
  },
  {
    "title": "Intel-certified 256 GB DDR5 stick could cut Xeon memory power by 18%, saving millions of dollars   a 32W-per-socket reduction could save millions  per hyperscale data center",
    "link": "https://www.tomshardware.com/pc-components/dram/intel-certified-256-gb-ddr5-stick-could-cut-xeon-memory-power-by-18-percent-saving-millions-of-dollars-a-32w-per-socket-reduction-could-save-millions-per-hyperscale-data-center",
    "summary": "SK hynix first to validate 32Gb-based 256GB DDR5 module with Intel: up to 32.4W power savings per server, or millions of dollars per hyperscale data center."
  },
  {
    "title": "China convicts 27 people for smuggling 166 tons of critical chipmaking element antimony   heavily-restricted mineral used for semiconductor manufacturing exported without licenses, court decides",
    "link": "https://www.tomshardware.com/tech-industry/china-convicts-27-people-for-smuggling-antimony-166-tons-of-mineral-used-for-semiconductor-manufacturing-exported-without-licenses-court-decides",
    "summary": "A Chinese court sentenced 27 individuals for illegally exporting antimony ingots without licenses, with authorities saying more than 166 metric tons were smuggled earlier this year."
  },
  {
    "title": "French authorities arrest man for installing malware on a passenger ferry on behalf of 'a foreign power'   could have enabled external control of systems, including navigation",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/french-ferry-malware-arrest-exposes-fragile-boundaries-between-ship-it-and-navigation-systems",
    "summary": "French authorities have arrested a Latvian national suspected of installing malware aboard an Italian passenger ferry while it was docked in southern France."
  },
  {
    "title": "North Korean hackers stole record $2 billion in crypto in 2025, including single heist worth $1.5 billion, report claims   rogue state accounts for 60% of all reported crypto thefts this year, $6.75 billion total since records began",
    "link": "https://www.tomshardware.com/tech-industry/cryptocurrency/north-korean-hackers-steal-a-record-usd2-billion-in-crypto-in-2025-including-single-heist-worth-usd1-5-billion-report-claims-rogue-state-accounts-for-60-percent-of-all-reported-crypto-thefts-this-year-usd6-75-billion-total-since-records-began",
    "summary": "Blockchain analytics company Chainalysis says DPRK has set a record for 2025, with the regime expected to execute more sophisticated attacks in the future."
  },
  {
    "title": "Grab this  138 2TB Acer Predator SSD before flash prices soar further   fast Gen 4 speeds make this an essential upgrade for your gaming PC",
    "link": "https://www.tomshardware.com/pc-components/ssds/grab-this-gbp138-2tb-acer-predator-ssd-before-flash-prices-soar-further-fast-gen-4-speeds-make-this-an-essential-upgrade-for-your-gaming-pc",
    "summary": "The 2TB Acer Predator GM7000 is a good all-rounder SSD, and priced at 137.96, this is the most affordable 2TB drive you can buy right now in the UK."
  },
  {
    "title": "Critical motherboard flaw allows game cheats, Riot Games blocks 'Valorant' players that don't update BIOS   security patches pushed live by all major motherboard vendors",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/critical-motherboard-flaw-allows-game-cheats-riot-games-blocks-valorant-players-that-dont-update-bios-security-patches-pushed-live-by-all-major-motherboard-vendors",
    "summary": "Riot Games discovered a vulnerability in several motherboards that potentially allowed cheating DMA devices to run before protections kicked in after boot."
  },
  {
    "title": "Windows Server 2025 gains native NVMe support, 14 years after its introduction   groundbreaking I/O stack drops SCSI emulation limitations for massive throughput and CPU efficiency gains",
    "link": "https://www.tomshardware.com/desktops/servers/windows-server-2025-gains-native-nvme-support-14-years-after-its-introduction-groundbreaking-i-o-stack-drops-scsi-emulation-limitations-for-massive-throughput-and-cpu-efficiency-gains",
    "summary": "Windows Server 2025 gets native NVMe with massive I/O and CPU gains"
  },
  {
    "title": "Score the Meta Quest 3S at its lowest-ever price before Christmas, now just  229   save 21% on this standalone VR headset with 128GB of storage",
    "link": "https://www.tomshardware.com/pc-components/score-the-meta-quest-3s-at-its-lowest-ever-price-before-christmas-now-just-gbp229-save-21-percent-on-this-standalone-vr-headset-with-128gb-of-storage",
    "summary": "Save 60 on the price of the Meta Quest S3 VR headset, back down to its lowest ever price, with delivery still possible before Christmas."
  },
  {
    "title": "AMD's legacy Ryzen 7 5800X3D chips now sell for up to $800, more than a new 9800X3D   AM4 chip costs twice as much as MSRP, as enthusiasts flock to old DDR4 memory",
    "link": "https://www.tomshardware.com/pc-components/cpus/amds-legacy-ryzen-7-5800x3d-chips-now-sell-for-up-to-usd800-more-than-a-new-9800x3d-am4-chip-costs-twice-as-much-as-msrp-as-enthusiasts-flock-to-old-ddr4-memory",
    "summary": "As DDR5 memory prices skyrocket, demand for AMD's two-generation-old Ryzen 7 5800X3D has increased, causing second-hand prices to climb as high as $800 on eBay."
  },
  {
    "title": "Huawei's AI chip capabilities still pale in comparison to American silicon   report from U.S. council details that despite fears, Nvidia continues to lead by a wide margin",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/huawei-still-cant-match-nvidia-on-ai-chips-says-cfr-report",
    "summary": "A new report from the Council on Foreign Relations concludes that Huawei s AI chip capabilities lag behind Nvidia s by a wide margin, and that the gap is growing exponentially."
  },
  {
    "title": "Mini-ITX motherboard launches with four full-sized RAM slots in the middle of a RAM shortage   support for up to 256GB of glorious DDR5 on a tiny PCB",
    "link": "https://www.tomshardware.com/pc-components/motherboards/mini-itx-motherboard-launches-with-four-full-sized-ram-slots-in-the-middle-of-a-ram-shortage-support-for-up-to-256gb-of-glorious-ddr5-on-a-tiny-pcb",
    "summary": "Maxsun launches the MS-PC Farm B860I, a mini-ITX motherboard with four DDR5 memory slots for Intel processors."
  },
  {
    "title": "Unreal Engine 5.7 brings significant improvements over the notoriously demanding 5.4 version, tester claims   benchmark shows up to 25% GPU performance increase, 35% CPU boost",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/unreal-engine-5-7-brings-significant-improvements-over-the-notoriously-demanding-5-4-version-tester-claims-benchmark-shows-up-to-25-percent-gpu-performance-increase-35-percent-cpu-boost",
    "summary": "Epic is making strides with Unreal Engine 5's development trajectory, fixing performance issues that've bogged down many new releases. The latest version, UE 5.7, reportedly not only improves CPU and GPU-bound performance but ups the visual fidelity, without any real downsides."
  },
  {
    "title": "TSMC brings its most advanced chipmaking node to the US yet, to begin equipment installation for 3mn months ahead of schedule   Arizona fab slated for production in 2027",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/tsmc-brings-its-most-advanced-chipmaking-node-to-the-us-yet-to-begin-equipment-installation-for-3mn-months-ahead-of-schedule-arizona-fab-slated-for-production-in-2027",
    "summary": "Fab 21 phase 2 shell is complete, fab is on track for equipment move in in mid-2026 and for volume production in 2027."
  },
  {
    "title": "This  379.99 MSI gaming handheld is the cheapest Steam Deck rival you can buy right now   huge saving on this Claw A1M's original price scores you rig with 1TB SSD and 16GB RAM",
    "link": "https://www.tomshardware.com/video-games/handheld-gaming/this-gbp379-99-msi-gaming-handheld-is-the-cheapest-steam-deck-rival-you-can-buy-right-now-huge-saving-on-this-claw-a1ms-original-price-scores-you-rig-with-1tb-ssd-and-16gb-ram",
    "summary": "This MSI Claw A1M handheld is down to just 379.99, making it one of the cheapest alternatives to the Steam Deck that you can buy right now"
  },
  {
    "title": "AI surpasses 2024 Bitcoin mining in energy usage, uses more H20 than the bottles of water people drink globally, study claims   says AI demand could hit 23GW and up to 764 billion liters of water in 2025",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/ai-surpasses-2024-bitcoin-mining-in-energy-usage-uses-more-h20-than-the-bottles-of-water-people-drink-globally-study-claims-says-ai-demand-could-hit-23gw-and-up-to-764-billion-liters-of-water-in-2025",
    "summary": "A study finds that AI has surpassed Bitcoin and the bottled water industry in its use of resources, with other experts saying that the estimate is actually conservative."
  },
  {
    "title": "HyperX SoloCast 2 Review: A built-in stand that you'll want to mount",
    "link": "https://www.tomshardware.com/peripherals/microphones/hyperx-solocast-2-review",
    "summary": "The HyperX SoloCast 2 is an impressive $60 cardioid mic with a clever built-in stand, but you'll still want to mount it on a boom arm for the best results."
  },
  {
    "title": "North Korean infiltrator caught working in Amazon IT department thanks to lag   110ms keystroke input raises red flags over true location",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/north-korean-infiltrator-caught-working-in-amazon-it-department-thanks-to-lag-110ms-keystroke-input-raises-red-flags-over-true-location",
    "summary": "A North Korean imposter was uncovered, working as a sysadmin at Amazon U.S., after their keystroke input lag raised suspicions with security specialists at the online retail giant."
  },
  {
    "title": "Grab a punchy RTX 5060 Ti-powered iBuypower gaming PC for less than $900   it even packs 32GB of DDR5 RGB RAM and an 8-core Ryzen processor",
    "link": "https://www.tomshardware.com/desktops/gaming-pcs/grab-a-punchy-rtx-5060-ti-powered-ibuypower-gaming-pc-for-less-than-usd900-it-even-packs-32gb-of-ddr5-rgb-ram-and-an-8-core-ryzen-processor",
    "summary": "With 32GB of DDR5 RAM and an RTX 5060 Ti, this $899 PC from Walmart is a smart pick ahead of Christmas"
  },
  {
    "title": "Honda to temporarily shut down factories in China and Japan because of chip shortage   disruption caused by fallout from on-going conflict within Nexperia",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/honda-to-temporarily-shut-down-factories-in-china-and-japan-because-of-chip-shortage-disruption-caused-by-fallout-from-on-going-conflict-within-nexperia",
    "summary": "Honda announced the suspension of operations in five automotive manufacturing plants, citing the lack of legacy chips from Nexperia as the reason behind the move."
  },
  {
    "title": "42-year old QuickShot II joystick gets an era-appropriate revival   iconic joystick is the perfect companion for an 80s retro setup",
    "link": "https://www.tomshardware.com/video-games/retro-gaming/42-year-old-quickshot-ii-joystick-gets-an-era-appropriate-revival-iconic-joystick-is-the-perfect-companion-for-an-80s-retro-setup",
    "summary": "The iconic QuickShot II from the Commodore 64 era is getting a modern revival, mixing together an era-appropriate design with contemporary features."
  },
  {
    "title": "Samsung eyed up for huge 8nm chip order from Intel   the Z990 chipset for Nova Lake CPUs could be Intel's 8nm debut",
    "link": "https://www.tomshardware.com/pc-components/chipsets/samsung-eyed-up-for-huge-8nm-chip-order-from-intel-the-z990-chipset-for-nova-lake-cpus-could-be-intels-8nm-debut",
    "summary": "According to a Hankyung report, Samsung Foundry has secured a substantial order from Intel to produce Intel's chipsets on Samsung Foundry's 8nm process node."
  },
  {
    "title": "China may have reverse engineered EUV lithography tool in covert lab, report claims   employees given fake IDs to avoid secret project being detected, prototypes expected in 2028",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/china-may-have-reverse-engineered-euv-lithography-tool-in-covert-lab-report-claims-employees-given-fake-ids-to-avoid-secret-project-being-detected-prototypes-expected-in-2028",
    "summary": "China has reportedly built and begun testing a secret EUV lithography prototype using ASML-style laser-produced plasma technology. Yet, despite generating 13.5-nm light, the system remains unable to make chips and appears to be years away from achieving a complete, production-ready EUV manufacturing capability."
  },
  {
    "title": "New Texas Instruments fab will pump out tens of millions of chips per day   first 300mm fab starts production after $60 billion investment",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/new-texas-instruments-fab-will-pump-out-tens-of-millions-of-chips-per-day-first-300mm-fab-starts-production-after-usd60-billion-investment",
    "summary": "Texas Instruments has started producing 300mm wafers at its new Sherman, Texas mega-site, with the SM1 fab capable of outputting tens of millions of chips per day."
  },
  {
    "title": "'$100 Steam Machine' uses a cut-down PS5 APU with Bazzite   DIY console offers 60 FPS at 1080p with 16GB of GDDR6",
    "link": "https://www.tomshardware.com/pc-components/gpus/usd100-steam-machine-uses-a-cut-down-ps5-apu-with-bazzite-diy-console-offers-60-fps-at-1080p-with-16gb-of-gddr6",
    "summary": "A YouTuber built \"$100 Steam Machine\" using an ASRock mining blade featuring a B-grade AMD SoC from the base PlayStation 5 with disabled cores. The neutered PS5 chip can run games at 1080p and 60 FPS."
  },
  {
    "title": "Micron outlines grim outlook for DRAM supply in first earnings call since killing Crucial memory and SSD brand   CEO says it can only meet half to two-thirds of demand",
    "link": "https://www.tomshardware.com/pc-components/dram/micron-outlines-grim-outlook-for-dram-supply-in-first-earnings-call-since-killing-crucial-memory-and-ssd-brand-ceo-says-it-can-only-meet-half-to-two-thirds-of-demand",
    "summary": "Micron posted record revenues in its first earnings call since killing the consumer Crucial brand, though it admits that supply shortages will persist."
  },
  {
    "title": "Evidence of Intel's 'Big Battlemage' GPU continues to mount, as BMG-G31 chip gets another official confirmation",
    "link": "https://www.tomshardware.com/pc-components/gpus/evidence-of-intels-big-battlemage-gpu-continues-to-mount-as-bmg-g31-chip-gets-another-official-confirmation",
    "summary": "The XPU Manager tool is for monitoring Intel's datacenter GPUs, meaning it's very likely these parts are coming soon."
  },
  {
    "title": "Sales of chip production equipment to reach $156 billion by 2027   China, Taiwan, and Korea lead intense demand",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/sales-of-chip-production-equipment-to-reach-usd156-billion-by-2027-china-taiwan-and-korea-lead-intense-demand",
    "summary": "Driven by demand for AI and HPC accelerators, sales of chip production equipment are projected to increase through 2027. Asian countries are expected to lead the pack, according to SEMI."
  },
  {
    "title": "AMD's rumored Ryzen 7 9850X3D spotted at Swiss and U.S. retailers   listings reveal preliminary price of ~$550-600, significantly higher than 9800X3D's $449 MSRP",
    "link": "https://www.tomshardware.com/pc-components/cpus/amds-upcoming-ryzen-7-9850x3d-spotted-at-swiss-and-u-s-retailers-listings-reveal-preliminary-price-of-usd550-600-significantly-higher-than-9800x3ds-usd449-msrp",
    "summary": "The Ryzen 7 9850X3D has been spotted at two retailers with slightly different prices, suggesting it would cost between $550 to $600, which is quickly coming up with CES 2026 right around the corner. These early listings are likely inaccurate and should be taken with a huge grain of salt, especially considering that the 9800X3D launched at a $479 MSRP."
  },
  {
    "title": "Rapidus explores panel-level packaging on glass substrates for next-generation processors   aggressive plan would help it leapfrog rivals",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/rapidus-explores-panel-level-packaging-on-glass-substrates-for-next-generation-processors-aggressive-plan-would-help-it-leapfrog-rivals",
    "summary": "Rapidus plans to outline its early-stage work on panel-level packaging using 600 600 mm glass substrates at SEMICON Japan, highlighting an aggressive plan to leapfrog rivals by combining glass-core substrates and PLP for future AI and HPC chiplet packages."
  },
  {
    "title": "How to choose a CPU   A guide to picking the right processor for your PC",
    "link": "https://www.tomshardware.com/pc-components/cpus/cpu-buying-guide",
    "summary": "Choosing the right CPU is one of the first decisions you need to make when building a PC. Here's how to make that tough choice."
  },
  {
    "title": "Engineer turns E-ink tablet into computer monitor in Linux   perfect secondary reading screen to reduce eye strain over the network",
    "link": "https://www.tomshardware.com/software/linux/engineer-turns-e-ink-tablet-into-computer-monitor-in-linux-perfect-secondary-reading-screen-to-reduce-eye-strain-over-network",
    "summary": "A software engineer and E-ink enthusiast recently set up a remote E-ink secondary display, upcycling an old E-ink tablet and setting up an awesome Linux DIY project for all those with the need to read on bespoke screen hardware."
  },
  {
    "title": "Turtle Beach Vulcan II TKL review: Pretty, bright, and mechanical",
    "link": "https://www.tomshardware.com/peripherals/gaming-keyboards/turtle-beach-vulcan-ii-tkl-review",
    "summary": "Turtle Beach's Vulcan II TKL is an attractive hot-swappable gaming keyboard with a slim, well-built chassis and hot-swappable linear mechanical switches."
  },
  {
    "title": "Intel details progress on fabbing 2D transistors a few atoms thick in standard high volume fab production environment   chipmaker outlines 300-mm fab compatible with integration of 2D transistor contacts and gate stacks",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/intel-shows-300-mm-fab-compatible-integration-of-2d-transistor-contacts-and-gate-stacks",
    "summary": "Intel and imec demonstrate the first 300-mm, fab-compatible integration of contacts and gate stacks for 2D transistors, marking a critical step in turning long-studied 2D materials from lab experiments into a realistic future option for high-volume logic manufacturing."
  },
  {
    "title": "Corsair MP700 Pro XT 2TB SSD review: the fastest SSD ever has landed with a record 3.3 million IOPS and nearly 15 GB/s",
    "link": "https://www.tomshardware.com/pc-components/ssds/corsair-mp700-pro-xt-2tb-ssd-review",
    "summary": "The Corsair MP700 Pro XT is fashionably late, delivering solid numbers across the board to usher in a true high-end SSD contender."
  },
  {
    "title": "Intel installs industry's first commercial High-NA EUV lithography tool   ASML Twinscan EXE:5200B sets the stage for 14A",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/intel-installs-industrys-first-commercial-high-na-euv-lithography-tool-asml-twinscan-exe-5200b-sets-the-stage-for-14a",
    "summary": "Intel has installed and qualified ASML's TWINSCAN EXE:5200B, the first High-NA EUV lithography tool designed for commercial production, reiterating Intel's plans to use High-NA EUV patterning for 14A process technology and onwards."
  },
  {
    "title": "Score an RTX 5080 and 9800X3D pre-built for under  2,300 with this CyberPowerPC deal   save  200 on this 4K gaming PC with 32GB RAM and 1TB SSD",
    "link": "https://www.tomshardware.com/pc-components/score-an-rtx-5080-and-9800x3d-pre-built-for-under-gbp2-300-with-this-cyberpowerpc-deal-save-gbp200-on-this-4k-gaming-pc-with-32gb-ram-and-1tb-ssd",
    "summary": "EE have slashed the price of this powerful CyberPowerPC gaming rig to just 2,299, featuring an AMD Ryzen 7 9800X3D and Nvidia GeForce RTX 5080."
  },
  {
    "title": "These 16 gadgets under $100 are must-haves for hobbyists and PC builders    these last-minute tech gifts are our personal picks for the tech savvy on your gift list",
    "link": "https://www.tomshardware.com/pc-components/these-16-gadgets-under-usd100-are-must-haves-for-hobbyists-and-pc-builders-these-last-minute-tech-gifts-are-our-personal-picks-for-the-tech-savvy-on-your-gift-list",
    "summary": "Struggle no more for budget-friendly tech gifts during this holiday season, with everything from screwdrivers to M.2 SSD enclosures ready to wrap up and share."
  },
  {
    "title": "Newegg's triple component combo deal for $459 pairs an Asus X870 motherboard with 32GB of DDR5-6000 RAM, and a 240mm AIO cooler   $780 worth of parts if purchased individually",
    "link": "https://www.tomshardware.com/pc-components/neweggs-triple-component-combo-deal-for-usd459-pairs-an-asus-x870-motherboard-with-32gb-of-ddr5-6000-ram-and-a-240mm-aio-cooler-usd780-worth-of-parts-if-purchased-individually",
    "summary": "Pay $780 for these parts separately, or take advantage of Newegg's bundle price and get them all for just $459"
  },
  {
    "title": "Kioxia's next-gen 3D NAND production gets expedited to 2026, report claims   high-capacity 332-layer BiCS10 devices to sate growing demand from AI data centers",
    "link": "https://www.tomshardware.com/pc-components/ssds/kioxias-next-gen-3d-nand-production-gets-expedited-to-2026-report-claims-high-capacity-332-layer-bics10-devices-to-sate-growing-demand-from-ai-data-centers",
    "summary": "Kioxia is reportedly pulling in mass production of high-capacity BiCS10 3D NAND devices with a 4.8 GT/s interface from 2027 to 2026, possibly to meet demand from AI, cloud, and enterprise storage sectors."
  },
  {
    "title": "Anycubic s  Dual  Resin Printer, Photon P1 is out   Supports double the color, double the material",
    "link": "https://www.tomshardware.com/3d-printing/anycubics-dual-resin-printer-photon-p1-is-out-supports-double-the-color-double-the-material",
    "summary": "The P1 is the latest addition to Anycubic's Photon lineup."
  },
  {
    "title": "Fanless Box PC features Intel Core Ultra 5/7/9  Arrow Lake  CPU with up to 36 TOPS for Edge AI applications",
    "link": "https://www.cnx-software.com/2025/12/19/fanless-box-pc-features-intel-core-ultra-5-7-9-arrow-lake-cpu-with-up-to-36-tops-for-edge-ai-applications/",
    "summary": "AAEON BOXER-6648-ARS is a powerful, yet fanless embedded Box PC equipped with the latest generation Intel Core Ultra 5/7/9 Arrow Lake CPU with up to 24 cores clocked at up to 5.6 GHz, 36 TOPS of AI performance, and 35W or 65W TDP. The embedded computer is offered with either an Intel H810 or Intel Q870 chipset, with the latter enabling Intel Active Management Technology (AMT) and 10 Gbps USB 3.2 Gen2 ports. Other features include up to 96GB RAM, NVMe and SATA storage, dual HDMI video output, dual 2.5GbE, a Gigabit Ethernet port, optional WiFi and Bluetooth, a 10-pin terminal block, and up to six RS232/RS422/RS485 COM ports. AAEON BOXER-6648-ARS specifications: Arrow Lake SoC (one or the other) Intel Core Ultra 5 245 10-core (6P + 4E) processor up to 3.3 GHz / 4.9 GHz (Turbo), 20MB cache, 2x Xe core graphics; TDP: 65W; AI: 23 TOPS Intel [...] The post Fanless Box PC features Intel Core Ultra 5/7/9 Arrow Lake CPU with up to 36 TOPS for Edge AI applications appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP32-P4 learning and prototyping kit features 7-inch touchscreen, comes with 16 modules and AI lessons",
    "link": "https://www.cnx-software.com/2025/12/19/esp32-p4-learning-and-prototyping-kit-features-7-inch-touchscreen-comes-with-16-modules-and-ai-lessons/",
    "summary": "Elecrow s All-in-One Starter Kit for ESP32-P4 is an open-source learning and prototyping platform based on the ESP32-P4 processor, offering AI, multimedia, and embedded features in a single, self-contained kit designed for students, educational institutions, and developers for rapid prototyping. The open hardware kit integrates a 7-inch touchscreen display, a 2MP camera, and sixteen built-in electronic modules, supported by over 20 structured lessons that progressively cover I/Os, audio, LVGL GUI development, and basic AI use cases. Development is done in C using Espressif s ESP-IDF framework, ready-to-build examples, and modular BSP drivers, making the kit suitable for learning embedded systems, IoT device control, human-machine interfaces, smart home concepts, and entry-level Edge AI applications. All-in-one Starter Kit for ESP32-P4 kit specifications: Wireless MCU ESP32-P4NRW32 MCU Dual-core RISC-V microcontroller @ 400 MHz with AI instructions extension and single-precision FPU Single-RISC-V LP (Low-power) MCU core @ up to 40 MHz GPU 2D Pixel [...] The post ESP32-P4 learning and prototyping kit features 7-inch touchscreen, comes with 16 modules and AI lessons appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Raspberry Pi RP2350 devkit features 1.85-inch round touch display, microphone, optional speaker and battery box",
    "link": "https://www.cnx-software.com/2025/12/19/raspberry-pi-rp2350-devkit-features-1-85-inch-round-touch-display-microphone-optional-speaker-and-battery-box/",
    "summary": "Waveshare RP2350-Touch-LCD-1.85C is a Raspberry Pi RP2350 devkit with a 1.85-inch round touchscreen display with 360 360 resolution, a built-in microphone, a 28-pin GPIO header, and a USB-C port. The RP2350-Touch-LCD-1.85C-BOX model builds on the platform to add a box with a speaker and a 3.7V battery. Both models also come with 16MB SPI flash, a microSD card slot, a 6-axis IMU, a few buttons and LEDs, and UART and I2C expansion connectors. They can be used for HMI solutions using touch, button, and voice recognition inputs, as well as display and audio outputs. RP2350-Touch-LCD-1.85C specifications: Microcontroller Raspberry Pi RP2350A MCU CPU 2x Arm Cortex-M33 cores @ 150 MHz 2x Hazard3 RISC-V cores @ 150 MHz Up to two cores can be used at any time (configured at boot) Memory 520KB SRAM Storage 8KB OTP Package QFN-60; 7 7 mm Storage 16MB SPI NOR flash, microSD card slot Display [...] The post Raspberry Pi RP2350 devkit features 1.85-inch round touch display, microphone, optional speaker and battery box appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "LILYGO T-Echo Plus off-grid LoRa communicator features a climbing hook for hiking, cycling, and remote communication",
    "link": "https://www.cnx-software.com/2025/12/19/lilygo-t-echo-plus-off-grid-lora-communicator-features-a-climbing-hook-for-hiking-cycling-and-remote-communication/",
    "summary": "The LILYGO T-Echo Plus is another off-grid LoRa communicator, similar to Blackout Comms, ThinkNode M2, and Wio Tracker L1 Pro, but it features a metal attachment loop (designed like a climbing hook) for use in hiking, cycling, and off-grid environments. Built around a Nordic Semi nRF52840 MCU, it supports Bluetooth 5, Thread, Zigbee, and 802.15.4. It also adds an SX1262 LoRa transceiver, a 1.54-inch 200 200 SPI E-Paper display, and an L76K GNSS module. Other features include a 6-axis IMU (BHI260AP), a vibration motor, a buzzer, and a larger 2400mAh battery, along with a 1/4-inch mount and a climbing finger loop for gear attachment. Additional features include an optional BME280 sensor, Grove expansion, all in a rugged and compact enclosure with a long external antenna for extended LoRa range. LILYGO T-Echo Plus Specifications: SoC Nordic Semiconductor nRF52840 CPU 32-bit Arm Cortex-M4F microcontroller @ 64 MHz Memory/Storage 2 MB Flash, [...] The post LILYGO T-Echo Plus off-grid LoRa communicator features a climbing hook for hiking, cycling, and remote communication appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "REETLE SmartInk I   An AI-powered E-Ink phone case with voice recording (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/18/reetle-smartink-i-an-ai-powered-e-ink-phone-case-with-voice-recording/",
    "summary": "The REETLE SmartInk I is a phone case with a touch-enabled E-Ink display and built-in AI features. It features a secondary screen on the back for reading text, viewing notes, recording voice, and displaying to-do items, allowing basic tasks to be completed without using the phone s main display. In the back, you have a 3.97-inch E-Ink touchscreen with one-press voice recording, AI-based transcription, summarization, and smart to-do display, all synced to a companion mobile app via Bluetooth 5.0. It supports iPhone 13 17 series and a wide range of Android phones, features a 300 mAh battery with 10W MagSafe wireless charging, and delivers up to 10 hours of reading, 8 hours of recording, and over 2 weeks of standby time. Weighing around 55 grams with a total thickness under 4 mm, it includes military-grade drop protection, tempered glass, widget switching (QR codes, notes, schedules), a thin design, and a 10 C to [...] The post REETLE SmartInk I An AI-powered E-Ink phone case with voice recording (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "NASP NeuroVoice VAD chip enables always-on voice activity detection at microwatt-level power consumption",
    "link": "https://www.cnx-software.com/2025/12/18/nasp-neurovoice-vad-chip-enables-always-on-voice-activity-detection-at-microwatt-level-power-consumption/",
    "summary": "POLYN Technology s Neuromorphic Analog Signal Processor (NASP) NeuroVoice VAD is an always-on, ultra-low-power chip that detects voice in any noisy background, at microwatt-level power consumption and microsecond-scale latency. Everything happens on the chip, so no Internet is needed. Potential applications include smart remote controls, earbuds, wearables, voice access, IoT, Industry 4.0, robotics, Smart Home/Factory, mobility, and more. NASP NeuroVoice VAD chip (NV-VAD 100) specifications: Features Voice detection at ultra-low power consumption Voice passthrough Passes voice and mutes background sounds Background signal bypass Wake Word Detection (WWD) command to activate transparent voice bypass Speech/command intelligibility in noisy spaces Increases voice command intelligibility for WWD/KWS (Keyword Spotting) functionality in noisy environments for Smart Home, Smart Factory, Wearables, etc. Audio Interfaces PDM/I2S Voice delay detection 25 ms Host interfaces SPI/I2C used for initial configuration and status readout, VAD pin Debugging Boundary Scan and Debug unit access [...] The post NASP NeuroVoice VAD chip enables always-on voice activity detection at microwatt-level power consumption appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Radxa Dragon Q6A Arm SBC gets official Windows 11 preview",
    "link": "https://www.cnx-software.com/2025/12/18/radxa-dragon-q6a-arm-sbc-get-official-windows-11-preview/",
    "summary": "While most people use Linux on Arm SBCs, it s typically possible to run Windows 11 on Arm boards with UEFI support, but with caveats such as the GPU and VPU not working and other issues. One solution is to avoid the Arm architecture altogether and go with an x86 SBC like the Radxa X4, ODROID-H4+, or LattePanda IOTA, among others. But things may change for the better now that Qualcomm SBCs are becoming a thing, and Radxa has just announced official Windows support for the Radxa Dragon Q6A. Note that it is only a preview image for now. Nevertheless, here s what is working without installing additional drivers on Windows 11: HDMI output (inherited from UEFI GOP) PCIe Note: NVMe available; system does not include network card drivers eMMC flash UFS USB 2.0 USB 3.0, but devices must be connected before booting into the system But once you install drivers, [...] The post Radxa Dragon Q6A Arm SBC gets official Windows 11 preview appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Toradex Luna SL1680   A  Pro Consumer  Raspberry Pi lookalike based on Synaptics SL1680 Edge AI SoC",
    "link": "https://www.cnx-software.com/2025/12/18/toradex-luna-sl1680-a-pro-consumer-raspberry-pi-lookalike-based-on-synaptics-sl1680-edge-ai-soc/",
    "summary": "Toradex Luna SL1680 is a credit card-sized single board computer heavily inspired by the Raspberry Pi 5 design, but powered by a Synaptics SL1680 quad-core Cortex-A73 SoC suitable for Edge AI applications thanks to a built-in 7.9 TOPS NPU. Designed for pro consumer and light industrial Edge AI applications, the Luna SL1680 ships with up to 4GB RAM and 256GB eMMC flash, and offers many of the same ports as the Pi 5, including a Gigabit Ethernet RJ45 port with optional PoE support, four USB 3.0 ports, two micro HDMI ports (but one Tx, one Rx), MIPI DSI and CSI connectors, and a 40-pin GPIO header. The 16-pin PCIe FFC connector is gone, making way for an M.2 Key-E socket, mostly useful for adding wireless connectivity. Toradex Luna SL1680 specifications: SoC Synaptics SL1680 CPU Quad-core Arm Cortex-A73 processor @ 2.1 GHz GPU Imagination PowerVR Series9XE GE9920 GPU [...] The post Toradex Luna SL1680 A Pro Consumer Raspberry Pi lookalike based on Synaptics SL1680 Edge AI SoC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Fusion HAT+ Raspberry Pi expansion board targets motor and servo control with AI and LLMs",
    "link": "https://www.cnx-software.com/2025/12/17/fusion-hat-raspberry-pi-expansion-board-targets-motor-and-servo-control-with-ai-and-llms/",
    "summary": "SunFounder Fusion HAT+ for Raspberry Pi 5/4/3B+ and Zero single board computers is a motor control and GPIO expansion board designed to work with LLMs such as ChatGPT or Gemini using the board s built-in speaker and microphone for voice interaction. It features four DC motor drivers, twelve PWM servo channels, four ADC inputs, I2C, SPI, and UART interface for sensors, and ships with two 18650 rechargeable batteries with smart power management & safe shutdown. It can be used in smart cars, humanoid robots, robotic arms, multi-legged spiders, and smart home systems. Fusion HAT+ specifications: MCU Gigadevices GD32E203C8T6 Arm Cortex-M23 microcontroller @ 72MHz with 64KB flash, 8KB SRAM. Motor control 4x motor ports Audio 2030 audio chamber speaker connected to an I2S audio port MEMS microphone Expansion 4-channel digital pins 4-pin I2C interface compatible with Qwiic/STEMMA Qt 7-pin SPI interface 4-pin UART interface 12-channel PWM pins for servos 4-channel [...] The post Fusion HAT+ Raspberry Pi expansion board targets motor and servo control with AI and LLMs appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Compact development board features a single ESP32-P4 + ESP32-C5 dual-band Wi-Fi 6 module, MIPI display and camera interfaces",
    "link": "https://www.cnx-software.com/2025/12/17/compact-development-board-features-a-single-esp32-p4-esp32-c5-dual-band-wi-fi-6-module-mipi-display-and-camera-interfaces/",
    "summary": "Just a few months back, Wireless-Tag released the WT99P4C5-S1, which combines the ESP32-P4 with an ESP32-C5 dual-band WiFi 6 module, instead of the more commonly used ESP32-C6 wireless module found on most ESP32-P4 development boards we ve covered. The company has now released the WTDKP4C5-S1, a more compact development board built around the WT01P4C5-S1 ESP32-P4 and ESP32-C5 core module. The board supports MIPI-CSI and MIPI-DSI through the ESP32-P4, while the SDIO-connected ESP32-C5 provides dual-band Wi-Fi 6 (2.4/5 GHz) connectivity along with BLE 5, Zigbee, Thread, and Matter. Other features include a USB 2.0 Type-C OTG port, two UART debug interfaces, two 40-pin GPIO breakouts from both chips, and various power options via USB-C, a 12V DC input, or headers. The board is suitable for LVGL-based HMIs, data acquisition, industrial control, and Edge AI applications such as IPCs and smart displays. Wireless Tag WTDKP4C5-S1 specifications: Core module Wireless Tag WT01P4C5-S1 Main [...] The post Compact development board features a single ESP32-P4 + ESP32-C5 dual-band Wi-Fi 6 module, MIPI display and camera interfaces appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Maxell PSB2032 35 mAh all-solid-state coin cell battery targets industrial IoT devices",
    "link": "https://www.cnx-software.com/2025/12/17/maxell-psb2032-35-mah-all-solid-state-coin-cell-battery-targets-industrial-iot-devices/",
    "summary": "Maxell PSB2032 is a rechargeable all-solid-state coin cell battery for industrial IoT devices, which more than quadruples the capacity of the earlier PSB401010H ceramic-packaged solid-state battery, increasing it from 8mAh to 35mAh. As its name implies, it measures 20 mm in diameter and 3.2 mm in height, and delivers key benefits of solid-state batteries such as a wide discharge temperature range, high reliability, and high safety. It s also easier to install than ceramic-packaged batteries requiring reflow soldering, since it comes pre-equipped with two connection terminals suitable for mounting into small-sized devices. The company shared a comparison table between its two solid-state batteries. For reference, the capacity of a typical CR2032 battery is 220 240 mAh, so the PSB2032 has a much lower capacity. However, it can be recharged and works in demanding environments with a wide temperature range and high safety requirements. The last time we wrote about solid-state batteries was [...] The post Maxell PSB2032 35 mAh all-solid-state coin cell battery targets industrial IoT devices appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "MicroPython v1.27 adds support for ESP32-C5, ESP32-P4, and STM32U5 microcontrollers",
    "link": "https://www.cnx-software.com/2025/12/16/micropython-v1-27-adds-support-for-esp32-c5-esp32-p4-and-stm32u5-microcontrollers/",
    "summary": "MicroPython is one of the most popular firmware for microcontrollers due to its ease of use. The MicroPython v1.27 release adds support for some interesting microcontrollers, namely Espressif Systems ESP32-C5 and ESP32-P4, thanks to an update to the ESP-IDF v5.5.1 framework, as well as STMicroelectronics STM32U5, and features a range of other changes. These include improvements to the test suite to cater to the increasing number of supported hardware platforms, the introduction of tier levels for different hardware platforms, various optimizations and bug fixes, updated libraries, new ESP32 and STM32 boards, and more. The last time we reported on a MicroPython release was for v1.24, which added support for Raspberry Pi RP2350 and ESP32-C6 microcontrollers. Other MicroPython v1.27 highlights: Test suite improvements Auto-detecting if the target has Unicode support Automatically including float tests when possible Always including stress tests Improving the skipping of tests that use slice and the [...] The post MicroPython v1.27 adds support for ESP32-C5, ESP32-P4, and STM32U5 microcontrollers appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "HealthyPi 6   A portable Wi-Fi 6 biosignal acquisition device with ECG, PPG, respiration, and temperature sensors (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/16/healthypi-6-portable-wi-fi-6-biosignal-acquisition-device-with-ecg-ppg-respiration-and-temperature-sensors/",
    "summary": "Designed by ProtoCentral Electronics in India, the HealthyPi 6 is an open-source, portable, research-grade biosignal acquisition device designed for academic research, education, and prototyping. It targets labs, classrooms, and field studies that need professional-quality physiological measurements without bulky desktop systems or proprietary lock-in. Building on the HealthyPi 5 (2023) and HealthyPi 4 (2019), the HealthyPi 6 is a standalone device with 3-channel/5-lead ECG, dual-wavelength PPG for heart rate and SpO , respiration via impedance pneumography, skin temperature sensing, and a 9-axis IMU for motion and artifact detection. Built around the STM32H757 real-time microcontroller and an ESP32-C6 handling Wi-Fi 6 and BLE connectivity, the device features a USB-C port, onboard flash and microSD storage, and 48+ hours of operation on a charge. Modular HealthyLink ports allow for EEG, EMG, GSR, additional analog inputs, triggers, and co-processors expansion. These features make it suitable for cardiovascular and sleep research, rehabilitation studies, wearable prototyping, biosignal [...] The post HealthyPi 6 A portable Wi-Fi 6 biosignal acquisition device with ECG, PPG, respiration, and temperature sensors (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "VEGA AS2161  DHRUV64    A 1GHz dual-core 64-bit RISC-V microprocessor designed in India",
    "link": "https://www.cnx-software.com/2025/12/16/vega-as2161-dhruv64-a-1ghz-dual-core-64-bit-risc-v-microprocessor-designed-in-india/",
    "summary": "The Government of India has been investing to spur up its semiconductor design and manufacturing industry at least since 2018/2019 with the SHAKTI and AJIT microprocessors. In 2022, they decided to focus on the RISC-V architecture with the VEGA processor family, starting with the THEJAS32 (VEGA ET1031) and THEJAS64 (VEGA AS1061) microprocessors, and the former was eventually found in the ARIES v3.0 Arduino UNO-inspired development board. Things continue to progress nicely, albeit slowly, and the government has now announced the launch of the DHRUV64 (VEGA AS2161) dual-core 64-bit RISC-V MPU clocked at 1 GHz and supporting Linux, which it describes as a fully indigenous microprocessor developed by the Centre for Development of Advanced Computing (C-DAC) under the Microprocessor Development Programme (MDP) . VEGA AS2161 (DHRUV64) specifications highlights: Architecture RISC-V 64G (RV64IMAFD) Instruction Set 13-16 stage out-of-order pipeline implementation. Advanced branch predictor BTB, BHT, RAS. Harvard architecture, separate Instruction and [...] The post VEGA AS2161 DHRUV64 A 1GHz dual-core 64-bit RISC-V microprocessor designed in India appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Luckfox Aura   A Raspberry Pi-like Linux SBC powered by Rockchip RV1126B SoC with 3 TOPS NPU",
    "link": "https://www.cnx-software.com/2025/12/16/luckfox-aura-a-raspberry-pi-like-linux-sbc-powered-by-rockchip-rv1126b-soc-with-3-tops-npu/",
    "summary": "The Luckfox Aura is a compact, high-performance Linux SBC built around Rockchip s RV1126B quad-core Arm Cortex-A53 processor with a 3 TOPS NPU and designed for AI vision, multimedia processing, and edge computing Applications. Aura board supports up to 4 GB LPDDR4X memory and up to 64 GB of optional eMMC storage. Camera and display options include two 4-lane MIPI CSI camera inputs, a 4-lane MIPI DSI display interface up to 1080p60, and an AI-enhanced ISP with HDR, noise reduction, dehazing, and image correction features. The board also features Gigabit Ethernet with PoE support, onboard dual-band Wi-Fi 6 and Bluetooth 5.4/BLE, USB 3.0 OTG, four USB 2.0 host ports, a 40-pin GPIO header compatible with some Raspberry Pi HATs, audio I/O, an RTC, and a microSD card slot. Luckfox Aura specifications: SoC Rockchip RV1126B quad-core Cortex-A53 SoC CPU Quad-core Arm Cortex-A53 up to 1.6 GHz with 32KB L1 I-Cache and [...] The post Luckfox Aura A Raspberry Pi-like Linux SBC powered by Rockchip RV1126B SoC with 3 TOPS NPU appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "The ESP Private Agents platform aims to ease the development of ESP32-based AI voice assistants with on-device processing",
    "link": "https://www.cnx-software.com/2025/12/15/the-esp-private-agents-platform-aims-to-ease-the-development-of-esp32-based-ai-assistants-with-on-device-processing/",
    "summary": "Espressif has just introduced the ESP Private Agents platform to help developers build local, private, and customizable AI assistants for ESP32 devices running on-device, although they can also support hybrid AI workloads with a mix of on-device and cloud processing. The ESP Private Agents platform offers a unified framework that allows developers to build applications combining speed, vision, automation, and agent-based interactions, for example, a multi-lingual, on-device voice agent (aka smart speaker) or task-oriented agents that automate workflows. The solution is built on AWS cloud services using AWS Fargate as a primary application platform and Amazon Bedrock Foundation Models as backend LLM systems. It not only works with ESP32-power devices with speaker and microphone, but also with mobile apps and web clients. Espressif released a Web-based demo, which you can use as a text-based chatbot or as a voice assistant leveraging the speaker and microphone on your computer. The company [...] The post The ESP Private Agents platform aims to ease the development of ESP32-based AI voice assistants with on-device processing appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "tinySA is a low-cost handheld spectrum analyzer with built-in signal generator",
    "link": "https://www.cnx-software.com/2025/12/15/tinysa-is-a-low-cost-handheld-spectrum-analyzer-with-built-in-signal-generator/",
    "summary": "The tinySA is a compact, low-cost handheld spectrum analyzer and RF signal generator designed for hobbyists, radio amateurs, educators, and engineers. It comes in three different variants and can be used for RF debugging, signal inspection, interference hunting, filter testing, antenna-related measurements, and basic RF education, both in the field and on the bench. The product line includes the tinySA Basic, tinySA Ultra, and tinySA Ultra+, which mainly differ in their supported frequency ranges and performance. The tinySA Basic supports 100 kHz to 350 MHz on its low input and up to about 960 MHz on the high input, while the Ultra and Ultra+ models can observe signals up to 12GHz. The devices run from an internal rechargeable battery with USB-C charging, support firmware updates, internal self-test and calibration routines, marker and peak detection, configurable frequency span and amplitude settings, and PC control over USB. Input protection limits are specified at +10 [...] The post tinySA is a low-cost handheld spectrum analyzer with built-in signal generator appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Calixto Systems SL1680 OPTIMA industrial SoM and EVK features Synaptics SL1680 Edge AI processor",
    "link": "https://www.cnx-software.com/2025/12/15/calixto-systems-sl1680-optima-industrial-som-and-evk-features-synaptics-sl1680-edge-ai-processor/",
    "summary": "Calixto Systems has recently introduced the SL1680 OPTIMA, an industrial SoM built around the Synaptics SL1680 quad-core Arm Cortex-A73 SoC with a 7.9+ TOPS secure NPU for Edge AI and advanced multimedia applications. They also announced an evaluation kit (EVK) for rapid product development. The SoM offers up to 4GB LPDDR4 RAM, up to 16GB eMMC flash, an onboard Gigabit Ethernet PHY, and a wide range of interfaces through compact Hirose connectors, including dual MIPI CSI camera inputs, MIPI DSI, HDMI 2.1 Tx/Rx, PCIe 2.0, USB 3.0/2.0, SDIO, RS485, CAN-FD, and various GPIOs. The EVK further expands connectivity with MikroBUS, display and camera interfaces, and industrial I/O, making the platform suitable for AI-enabled vision systems, smart HMIs, automation equipment, and other edge computing applications. SL1680 OPTIMA SoM specifications SoC Synaptics SL1680 (Astra Series) CPU Quad-core Arm Cortex-A73 processor @ 2.1 GHz GPU Imagination PowerVR Series9XE GE9920 GPU with [...] The post Calixto Systems SL1680 OPTIMA industrial SoM and EVK features Synaptics SL1680 Edge AI processor appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "reTerminal E1001/E1002 Review   B&W and color ePaper displays tested with SenseCraft HMI and Home Assistant",
    "link": "https://www.cnx-software.com/2025/12/15/reterminal-e1001-e1002-review-bw-and-color-epaper-displays-tested-with-sensecraft-hmi-and-home-assistant/",
    "summary": "Seeed Studio sent us samples of the reTerminal E1001 (monochrome) and E1002 (color) ePaper displays for review. They are powered by an ESP32-S3 microcontroller providing WiFi and Bluetooth LE wireless connectivity, and are designed for low-power information display applications, consuming power only when updating the screen content. This makes them ideal for tasks requiring long battery life (average of 3 months per charge, depending on how often they are updated) and always-on display capabilities. In this review, we will unbox the devices, go through a teardown, and test them with Seeed Studio s SenseCraft no-code HMI platform, as well as ESPHome firmware for Home Assistant integration. reTerminal E1001/E1002 unboxing We received two cardboard packages that look identical and are labeled Seeed Studio reTerminal ePaper Display . But the sticker on the bottom side of the boxes provides clarity Inside each box, we ll find the ePaper display, a USB Type-C cable, a display [...] The post reTerminal E1001/E1002 Review B&W and color ePaper displays tested with SenseCraft HMI and Home Assistant appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Luxonis OAK4 standalone AI vision camera features Qualcomm QCS8550 SoC with up to 52 TOPS performance",
    "link": "https://www.cnx-software.com/2025/12/15/luxonis-oak4-standalone-ai-vision-camera-features-qualcomm-qcs8550-soc-with-up-to-52-tops-performance/",
    "summary": "Luxonis OAK 4 is a standalone AI vision system/camera powered by a Qualcomm DragonWing QCS8550 platform delivering up to 52 TOPS of AI performance for on-device real-time perception without relying on a host computer. Four variants are offered: OAK 4 S, OAK 4 D, OAK 4 D Pro, and OAK 4 CS. All four feature 8GB of RAM, 128GB of storage, and a 48 MP RGB camera sensor with rolling shutter, although the OAK 4 CS model can feature a 5MP global shutter camera thanks to support for wappable lenses. Depth sensing is implemented through an OV9282 sensor in the OAK 4 D and OAK 4 D Pro (dual camera) models, and the latter also adds a laser dot projector to improve depth perception. Luxonis OAK 4 specifications: SoC Qualcomm DragonWing QCS8550 CPU 1x GoldPlus core @ 3.2 GHz + 4x Gold cores @ 2.8 GHz + 3x [...] The post Luxonis OAK4 standalone AI vision camera features Qualcomm QCS8550 SoC with up to 52 TOPS performance appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "UP Xtreme ARL AI Dev Kit review   Benchmarks and AI workloads on an Intel Core Ultra 5 225H Arrow Lake SBC",
    "link": "https://www.cnx-software.com/2025/12/14/up-xtreme-arl-ai-dev-kit-review-benchmarks-and-ai-workloads-on-an-intel-core-ultra-5-225h-arrow-lake-sbc/",
    "summary": "That s the last part of my review of three Intel-based UP AI development kits, and after testing the UP TWL AI Dev Kit with an Intel N150 CPU and the UP Squared Pro TWL AI Dev Kit with an Intel N150 CPU coupled with an Hailo-8L M.2 AI accelerator, I ll now report my experience with the high-end UP Xtreme ARL AI Dev Kit with a 14-core Intel Core Ultra 5 225H Arrow Lake single board computer with Intel Arc 130T graphics delivering up to a combined 83 TOPS of AI performance. I ve followed the same procedure as with the previous models, using the pre-installed Ubuntu 24.04 Pro operating system to report system information, run some benchmarks, and go through AI workloads using Nx Meta and the AAEON UP AI Toolkit system. It just ran additional benchmarks and tests since it s my first Intel Arrow Lake platform. UP Xtreme ARL system [...] The post UP Xtreme ARL AI Dev Kit review Benchmarks and AI workloads on an Intel Core Ultra 5 225H Arrow Lake SBC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "CIX releases P1 CPU TRM and developer guides for GPU, AI accelerator, OS and firmware/BIOS",
    "link": "https://www.cnx-software.com/2025/12/13/cix-releases-p1-cpu-trm-and-developer-guides-for-gpu-ai-accelerator-os-and-firmware-bios/",
    "summary": "CIX has finally released the technical reference manual (TRM) for the P1 (CD8180/CD8160) Arm Cortex-A720/A520 SoC, along with developer guides for the GPU (Arm Immortalis G720 and NVIDIA/AMD discrete graphics cards), the AI accelerator, as well as OS (Android, Linux, and Windows) and firmware (BIOS) installation and development. A slow (but steady?) progress There was a lot of excitement when the Radxa Orion O6 mini-ITX motherboard was introduced in December 2024, as we were told the CIX P1 12-core Armv9 processor would offer performance similar to Apple M1 SoC and Qualcomm 8cx Gen3 platform, at an affordable price ($199 and up for the mini-ITX board), and software support would include a Debian image, full UEFI via an open-source EDKII implementation, as well as an SDK along with hardware and software documentation, community forum support, and regular firmware & OS updates. CIX was even called a native open source ecosystem chip [...] The post CIX releases P1 CPU TRM and developer guides for GPU, AI accelerator, OS and firmware/BIOS appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Diptyx E-Reader   An open-source, ESP32-powered, dual-screen e-book reader (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/12/diptyx-e-reader-an-open-source-esp32-powered-dual-screen-e-book-reader/",
    "summary": "There are plenty of e-book readers on the market, but the Diptyx E-Reader feels more like a proper book since it features two e-paper displays that can be folded or opened thanks to a custom-made plastic enclosure. While it s powered by an ESP32-S3 wireless module with a PCB antenna, both WiFi and Bluetooth are disabled in the firmware, and instead, users can load EPUB files through the reader s USB Type-C port. The combination of an automatic standby mode (using deep sleep) and e-ink displays enables the dual-screen device to run for weeks on a single charge. Two buttons are used to access the next or previous page, and a third one powers the device up in a few seconds. Diptyx E-Reader specifications: Wireless module ESP32-S3-WROOM-1 SoC Espressif Systems ESP32-S3-N16R8 CPU ESP32-S3 dual-core LX7 microprocessor @ up to 240 MHz with Vector extension Memory 8MB PSRAM Storage [...] The post Diptyx E-Reader An open-source, ESP32-powered, dual-screen e-book reader (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Renesas RA6W1/RA6W2 Cortex-M33 wireless MCUs offer dual-band Wi-Fi 6, BLE, Matter, 15-year availability",
    "link": "https://www.cnx-software.com/2025/12/12/renesas-ra6w1-ra6w2-cortex-m33-wireless-mcus-offer-dual-band-wi-fi-6-ble-matter-15-year-availability/",
    "summary": "Renesas has added the RA6W1 (Wi-Fi 6) and the RA6W2 (Wi-Fi 6 + BLE) MCUs to its high-performance RA6 family, adding dual-band Wi-Fi 6 and Bluetooth LE, as well as Matter connectivity to the series. Both models feature a 160 MHz Arm Cortex-M33 core, dual-band Wi-Fi 6 with WPA3 security, on-chip PA/LNA/RF switch, and a full TCP/IP stack for fast connectivity. They integrate up to 704 KB SRAM, 256 KB ROM, and support eMMC/SD, O-QSPI, and QSPI for external flash and/or PSRAM. The series also includes generic peripherals like SPI, I C, I S/PDM, SDIO, 12-bit ADCs, PWM timers, and up to 28 GPIOs. Offered in compact QFN/WLCSP packages, the RA6W1/2 MCUs target smart home, wearables, industrial, and consumer IoT markets where long battery life and wireless connectivity are essential. Renesas RA6W1 specifications: MCU core Arm Cortex-M33 @ up to 160 MHz, Armv8-M architecture with MPU and SysTick Memory & Storage [...] The post Renesas RA6W1/RA6W2 Cortex-M33 wireless MCUs offer dual-band Wi-Fi 6, BLE, Matter, 15-year availability appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "nRF9151 SMA DK development kit offers cellular IoT, DECT NR+, and 5G NTN satellite connectivity",
    "link": "https://www.cnx-software.com/2025/12/12/nrf9151-sma-dk-development-kit-offers-cellular-iot-dect-nr-and-5g-ntn-satellite-connectivity/",
    "summary": "Nordic Semiconductor s nRF9151 SMA DK development kit is designed for building IoT applications using LTE-M/NB-IoT cellular IoT, DECT NR+, or 5G NTN (Non-Terrestrial Network) satellite connectivity. The development kit offers three ways to connect a SIM card, namely a NanoSIM card slot, an MFF2 SIM footprint for eSIM or software iSIM, and a 10-pin SIM connector. It also includes two SMA connectors for GPS and LTE antennas or lab equipment, multiple current measurement connectors, and Arduino UNO headers for expansion, notably the nRF7002 EK for adding Wi-Fi 6 locationing capabilities. nRF9151-SMA-DK specifications: Wireless System-in-Package Nordic Semi nRF9151 CPU Arm Cortex-M33 @ 64 MHz Memory 256KB RAM Storage 1MB flash Connectivity Multimode LTE-M/NB-IoT/NB-NTN modem with DECT NR+ support and GNSS. 700-2200 MHz LTE band support. Power Class 5 20 dBm Power Class 3 23 dBm 1.9 GHz and 915 Mhz DECT NR+ band support Security Arm [...] The post nRF9151 SMA DK development kit offers cellular IoT, DECT NR+, and 5G NTN satellite connectivity appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "UP Squared Pro TWL AI Dev Kit Review   Intel N150 + Hailo-8L accelerator tested on Ubuntu 24.04",
    "link": "https://www.cnx-software.com/2025/12/11/up-squared-pro-twl-ai-dev-kit-review-intel-n150-hailo-8l-accelerator-tested-on-ubuntu-24-04/",
    "summary": "I ve been asked to review three Intel-based UP AI development kits running Ubuntu 24.04 Pro. Last time, I tested the UP TWL SBC with Nx Meta and UP AI Toolkit, and most AI workloads would pass, but since these were running on the Intel N150 CPU or GPU, the performance was not optimal for most. I ll now switch to the UP Squared Pro TWL mid-range AI devkit review with another Intel Processor N150 SBC fitted with a 13 TOPS Hailo-8L M.2 AI accelerator. Both the UP TWL and UP Squared Pro TWL come with a 64GB eMMC flash, and I found out it was rather tight since AI software and models can take a lot of space. The UP Squared Pro TWL has a few M.2 sockets, so I ll install an NVMe SSD to expand storage before installing the UP AI toolkit. As usual, I ll run a few benchmarks and [...] The post UP Squared Pro TWL AI Dev Kit Review Intel N150 + Hailo-8L accelerator tested on Ubuntu 24.04 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Up to 16-core AMD EPYC Embedded 2005 Series Zen 5 processors support up 28 PCIe Gen5 lanes, offer 10-year availability",
    "link": "https://www.cnx-software.com/2025/12/11/up-to-16-core-amd-epyc-embedded-2005-series-zen-5-processors-support-up-28-pcie-gen5-lanes-offer-10-year-availability/",
    "summary": "After the release of the high-performance EPYC Embedded 9005, AMD has now introduced the EPYC Embedded 2005 Series, a mid-range processor family also based on the Zen 5 architecture and designed for space-constrained networking, storage, and industrial edge applications. The new SoCs feature up to 16 cores (32 threads) with 64 MB L3 cache, support dual-channel DDR5-5600 memory with ECC, and offer 28 lanes of PCIe Gen5 connectivity. It also supports advanced RAS capabilities, BMC, PCIe Hot Plug, multi-SPI ROM, and AMD Infinity Guard security. The processors come in a compact 40 x 40mm BGA package, which, according to AMD, is up to 2.4x smaller than competing enterprise solutions (Intel Xeon 6500P-B). Yet, they are designed for 24/7 operation, with up to 10 years of availability with full open-source software support. These features make it suitable for networking switches/routers, cold storage systems, aerospace, robotics, and other high-reliability embedded infrastructure. EPYC [...] The post Up to 16-core AMD EPYC Embedded 2005 Series Zen 5 processors support up 28 PCIe Gen5 lanes, offer 10-year availability appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "iWave Systems iG-RainboW-G69M TI AM62L OSM Size-S system-on-module powers Raspberry Pi-sized SBC",
    "link": "https://www.cnx-software.com/2025/12/11/iwave-systems-ig-rainbow-g69m-ti-am62l-osm-size-s-system-on-module-powers-raspberry-pi-sized-sbc/",
    "summary": "Yesterday, I wrote about the Beacon AM62L SoM, one of the first system-on-module based on Texas Instruments AM62L dual-core Cortex-A53 SoC for low-power IoT and HMI applications. It turns out there s another AM62L module compliant with the OSM Size-S standard, along with a Raspberry Pi-sized carrier board. iWave Systems iG-RainboW-G69M is a 30x30mm CPU module with 1GB or 2GB LPDDR4, 8GB eMMC flash by default, and 332 LGA contacts exposing interfaces such as RGB LCD and MIPI CSI display interfaces, dual gigabit Ethernet, I2S audio, USB 2.0 interfaces, and a range of low-speed I/Os. iWave Systems iG-RainboW-G69M specifications: SoC Texas Instruments AM62Lx CPU Dual-core Arm Cortex-A53 processor up to 1.25GHz Cache 32KB L1 D-cache, 32KB L1 I-cache per core; shared 256KB L2 cache System Memory 1GB LPDDR4, expandable up to 2GB Storage 8GB eMMC flash (other capacities available upon request) 32Kbit EPPROM 332 LGA contacts Storage [...] The post iWave Systems iG-RainboW-G69M TI AM62L OSM Size-S system-on-module powers Raspberry Pi-sized SBC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "IoT HDMI switch   An ESP32-C3-powered 2-source HDMI switch automated with Home Assistant",
    "link": "https://www.cnx-software.com/2025/12/11/iot-hdmi-switch-an-esp32-c3-powered-2-source-hdmi-switch-automated-with-home-assistant/",
    "summary": "Designed by Guimpt in Spain, the IoT HDMI Switch is an ESP32-C3-based open-source HDMI switch that integrates with Home Assistant and ESPHome to automate up to two HDMI inputs for TVs, monitors, or projectors. It targets smart home setups that need seamless source switching without manually handling cables. It includes a 3D-printed enclosure for a compact install behind media equipment. The device also offers open hardware and firmware for easy upgrade, and it lets users switch inputs via phone, voice assistant, or a button. It also supports automations such as automatically selecting a game console or media player. It works with common HDMI devices like Chromecast, Raspberry Pi, PCs, and consoles, making it ideal for smart home enthusiasts, DIY tinkerers, and anyone who wants a hands-free media setup. IoT HDMI Switch specifications: SoC Espressif Systems ESP32-C3FH4 Single-core 32-bit RISC-V microcontroller @ up to 160 MHz Memory 400 KB [...] The post IoT HDMI switch An ESP32-C3-powered 2-source HDMI switch automated with Home Assistant appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "AMD Ryzen Embedded 8840U COM Express Type 6 Compact module takes up to 128GB DDR5",
    "link": "https://www.cnx-software.com/2025/12/10/amd-ryzen-embedded-8840u-com-express-type-6-compact-module-takes-up-to-128gb-ddr5/",
    "summary": "SolidRun has unveiled a new COM Express Type 6 Compact module powered by the AMD Ryzen Embedded 8840U Series with up to 39 TOPS of AI performance for industrial, medical, automation, and edge AI applications. The module supports up to 128GB DDR5 of memory via two SO-DIMM sockets, on-module M.2 NVME SSD storage, and features an Intel i226 2.5GbE controller. It exposes I/Os through standard board-to-board connectors, including 16-lane PCIe Gen4, four DisplayPort video outputs, eDP or LVDS display interface, two SATA, various USB ports, and more. Ryzen R8000 CoM6 specifications: SoC AMD Ryzen Embedded 8840U CPU 8-core/16-thread Zen4 processor up to 3.3 GHz / 5.1 GHz (Turbo) GPU AMD Radeon 780M with 12x Compute Units @ 2700 MHz (RDNA3 graphics) AI 16 TOPS NPU (AMD XDNA) Total combined 39 TOPS of AI performance Memory 2x SODIMM DDR5-5600 with/without ECC up to 128GB RAM Storage [...] The post AMD Ryzen Embedded 8840U COM Express Type 6 Compact module takes up to 128GB DDR5 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "STEVAL-ROBKIT1   A robot evaluation kit based on STM32H725 and STM32G0 microcontrollers",
    "link": "https://www.cnx-software.com/2025/12/10/steval-robkit1-a-robot-evaluation-kit-based-on-stm32h725-and-stm32g0-microcontrollers/",
    "summary": "The STEVAL-ROBKIT1 is an evaluation kit for robotics applications based on ST s STM32H725 and STM32G0 Arm microcontrollers. It s the first such robot kit from the company, and it targets both traditional engineering teams, educators, and students. The kit features an STM32H725 main board, an STM32G0 motor-control PCB, and a 1.53MP camera + ToF sensor module, as well as a robotic frame, wheels, and motors with encoders. It does not require a soldering iron for assembly to make it easier for students. STEVAL-ROBKIT1 key components and features: Main board STEVAL-ROBKIT1-1 SoC STMicro STM32H725IGT6 Arm Cortex-M7 microcontroller @ 550 MHz with 1MB flash, 564 KB SRAM with ECC Wireless BlueNRG-M2 Bluetooth LE 5.2 SoC Sensors 6-axis IMU (LSM6DSV16BX) Magnetometer (LIS2MDL) Microphone (MP34DT06J) Expansion 40-pin Raspberry Pi-like header Motor control board STEVAL-ROBKIT1-2 SoC STMicro STM32G071CBT6 Arm Cortex-M0+ microcontroller at 64 MHz with 128 KB flash, 36KB SRAM Motor [...] The post STEVAL-ROBKIT1 A robot evaluation kit based on STM32H725 and STM32G0 microcontrollers appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "52Pi UPS Gen 6 UPS for Raspberry Pi 4/5 supports up to 4x external battery packs, PikaPython scripting",
    "link": "https://www.cnx-software.com/2025/12/10/52pi-ups-gen-6-ups-raspberry-pi-hat-supports-up-to-4x-external-battery-packs-pikapython-scripting/",
    "summary": "The 52Pi UPS Gen 6 is another UPS solution for the Raspberry Pi 5 that supports external battery packs for long-duration projects, and uses I C plus PikaPython scripting to manage power settings and safe shutdowns. Designed for the Raspberry Pi 5 and 4B, the module mounts on the bottom of the board and delivers power via pogo pins. It also includes an aluminum heatsink with an automatic fan for cooling. It runs on two 18650 batteries, which can be mounted to the Pi with spacers, and there is an option to add three more battery packs in parallel if you need longer runtime. The board also features a physical power button for manual control, a 12V power interface for SATA hard drives, and switching hardware (bumpless power transfer) that instantly falls back to battery power so the system stays on during a power outage. 52Pi UPS Gen 6 specifications: Main [...] The post 52Pi UPS Gen 6 UPS for Raspberry Pi 4/5 supports up to 4x external battery packs, PikaPython scripting appeared first on CNX Software - Embedded Systems News ."
  }
]