[
  {
    "title": "Clean-sheet open source 8-bit gaming console surprisingly preparing for launch in 2025   the GameTank uses twin 6502 processors instead of FPGAs or microcontrollers",
    "link": "https://www.tomshardware.com/video-games/retro-gaming/clean-sheet-open-source-8-bit-console-surprisingly-preparing-for-launch-in-2025-the-gametank-uses-twin-6502-processors-instead-of-fpgas-or-microcontrollers",
    "summary": "There s a new open source contender being prepared for the 8-bit console arena."
  },
  {
    "title": "Corsair Sabre v2 Pro review: 36g but maybe too lightweight on features",
    "link": "https://www.tomshardware.com/peripherals/gaming-mice/corsair-sabre-v2-pro-review",
    "summary": "The Corsair Sabre v2 Pro is an incredibly lightweight (36g) mouse that feels good and glides like a dream. But the software is web-based and that's a problem when your mouse has no profile or DPI switch buttons."
  },
  {
    "title": "The world's  tiniest GPU  heads to production   200,000-transistor TinyGPU v2.0 can render gamepad-manipulated 3D images with up to 1K triangles in real-time",
    "link": "https://www.tomshardware.com/pc-components/gpus/the-worlds-tiniest-gpu-heads-to-production-200-000-200-000-transistor-tinygpu-v2-0-can-render-gamepad-manipulated-3d-images-with-up-to-1k-triangles-in-real-time",
    "summary": "The tiniest GPU has gotten a big update with the new TinyGPU v2.0 offering interactive 3D rasterization, with transformation & lighting tech."
  },
  {
    "title": "Hard drives on backorder for two years as AI data centers trigger HDD shortage   delays forcing rapid transition to QLC SSDs",
    "link": "https://www.tomshardware.com/pc-components/hdds/ai-triggers-hard-drive-shortage-amidst-dram-squeeze-enterprise-hard-drives-on-backorder-by-2-years-as-hyperscalers-switch-to-qlc-ssds",
    "summary": "Artificial intelligence has taken yet another victim. After GPUs and memory, storage is now facing a shortage as well, at least in the enterprise space. Production capacity for nearline storage, fueled by high-capacity server HDDs, is booked for the next two years. Cloud providers are switching to QLC NAND to avoid the lead times."
  },
  {
    "title": "No Longer Evil Thermostat hack strips Google from Nest thermostat to heat your home better   open source project revives sunsetted hardware, gives more precise control",
    "link": "https://www.tomshardware.com/software/no-longer-evil-thermostat-heats-your-home-better-by-removing-google-revive-sunsetted-hardware-gain-more-precise-control-open-source",
    "summary": "Google s sunsetted Nest Gen 1 and Gen 2 thermostats have been given a new breath of life by a frustrated developer's No Longer Evil Thermostat firmware."
  },
  {
    "title": "Laid-off Intel employee allegedly steals 'Top Secret' files, then disappears   ex-engineer downloaded 18,000 files before vanishing",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/laid-off-intel-employee-allegedly-steals-top-secret-files-goes-on-the-run-ex-engineer-downloaded-18-000-files-before-disappearing",
    "summary": "A former Intel software engineer who spent over a decade with the company allegedly stole several thousand documents, including confidential ones, after he was laid off."
  },
  {
    "title": "DIY Amiga sound sampler circuit mystery solved 32 years later   Magazine instructions had key component spec typos",
    "link": "https://www.tomshardware.com/pc-components/sound-cards/diy-amiga-sound-sampler-circuit-mystery-solved-32-years-later-magazine-instructions-had-key-component-spec-typos",
    "summary": "A three-decade old 'Amiga mystery' has been solved by an intrepid electronics-focused TechTuber."
  },
  {
    "title": "500 disposable vapes recycled into a powerwall to power a house and workshop   enough juice for up to eight hours of home usage or three days of work",
    "link": "https://www.tomshardware.com/tech-industry/500-disposable-vapes-recycled-into-a-powerwall-to-power-a-house-and-workshop-enough-juice-for-up-to-eight-hours-of-home-usage-or-three-days-of-work",
    "summary": "By salvaging rechargeable batteries from thousands of used disposable vapes, UK-based YouTuber Chris Doel built a 50V power system that can run his workshop and home."
  },
  {
    "title": "This week in 1982, Compaq announced the first true IBM PC clone   it was portable, too, as long as you were comfortable lugging 28 pounds",
    "link": "https://www.tomshardware.com/desktops/pc-building/this-week-in-1982-compaq-announced-the-first-true-ibm-pc-clone-it-was-a-portable-too-as-long-as-you-were-comfortable-lugging-28-pounds",
    "summary": "Compaq took the wraps off its first product in November 1982, revealing the computing world's first true IBM PC clone, and an all-in-one portable model at that. It would take a year for IBM to respond."
  },
  {
    "title": "Corsair's premium SFF case sees a massive 70% price drop to $59   iCUE Link 2500X hits a new historic low",
    "link": "https://www.tomshardware.com/pc-components/pc-cases/corsairs-premium-sff-case-sees-a-massive-70-percent-price-drop-to-usd59-icue-link-2500x-hits-a-new-historic-low",
    "summary": "Featuring support for m-ATX and mini-ITX boards, up to 11 fans, and massive GPU clearance, Corsair s dual-chamber iCUE Link 2500X is finally priced to match its appeal."
  },
  {
    "title": "OpenAI asks U.S. to expand CHIPS Act tax credit to cover AI infrastructure despite firm's denial wanting a government 'backstop' for its massive loans",
    "link": "https://www.tomshardware.com/tech-industry/openai-asks-us-to-expand-chips-act-tax-credit-to-cover-ai-infrastructure",
    "summary": "OpenAI has asked the Trump administration to expand a major CHIPS Act tax credit to support the build-out of AI infrastructure, including servers, data centers, and power systems."
  },
  {
    "title": "Chipmaking industry pushes back on U.S. Patent Office considering imposing annual fee based on assessed value    tax on innovation  draws strong opposition from Semiconductor Industry Association",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/chipmaking-industry-pushes-back-on-u-s-patent-office-considering-imposing-annual-fee-based-on-assessed-value-tax-on-innovation-draws-strong-statement-from-semiconductor-industry-association",
    "summary": "A proposal to change the USPTO's fee structure from fixed rates to a percentage basis is facing resistance from the semiconductor industry."
  },
  {
    "title": "Japanese PC shops limit SSD, HDD, and RAM purchases to prevent hoarding as storage and memory shortage takes hold   buying a full PC unlocks higher purchase limits",
    "link": "https://www.tomshardware.com/pc-components/japanese-pc-shops-limit-ssd-hdd-and-ram-purchases-to-prevent-hoarding-as-storage-and-memory-shortage-takes-hold-buying-a-full-pc-unlocks-higher-purchase-limits",
    "summary": "The impact of the massive AI demand for storage and memory is now hitting retail stores in Japan."
  },
  {
    "title": "New DirectX7 emulation tool brings more games to Steam Deck, SteamOS, and other Linux distros through Vulkan, with caveats",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/new-directx7-emulation-tool-brings-more-games-to-steam-deck-steamos-and-other-linux-distros-through-vulkan-with-caveats",
    "summary": "An independent developer has taken on the job of creating a spin-off version of DXVK that works with DirectX 7 games, bringing DX7 to Linux through emulation with Vulkan."
  },
  {
    "title": "Investigators recover black boxes from UPS plane crash, detail data recovery process   NTSB successfully extracts cockpit audio from charred remains",
    "link": "https://www.tomshardware.com/tech-industry/investigators-recover-black-boxes-from-ups-plane-crash-detail-data-recovery-process-ntsb-successfully-extracts-cockpit-audio-from-charred-remains",
    "summary": "The NTSB has successfully recovered the cockpit audio from the ill-fated UPS 2967."
  },
  {
    "title": "Modern motherboard features explained: Connectors, headers, ports, and chipsets decoded",
    "link": "https://www.tomshardware.com/pc-components/motherboards/modern-motherboard-features-explained-connectors-headers-ports-and-chipsets-decoded",
    "summary": "Here is a diagram of major ports, headers, and slots common on today s motherboards, plus a guide to expansion slots, RAM and form factors."
  },
  {
    "title": "Retro PC Gaming the Easy Way with DOSBox Pure Unleashed",
    "link": "https://www.tomshardware.com/software/retro-pc-gaming-the-easy-way-with-dosbox-pure-unleashed",
    "summary": "Retro gaming is part hobby and part historical preservation, and DOSBox Pure Unleashed is here to help keep those old games alive, despite our aging reflexes being incapable of beating Tomb Raider 2 s Venice level."
  },
  {
    "title": "Gigabyte Aorus FO27Q5P 27-inch 500 Hz QD-OLED gaming monitor review: Superb in every respect",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/gigabyte-aorus-fo27q5p-27-inch-500-hz-qd-oled-gaming-monitor-review",
    "summary": "Gigabyte s Aorus line begets a stunning new OLED, the 27-inch FO27Q5P. With extra-wide gamut Quantum Dot color, QHD resolution, 500 Hz, Adaptive-Sync and HDR500, it delivers maximum performance and image quality."
  },
  {
    "title": "SanDisk reportedly jacks up flash prices by 50% as memory makers cash in on AI-fueled demand",
    "link": "https://www.tomshardware.com/pc-components/storage/sandisk-reportedly-jacks-up-flash-prices-by-50-percent-as-memory-makers-cash-in-on-ai-fueled-demand",
    "summary": "As AI datacenters scoop up limited wafer supply, both DRAM and flash prices skyrocket."
  },
  {
    "title": "Samsung teases radical new modular SSD design with swappable NAND and SSD controller that can be detached independently   tiny 4TB PCIe 5.0 M.2 drive is also ready",
    "link": "https://www.tomshardware.com/pc-components/ssds/samsung-teases-modular-ssd-with-swappable-nand-and-ssd-controller-compact-4tb-pcie-5-0-m-2-2242-drive-is-also-ready-to-deploy",
    "summary": "Samsung teases the AM9C1 E1.A Detachable AutoSSD and PM9E1 M.2 22x42 SSDs that will be revealed at CES 2026."
  },
  {
    "title": "AMD warns the Intel and Nvidia partnership is a risk to its business   quarterly report outlines risk from 'increased competition and pricing pressure'",
    "link": "https://www.tomshardware.com/tech-industry/amd-warns-intel-nvidia-partnership-is-a-business-risk-quarterly-report-outlines-risk-from-increased-competition-and-pricing-pressure",
    "summary": "AMD lists the Nvidia's $5 billion investment in Intel as a specific risk in its quarterly report."
  },
  {
    "title": "CPU collector peels the lid off a Soviet-era  fish can  chip to peer inside with multiple microscopes   K565RU3 was a Cold War-era clone of Western chips that powered Apple II, Commodore PET, and original IBM PC",
    "link": "https://www.tomshardware.com/pc-components/dram/cpu-collector-peels-the-lid-off-a-soviet-era-fish-can-chip-to-peer-inside-with-multiple-microscopes-k565ru3-was-a-soviet-era-clone-of-western-chips-like-the-intel-designed-4116",
    "summary": "A fascinating Soviet-era retro electronics artifact has been dissected and micrographed by a CPU collector."
  },
  {
    "title": "Radical gamer repurposes $1,700 ROG Astral RTX 5080 into a working DIY skateboard   rides graphics card down the street while walking dog",
    "link": "https://www.tomshardware.com/pc-components/gpus/radical-gamer-repurposes-usd1-700-rog-atral-rtx-5080-into-a-diy-skateboard-rides-graphics-card-down-the-street-while-walking-dog",
    "summary": "A user on the PC Master Race subreddit has turned a ROG Astral RTX 5080, one of the most expensive variants out there, into a real skateboard. The video shows the RTX 5080's cooler being used as a deck, with the user ripping through the streets, accompanied by their dog."
  },
  {
    "title": "Nvidia's RTX 5000 Super could be cancelled or get pricier due to AI-induced GDDR7 woes   rumor claims 3 GB memory chips are now too valuable for consumer GPUs",
    "link": "https://www.tomshardware.com/pc-components/gpus/nvidias-rtx-5000-super-could-be-cancelled-or-get-pricier-due-to-ai-induced-gddr7-woes-rumor-claims-3-gb-memory-chips-are-now-too-valuable-for-consumer-gpus",
    "summary": "Nvidia RTX 5000 Super series might be canceled due to AI-induced GDDR7 shortage, as rumors suggest that 3GB GDDR7 chips will be hard to come by."
  },
  {
    "title": "AMD s record quarter shows strength in client and AI, as Ryzen leads the charge   but data center dominance could be out of reach",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/amd-record-quarter-shows-strength-but-data-center-dominance-could-be-out-of-reach",
    "summary": "AMD has posted its highest quarterly revenue to date, booking $9.2 billion for Q3 2025. The company broke records in both its client and data center segments, with the Ryzen 7 9800X3D powering a rebound in laptop and desktop sales."
  },
  {
    "title": "China suspends rare-earth export control measures, easing key flashpoint in US-China trade war   one-year reprieve allows for trade talks with the U.S. to continue",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/china-suspends-rare-earth-export-control-measures-easing-key-flashpoint-in-us-china-trade-war-one-year-reprieve-allows-for-trade-talks-with-the-u-s-to-continue",
    "summary": "Beijing is suspending the implementation of its tight export controls on rare-earth materials for a year."
  },
  {
    "title": "Elon Musk says building his own 'TeraFab' chip fab may be the only answer to Tesla's colossal AI semiconductor demand   Nvidia CEO Jensen Huang warns against 'extremely hard' challenge",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/elon-musk-says-terafab-chip-fab-may-be-the-only-answer-to-teslas-colossal-ai-semiconductor-demand-nvidia-ceo-jensen-huang-warns-against-extremely-hard-challenge",
    "summary": "Elon Musk said Tesla may need to build its own massive TeraFab chip plant to secure enough AI processors, a move that would make Tesla one of the world s largest chipmakers, but experts like Nvidia s Jensen Huang warn that creating a modern semiconductor process and fab is vastly more complex than Musk imagines."
  },
  {
    "title": "Print big, spend small with this early Black Friday deal on the Halot-X1 resin 3D printer now with $130 off the MSRP",
    "link": "https://www.tomshardware.com/3d-printing/print-big-spend-small-with-this-early-black-friday-deal-on-the-halot-x1-resin-3d-printer-now-with-usd130-off-the-msrp",
    "summary": "Print big, but spend small on this great resin 3D printer that brings precision and speed while keeping quiet."
  },
  {
    "title": "Explosive AI buildout brings into question water supply concerns   exploring how data centers could curb water demands",
    "link": "https://www.tomshardware.com/tech-industry/explosive-ai-buildout-brings-into-question-water-supply-concerns-exploring-how-data-centers-could-curb-water-demands",
    "summary": "Explosive data center construction projects under the new AI boom may threaten to damage local water sources and compete with citizens for access to clean drinking water."
  },
  {
    "title": "Sam Altman backs away from OpenAI's statements about possible U.S. gov't AI industry bailouts   company continues to lobby for financial support from the industry",
    "link": "https://www.tomshardware.com/tech-industry/sam-altman-distances-openai-from-data-center-bailout-talk",
    "summary": "OpenAI CEO Sam Altman clarified on Thursday that the company does not \"have or want government guarantees\" for its data centers."
  },
  {
    "title": "Dutch government allegedly folds to supply chain pressure, will relinquish control of Nexperia in China spat   reports say deal contingent upon China allowing firm to resume chip exports",
    "link": "https://www.tomshardware.com/tech-industry/dutch-government-allegedly-folds-to-supply-chain-pressure-will-relinquish-control-of-nexperia-in-china-spat-reports-say-deal-contingent-upon-china-allowing-firm-to-resume-chip-exports",
    "summary": "The Dutch government is ready to relinquish its control over Nexperia if Beijing allows its China factory to resume exports."
  },
  {
    "title": "Jensen Huang confirms there are no plans to ship Blackwell GPUs to China right now, chipmaker at Beijing's mercy   Nvidia CEO says shipments haven't been approved by Chinese authorities",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/jensen-huang-confirms-there-are-no-plans-to-ship-blackwell-gpus-to-china-right-now-chipmaker-at-beijings-mercy-nvidia-ceo-says-shipments-havent-been-approved-by-chinese-authorities",
    "summary": "After President Trump and U.S. Treasury Secretary Scott Bessent reiterated that Nvidia will be barred from selling its most advanced chips to China, Jensen Huang has now confirmed that there are currently no active discussions on the matter. In fact, Nvidia also requires authorization from China itself before it can sell GPUs to local firms."
  },
  {
    "title": "It's rare, but we found an RTX 5070 that's at actual MSRP   Just $479.99 for this MSI RTX 5070 in Newegg's early Black Friday sales",
    "link": "https://www.tomshardware.com/pc-components/gpus/its-rare-but-we-found-an-rtx-5070-thats-at-actual-msrp-just-usd479-99-for-this-msi-rtx-5070-in-neweggs-early-black-friday-sales",
    "summary": "Newegg's early Black Friday deals show this MSI RTX 5070 GPU at well under MSRP for $479.99"
  },
  {
    "title": "This  249 MSI gaming monitor unlocks 4K on a budget   save  100 on this dual-mode display with up to 320Hz refresh rate",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/this-gbp249-msi-gaming-monitor-unlocks-4k-on-a-budget-save-gbp100-on-this-dual-mode-display-with-up-to-320hz-refresh-rate",
    "summary": "Save 29% on this 27-inch MSI MAG 272URDF gaming monitor, capable of 4K gaming."
  },
  {
    "title": "Linux software management made simple with Discover",
    "link": "https://www.tomshardware.com/software/linux/linux-software-management-made-simple-with-discover",
    "summary": "Software management in Linux can be a daunting task for the uninitiated, so when Discover popped up, offering an easy-to-use and powerful user interface, we had to take a look."
  },
  {
    "title": "QIDI Q2 Combo review: Great high temp printer, but skip the box",
    "link": "https://www.tomshardware.com/3d-printing/qidi-q2-combo-review",
    "summary": "The QIDI Q2 is a great 3D printer, but the QIDI Box? Not so much."
  },
  {
    "title": "The world is overly reliant on one US-located mine for critical chipmaking material, but China is working to break the stranglehold   China investing over $14 million in synthetic quartz manufacturing to diversify away from US dependency",
    "link": "https://www.tomshardware.com/tech-industry/the-world-is-overly-reliant-on-one-us-located-mine-for-critical-chipmaking-material-but-china-is-working-to-break-the-stranglehold-china-investing-over-usd14-million-in-synthetic-quartz-manufacturing-to-diversify-away-from-us-dependency",
    "summary": "High-purity quartz is crucial for semiconductor manufacturing, and you can only get it naturally from the mine in North Carolina."
  },
  {
    "title": "Substrate's claims about revolutionary ASML-beating chipmaking technology scrutinized, analyst likens the venture to a fraud   report pokes holes in the startup's technology, messaging, and leaders",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/substrates-claims-about-revolutionary-asml-beating-chipmaking-technology-scrutinized-analyst-likens-the-venture-to-a-fraud-report-pokes-holes-in-the-startups-technology-messaging-and-leaders",
    "summary": "Analyst likens Substrate's tech, messaging, and leadership to a fraud."
  },
  {
    "title": "Asus to include sag detection for monstrous new ROG Matrix RTX 5090 GPU   Level Sense can warn users of a mere 0.10 degree shift",
    "link": "https://www.tomshardware.com/pc-components/gpus/asus-to-include-sag-detection-for-monstrous-new-rog-matrix-rtx-5090-gpu-level-sense-can-warn-users-of-a-mere-0-10-degree-shift",
    "summary": "Asus' new ROG Matrix RTX 5090 GPU is so big that it will ship with Level Sense technology at launch. The feature can detect a shift of just 0.10 degrees to help prevent GPU sag."
  },
  {
    "title": "Corsair HX1000i SHIFT 1000W power supply review",
    "link": "https://www.tomshardware.com/pc-components/power-supplies/corsair-hx1000i-shift-1000w-power-supply-review",
    "summary": "A revolutionary power supply that reimagines cable management with side-mounted connectors and integrated iCUE ecosystem control, delivering flagship performance for builders willing to embrace its unique compatibility requirements and premium pricing."
  },
  {
    "title": "Defying anti-cheat, creator gets Battlefield 6 running on 12-year-old AMD FX-9590 CPU, playable at 40+ FPS in 786p with an RX 5700 GPU   experiment reveals only SecureBoot, not TPM, is necessary for Javelin anti-cheat",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/youtuber-gets-battlefield-6-running-on-12-year-old-amd-fx-9590-cpu-playable-at-40-fps-in-786p-with-an-rx-5700-gpu-experiment-reveals-only-secureboot-not-tpm-is-necessary-for-javelin-anti-cheat",
    "summary": "AMD's Bulldozer-era FX-9590 CPU from 2013 managed to run Battlefield 6 at over 30 FPS at 1080p resolution, boosting to 40+ FPS at lower resolutions on smaller maps. FX-9590, despite being more than a decade old, does support SecureBoot, which was enough for BF6 launch, confirming TPM is not neccesary."
  },
  {
    "title": "Storied Windows dev reminisces about Microsoft's first hardware product 45 years ago   the Z-80 SoftCard was an Apple II add-in card",
    "link": "https://www.tomshardware.com/software/storied-windows-dev-reminisces-about-microsofts-first-hardware-product-45-years-ago-the-z-80-softcard-was-an-apple-ii-add-in-card",
    "summary": "Raymond Chen has shared some insight into the development of Microsoft s first hardware product, the Z-80 SoftCard, from 1980."
  },
  {
    "title": "GTA 6 delayed again, this time to November 2026   Rockstar says extra time needed to deliver quality that players have 'come to expect and deserve'",
    "link": "https://www.tomshardware.com/video-games/gta-6-delayed-again-this-time-to-november-2026-rockstar-says-extra-time-needed-to-deliver-quality-that-players-have-come-to-expect-and-deserve",
    "summary": "Rockstar has just announced that perhaps the most highly anticipated game in history has been delayed once again. Originally set to release on May 26, 2026, GTA VI will now hit consoles on November 19, 2026 marking a six-month delay, similar to initial pushback from Fall 2025."
  },
  {
    "title": "Apple's latest MacBook Air, MacBook Pro, and Mac Mini are on sale ahead of Black Friday   several models drop to all-time low prices",
    "link": "https://www.tomshardware.com/laptops/macbooks/apples-latest-macbook-air-macbook-pro-and-mac-mini-are-on-sale-ahead-of-black-friday-several-models-drop-to-all-time-low-prices",
    "summary": "Is now the time to pick up a new MacBook with an M4 inside? Apple's iconic laptops are at their lowest-ever prices ahead of Black Friday"
  },
  {
    "title": "This $234.99 Intel Arc B580 is a brilliant budget-friendly graphics card upgrade   12GB of VRAM unlocks 1440p gaming, with Battlefield 6 thrown in for free",
    "link": "https://www.tomshardware.com/pc-components/gpus/this-usd234-99-intel-arc-b580-is-a-brilliant-budget-friendly-graphics-card-upgrade-12gb-of-vram-unlocks-1440p-gaming-with-battlefield-6-thrown-in-for-free",
    "summary": "Save 25% on this Intel Arc B580 graphics card, fit for 1440p gaming on a budget."
  },
  {
    "title": "AMD's budget Ryzen 5 7500X3D leaks out in early benchmarks, scores hint at performance on par with existing 7600X3D   budget offering could pack a punch in both single and multi-core tests",
    "link": "https://www.tomshardware.com/pc-components/cpus/amds-budget-ryzen-5-7500x3d-leaks-out-in-early-benchmarks-scores-hint-at-performance-on-par-with-existing-7600x3d-budget-offering-could-pack-a-punch-in-both-single-and-multi-core-tests",
    "summary": "AMD's rumored upcoming budget CPU, the Ryzen 5 7500X3D, has just been spotted on GeekBench with solid single-core and multi-core results that put it on par with the 7600X3D, while having the same 96 MB of L3 cache. Unfortunately, for value-conscious gamers, the price of DDR5 right now might turn you away from the cheapest X3D chip on the AM5 platform."
  },
  {
    "title": "As expected, Nvidia's $3,999 mini AI supercomputer is terrible for gaming   DGX Spark struggles to hit 50 FPS at 1080p on medium settings in Cyberpunk 2077",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/as-expected-nvidias-usd3-999-mini-ai-supercomputer-is-terrible-for-gaming-dgx-spark-struggles-to-hit-50-fps-at-1080p-on-medium-settings-in-cyberpunk-2077",
    "summary": "Redditor puts the DGX Spark to the test in gaming, specifically CD Projekt Red's Cyberpunk 2077."
  },
  {
    "title": "Google deploys new Axion CPUs and seventh-gen Ironwood TPU   training and inferencing pods beat Nvidia GB300 and shape 'AI Hypercomputer' model",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/google-deploys-new-axion-cpus-and-seventh-gen-ironwood-tpu-training-and-inferencing-pods-beat-nvidia-gb300-and-shape-ai-hypercomputer-model",
    "summary": "Google Cloud has launched new Axion CPU and Ironwood TPU instances that combine Arm-based general-purpose computing with 7th-generation AI acceleration. Ironwood-based pods with up to 9,216 chips and 42.5 FP8 ExaFLOPS per pod vastly surpass Nvidia's GB300 systems and form the foundation of Google's AI Hypercomputer for large-scale model training and inference."
  },
  {
    "title": "$5,000 Corsair pre-built keeps on frying Intel CPUs due to lack of BIOS update, tech alleges   kills three Intel Core i9 chips because latest version still doesn t have fix for Intel crashing issues",
    "link": "https://www.tomshardware.com/pc-components/cpus/usd5-000-corsair-pre-built-keeps-on-frying-intel-cpus-due-to-lack-of-bios-update-tech-alleges-kills-three-intel-core-i9-chips-because-latest-version-still-doesnt-have-fix-for-intel-crashing-issues",
    "summary": "Corsair still hasn't released the latest 0x12F Vmin instability fix for its pre-built computers, leading to multiple, repeated failures for some of its customers."
  },
  {
    "title": "US govt committee slams Nvidia over shared campus with banned Huawei affiliate   says China has been in Nvidia s backyard for a decade, literally",
    "link": "https://www.tomshardware.com/tech-industry/us-govt-committee-slams-nvidia-over-shared-campus-with-banned-huawei-affiliate-says-china-has-been-in-nvidias-backyard-for-a-decade-literally",
    "summary": "Former Huawei affiliate Futurewei allegedly maintained an office in Nvidia's Santa Clara campus for around a decade until 2024."
  },
  {
    "title": "Using the Raspberry Pi 500+ keyboard PC as a regular Bluetooth keyboard",
    "link": "https://www.cnx-software.com/2025/11/09/using-the-raspberry-pi-500-keyboard-pc-as-a-regular-bluetooth-keyboard/",
    "summary": "While the Raspberry Pi 500+ is a fully functional Linux keyboard PC, it s also possible to use it as a regular mechanical Bluetooth keyboard. This week, I had a problem with my regular Logitech wireless keyboard and mouse combo, so I sent it back to the shop for repair since it was still under warranty. Then somebody forgot the RF dongle for her own combo at home, so long story short, we ended up with one third spare keyboard for two people. Not ideal. But luckily, we just completed the review of the Raspberry Pi 500+ keyboard PC, so we had a spare mechanical keyboard, and the btferret project allowed us to use it as a Bluetooth keyboard, which I m using right now to write this article. We could have used the Pi 500+ as a Linux machine directly, but we would have had to reinstall all the software we [...] The post Using the Raspberry Pi 500+ keyboard PC as a regular Bluetooth keyboard appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Giveaway Week 2025   RAKwireless Blues.ONE LoRaWAN, LTE-M, and NB-IoT devkit",
    "link": "https://www.cnx-software.com/2025/11/09/giveaway-week-2025-rakwireless-blues-one-lorawan-lte-m-and-nb-iot-devkit/",
    "summary": "It turns out we don t have two, but three companies offering free samples on CNX Software this year. The last one is a regular, and RAKwireless joins us for the fifth year running with a Blues.ONE LoRaWAN, LTE-M, and NB-IoT devkit that can be useful for industrial automation and asset-tracking applications. Regular readers may recall that it is the same prize as last year. While I usually prefer getting a new devkit, the company didn t launch any this year (just some Meshtastic kits). The good news is that if you missed out last time around, you have a chance to give it another go. Here s what the winner will get as a reminder: RAK4631 WisBlock Core Module based on Nordic Semi nRF52840 Arm Cortex-M4F microcontroller @ 64 MHz with 1 MB Flash, 256 KB RAM, Bluetooth Low Energy 5.0 protocol stack Semtech SX1262 LoRa Transceiver with LoRaWAN 1.0.2 protocol stack [...] The post Giveaway Week 2025 RAKwireless Blues.ONE LoRaWAN, LTE-M, and NB-IoT devkit appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Raspberry Pi 500+ mechanical keyboard PC review with Raspberry Pi OS  Trixie ",
    "link": "https://www.cnx-software.com/2025/11/08/raspberry-pi-500-mechanical-keyboard-pc-review-with-raspberry-pi-os-trixie/",
    "summary": "Today, we ll review the Raspberry Pi 500+ mechanical keyboard PC using the recently released Raspberry Pi OS Trixie based on Debian 13. It s quite similar to the earlier Raspberry Pi 500 keyboard PC, but comes with more memory (16GB vs 8GB), a 256GB NVMe SSD, and a proper mechanical keyboard with replaceable caps and RGB LED lighting, so we ll focus on these aspects during our tests, after going through the usual unboxing and teardown process. Raspberry Pi 500+ unboxing We received an early prototype of the Raspberry Pi 500+ keyboard PC with a UK layout, white design in a retail package. The bottom side of the package includes a list of features and confirmation that it s indeed a UK layout keyboard. Not ideal for Thai users (we usually rely on the US layout), but that was probably the only layout available when Raspberry Pi sent us a sample in mid-September. [...] The post Raspberry Pi 500+ mechanical keyboard PC review with Raspberry Pi OS Trixie appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Giveaway Week 2025   VOIPAC iMX93 Pro industrial development kit",
    "link": "https://www.cnx-software.com/2025/11/08/giveaway-week-2025-voipac-imx93-pro-industrial-development-kit/",
    "summary": "The sixth prize of this year s Giveaway Week is a VOIPAC iMX93 Pro industrial development kit with an NXP i.MX 93 Cortex-A55/M33 Edge AI SoC, 2GB LPDDR4, and 16GB eMMC flash. The development kit offers dual Gigabit Ethernet, WiFi 6, and Bluetooth 5.3 connectivity, HDMI, DisplayPort, and HDMI display interfaces, three audio jacks, two MIPI CSI camera interfaces, various USB ports, M.2 sockets, and more. It targets artificial intelligence, machine learning, human-machine interface (HMI) solutions, and more. I reviewed the VOIPAC IMX8M industrial development kit and subsequently gave it away in 2023, but I haven t done a review of the iMX93 development kit. Instead, one lucky winner will get it directly from VOIPAC. Alternatively, they can offer the new iMX91 industrial development kit, if you prefer. You can also write your preferred kit in the comments (optional). The company provides Linux built with Yocto Project 5.0 Scarthgap for the [...] The post Giveaway Week 2025 VOIPAC iMX93 Pro industrial development kit appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Nexalta Guardian NXG0042AI   Qualcomm IPQ9574-based networking solution with 10GbE, WiFi 7, 5G, local AI (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/11/07/nexalta-guardian-nxg0042ai-qualcomm-ipq9574-based-networking-solution-with-10gbe-wifi-7-5g-local-ai/",
    "summary": "Nexalta Guardian NXG0042AI is a large networking and IoT gateway monster powered by a Qualcomm IPQ9574 chipset offering 10GbE and 2.5GbE networking, WiFi 7 support with up to five concurrent WiFi radios, up to four/seven 5G modems, up to 52 (e)SIMs, and two on-board Compute Module slots for Rockchip RK3588 or NVIDIA Jetson SO-DIMM system-on-modules. The main board (XWR A1) also offers 25Gbps WAN fabric, three MCUs for BMC, power management, and cryptography, M.2 slots for NVMe storage or AI accelerators, two mSATA sockets, HDMI video output, USB ports, Starlink satellite support, and a range of IoT protocol options such as LoRaWAN, 5G RedCap, UWB, Bluetooth LE, and so on. Nexalta Guardian specifications: Main SoC subsystem SoC Qualcomm IPQ9574 quad-core Arm Cortex-A73 processor @ 2.2GHz processor System Memory 2GB DDR4 RAM Storage 8GB eMMC flash, 64MB NOR flash SoM sub-system 2x 260-pin SO-DIMM sockets for: Turing RK1 [...] The post Nexalta Guardian NXG0042AI Qualcomm IPQ9574-based networking solution with 10GbE, WiFi 7, 5G, local AI (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Giveaway Week 2025   USB Vsense USB PD voltage indicator",
    "link": "https://www.cnx-software.com/2025/11/07/giveaway-week-2025-usb-vsense-usb-pd-voltage-indicator/",
    "summary": "The fifth prize of CNX Software Giveaway Week 2025 will be the USB Vsense USB PD voltage indicator. I received three samples for review last August, so I m keeping one for myself, giving one here on CNX Software (International), and another one on CNX Software Thailand. It s a simple device with two USB-C ports and color-coded LEDs showing the voltage supported from 5V up to 48V as defined in the Extended Power Range (EPR) specs. In my review, I found the little device to work as expected, testing it with various USB PD adapters connected to a laptop and a Raspberry Pi 5 SBC. There are already such USD PD voltage testers on the market, and what differentiates the Vsense from the rest is its multi-layered design, since it s made of seven PCBs stacked on top of each other and secured with four screws. To enter the draw, simply leave [...] The post Giveaway Week 2025 USB Vsense USB PD voltage indicator appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "AAEON PICO-ARU4  Arrow Lake  Pico-ITX SBC is powered by up to an Intel Core Ultra 7 255U processor",
    "link": "https://www.cnx-software.com/2025/11/07/aaeon-pico-aru4-arrow-lake-pico-itx-sbc-is-powered-by-up-to-an-intel-core-ultra-7-255u-processor/",
    "summary": "AAEON PICO-ARU4 might be the world s first Pico-ITX SBC powered by Intel Core Ultra 5/7 Arrow Lake (Series 2) processor family. More specifically, it s available with the Core Ultra 5 225U or Core Ultra 7 255U, both with a 15W TDP. It ships with up to 32GB LPDDR5 RAM, offers 2.5GbE and GbE networking, HDMI and eDP interfaces for up to two independent displays, two USB 3.2 Gen 2 ports, two USB 2.0 headers, two M.2 sockets for storage (NVMe SSD) and wireless expansion, two RS-232/422/485 headers, a 4-bit GPIO header, SMBus/I2C, and more. AAEON PICO-ARU4 specifications: Arrow Lake SoC (one of the other) Intel Core Ultra 5 225U 12-core (2P+8E+2LPE) processor @ up to 4.8 GHz turbo frequency, 12MB cache, 4x Xe-core Intel Graphics (8 TOPS), and Intel AI Boost (12 TOPS); PBP: TDP 15W Intel Core Ultra 7 255U 12-core (2P+8E+2LPE) processor @ up to 5.2 GHz, 12MB cache, [...] The post AAEON PICO-ARU4 Arrow Lake Pico-ITX SBC is powered by up to an Intel Core Ultra 7 255U processor appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Review of SONOFF s latest Matter Smart Switches   Basic Gen5 and Tx Gen2",
    "link": "https://www.cnx-software.com/2025/11/06/review-sonoff-basic-gen5-matter-switch-and-tx-gen2-matter-smart-wall-switch/",
    "summary": "Today, we re about to review not one, but two new Matter devices: the SONOFF Basic Gen5 Smart Switch and the SONOFF Tx Gen2 Smart Wall Switch. Both are upgraded versions of their previous models, now adding support for the Matter protocol (over Wi-Fi). The Basic Gen5 is the fifth generation of the popular Basic series, known for being affordable and widely used in the market. It s a Wi-Fi smart switch that can control all kinds of devices, such as lights or small electrical devices. Basically, anything within its 10A limit. What s new compared to the previous BasicR4 is the addition of Matter and near-field control via Bluetooth. As for the Tx Gen2 (T6), it s an upgraded version of the older T2/T3 lineup. Besides adding Matter, it also brings a few new features, like adjustable backlight brightness and the Detach Relay mode. Both models support voice control via Apple Siri, Google [...] The post Review of SONOFF s latest Matter Smart Switches Basic Gen5 and Tx Gen2 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Giveaway Week 2025   5-inch Raspberry Pi Touch Display 2",
    "link": "https://www.cnx-software.com/2025/11/06/giveaway-week-2025-5-inch-raspberry-pi-touch-display-2/",
    "summary": "The fourth prize of CNX Software Giveaway Week 2025 will be the official 5-inch Raspberry Pi Touch Display 2. I was sent one for review, but I have yet to find anything interesting to use it for, like I did for the 7-inch Raspberry Pi Touch Display 2 and the Raspberry Pi AI camera. So I might just as well give it away. To enter the draw, simply leave a comment with your country and whatever else you d like to say (no links in the body of the comment). If the country is missing, I ll consider the entry void. Other rules are as follows: Only one entry per contest. I will filter out entries with the same IP and/or email address. Contests are open for 48 hours starting at 10 am (Bangkok time) every day. Comments will be closed after 48 hours. If comments are open, the contest is still [...] The post Giveaway Week 2025 5-inch Raspberry Pi Touch Display 2 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "CamThink NeoEyes NE301   An ultra-low-power, STM32N6-based Edge AI camera",
    "link": "https://www.cnx-software.com/2025/11/06/camthink-neoeyes-ne301-an-ultra-low-power-stm32n6-based-edge-ai-camera/",
    "summary": "CamThink NeoEyes NE301 is an ultra-low-power Edge AI camera built around the STM32N6 Arm Cortex-M55 MCU with Neural-ART NPU that offers significantly enhanced features and performance compared to the company s earlier ESP32-S3-based NeoEyes NE101. The camera ships with a 4MP MIPI CSI camera sensor by default, but USB camera sensors are also supported. It also features 64MB PSRAM, 128MB hyperflash, WiFi 6 and Bluetooth 5.4 wireless connectivity, optional support for a 4G LTE module (global or US), audio wafers, USB-C and UART debug, a 16-pin GPIO header, and support for either USB, battery, or PoE power. CamThink NeoEyes 301 specifications: MCU STMicro STM32N6 MCU Core Arm 32-bit Cortex-M55 CPU @ up to 800MHz with Arm Helium and Arm MVE GPU Neo-Chrom 2.5D GPU, Chrom-ART Accelerator (DMA2D) NPU ST Neural-ART accelerator @ 1 GHz, up to 600 GOPS; 3 TOPS/W enabling fanless operation BPU Hardware-accelerated H.264 [...] The post CamThink NeoEyes NE301 An ultra-low-power, STM32N6-based Edge AI camera appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "WCH BLE Analyzer Pro   A Bluetooth LE sniffer, analyzer, and debugging tool",
    "link": "https://www.cnx-software.com/2025/11/05/wch-ble-analyzer-pro-a-bluetooth-le-sniffer-analyzer-and-debugging-tool/",
    "summary": "WCH BLE Analyzer Pro is a USB-based Bluetooth Low Energy (BLE) sniffer and debugging tool designed to capture, decode, and analyze BLE communication packets in real-time. The analyzer supports adjustable polling intervals, broadcast and connection packet tracking, address filtering, and detailed packet inspection with statistics and graphical representation. It can monitor BLE broadcast and connection data in real-time and includes functions such as PHY mode selection and whitening control. These features enable low-level monitoring of BLE communication, help identify transmission issues, and verify protocol behavior. Applications include use in R&D, testing, and debugging of Bluetooth-enabled products such as IoT devices, wearables, and sensors. WCH BLE Analyzer Pro specifications: Main chips 3x CH582F Bluetooth LE RISC-V microcontrollers, and a CH334 USB hub (see board photo at the end of the post) Supported protocol Bluetooth Low Energy (BLE) 4.0/4.2/5.0 Capture range BLE advertisement and connection packets Frequency band [...] The post WCH BLE Analyzer Pro A Bluetooth LE sniffer, analyzer, and debugging tool appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Bluetooth 6.2 gets more responsive, improves security, USB communication, and testing capabilities",
    "link": "https://www.cnx-software.com/2025/11/05/bluetooth-6-2-gets-more-responsive-improves-security-usb-communication-and-testing-capabilities/",
    "summary": "Bluetooth 6.2 specification has just been released with a range of new features to enhance responsiveness with shorter connection intervals, strengthen security against amplitude-based RF attacks, and improve communication with a new Bulk Serialization Mode that s especially useful for USB Bluetooth LE audio applications. The new Bluetooth Core 6.2 specification also introduces various BLE Test Mode enhancements. If you feel like Bluetooth specifications are released more often than in the past, that s normal because the Bluetooth SIG switched to a bi-annual release schedule. For instance, the Bluetooth 6.1 specification was just published last May, or about 6 months ago Bluetooth 6.2 highlights: Bluetooth Shorter Connection Intervals (SCI) reduce the minimum Bluetooth LE connection interval from 7.5 ms to just 375 s for faster responsiveness. The change will especially impact high-performance HID devices, real-time human-machine interfaces (HMIs), and latency-sensitive sensors. AR/VR and gaming applications will particularly benefit from the lower latency. [...] The post Bluetooth 6.2 gets more responsive, improves security, USB communication, and testing capabilities appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Giveaway Week 2025   Banana Pi BPI-R4 Lite",
    "link": "https://www.cnx-software.com/2025/11/05/giveaway-week-2025-banana-pi-bpi-r4-lite/",
    "summary": "The third prize of CNX Software Giveaway Week 2025 is the Banana Pi BPI-R4 Lite router board, which will be shipped directly to a randomly selected winner by the company. It s powered by a MediaTek Filogic 850 (MT7987AV) quad-core Cortex-A53 network processor, coupled with 2GB DDR4 and 8GB eMMC flash, and equipped with four gigabit Ethernet ports, a 2.5GbE RJ45 WAN port, and a 2.5GbE SFP cage. It can also be extended with WiFi 7 and 5G cellular modules thanks to two mini PCIe sockets and an M.2 Key-B slot with USB 3.0 interface. The board also features a 16-pin MikroBus GPIO header with UART, I2C, SPI, PWM, and other signals to connect one of the over 1000 Mikroe Click modules available. As its name implies, the BPI-R4 Lite is a cost-down version of the Banana Pi BPI-R4 introduced a few years ago. The documentation has improved since the last [...] The post Giveaway Week 2025 Banana Pi BPI-R4 Lite appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Progress on upstream Linux for MediaTek Genio IoT SoCs and boards",
    "link": "https://www.cnx-software.com/2025/11/04/progress-on-upstream-linux-for-mediatek-genio-iot-socs-and-boards/",
    "summary": "Collabora announced a partnership with MediaTek to bring upstream support to the Genio IoT SoCs and boards in November 2024, but since the announcement was new at the time, no work had been done, and I didn t write about it. However, almost one year later, Collabora can now report very good progress, especially for MediaTek MT8395 boards like Genio 1200 EVK and Radxa NIO 12L, which are now usable with mainline/upstream Linux since most features are implemented. But improvements also extend to MediaTek Genio 510 and Genio 700 EVKs, and the collaboration will continue with work on newer MediaTek Genio and Kompanio processors for IoT solutions and Chromebooks. The two MediaTek Genio 1200 boards can now boot mainline Linux without any out-of-tree patches while providing support for the Audio DSP, JPEG, video hardware encoders and decoders, the Arm Mali-G57 MC5 GPU (via the open source Panfrost driver), as well as [...] The post Progress on upstream Linux for MediaTek Genio IoT SoCs and boards appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Giveaway Week 2025   Elecrow Pi Terminal Raspberry CM4 industrial HMI display",
    "link": "https://www.cnx-software.com/2025/11/04/giveaway-week-2025-elecrow-pi-terminal-raspberry-cm4-industrial-hmi-display/",
    "summary": "Sometimes we receive samples even though we did not ask for them, said we would have time to review them, or due to miscommunication. That s exactly what has happened with the Elecrow Pi Terminal, a Raspberry Pi CM4-powered industrial HMI with a 7-inch touchscreen display. So instead of letting it go to waste, I decided to offer it as the second prize of the CNX Software Giveaway Week 2025 contest. Elecrow Pi Terminal specifications: SoM Raspberry Pi CM4 Lite SoC Broadcom BCM2711 CPU Quad-core Cortex-A72 SoC @ 1.5GHz GPU VideoCore VI with support for OpenGL ES 3.1 and Vulkan 1.0 VPU Decode H.265/HEVC up to 4Kp60, H.264 up to 1080p60 Encode H.264 up to 1080p30 Memory 4GB LPDDR4-3200 Storage N/A Wireless Dual-band WiFi 5 and Bluetooth 5.0 Storage 64GB microSD card preloaded with the Raspberry Pi OS + Node-RED software M.2 [...] The post Giveaway Week 2025 Elecrow Pi Terminal Raspberry CM4 industrial HMI display appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "$200 SpecFive Spectre Pro Android 12 smartphone integrates LoRa Mesh connectivity",
    "link": "https://www.cnx-software.com/2025/11/04/200-specfive-spectre-pro-android-12-smartphone-integrates-lora-mesh-connectivity/",
    "summary": "LoRa Mesh solutions like Meshtastic or MeshCore enable off-grid messaging, GPS coordinates, and in some cases, audio communication for emergencies, working or hiking in remote areas, or simply to be able to communicate outside of cellular networks. However, adoption is limited, as users need to buy a terminal that costs about the same as an entry-level smartphone, or they may not see any use for it, except for emergencies. Integrating LoRa Mesh into Android smartphones can lower the cost of the feature, since the battery, enclosure, etc are already there, and you just need to add a LoRa module and an antenna. That s what SpecFive has done with the SpecFive Spectre Pro 4G LTE smartphone with a LoRa module. The rugged phone runs Android 12 and ships with Meshtastic, Mesh Tic Tac Toe, CheckTastic, and Mesh Chess. Spec5 Spectre Pro specifications: SoC Unnamed quad-core processor System Memory 4GB [...] The post $200 SpecFive Spectre Pro Android 12 smartphone integrates LoRa Mesh connectivity appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "This battery-powered NB-IoT/LTE-M industrial data logger is designed to run for years",
    "link": "https://www.cnx-software.com/2025/11/03/this-battery-powered-nb-iot-lte-m-industrial-data-logger-is-designed-to-last-for-years/",
    "summary": "NORVI EC-M12-BC-C6-C-A (or EC-M12 for shorts) is a battery-powered cellular IoT industrial data logger offering NB-IoT and LTE-M connectivity, 2G fallback, two 4-20mA sensor inputs, an RS485 interface, and two 3.6V/19,000mAh non-rechargeable Lithium batteries for up to 5-7 years of operation. The IP67-rated data logger is built around a low-power STM32L072 Arm Cortex-M0+ microcontroller, and features a SIM7070 cellular IoT modem, a microSD card slot for data storage, and a single 8-pin M8 connector carrying analog input and RS485 signals. NORVI EC-M12-BC-C6-C-A specifications: Microcontroller STMicro STM32L072 Arm Cortex-M0+ MCU clocked at up to 32 MHz with 20 KB of RAM, 192 KB flash with ECC, and 6 KB of data EEPROM with ECC Storage MicroSD card slot up to 128GB Wireless Connectivity Multi-band 2G, Cat-M1, Cat-NB1 (NB-IoT) via SIMCom SIM7070 module Optional LoRaWAN support RP-SMA male antenna connector Sensor interface via 8-pin M8 female connector 2x analog Inputs [...] The post This battery-powered NB-IoT/LTE-M industrial data logger is designed to run for years appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "HackBEE is a Raspberry Pi RP2350 USB-C dongle for developers (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/11/03/hackbee-is-a-raspberry-pi-rp2350-usb-c-dongle-for-developers/",
    "summary": "Hack the Board s HackBEE is a tiny programmable USB-C dongle and development platform powered by the Raspberry Pi RP2350 Arm Cortex-M33/Hazard3 RISC-V microcontroller. It supports USB host and device modes, has side buttons, and includes a multi-color RGB LED for feedback. The device can be used as a programmable HID device (keyboard/mouse/media controller), a USB host or device for testing and prototyping, an automation tool for repetitive tasks, a compact input emulator, or a teaching tool for C/C+, MicroPython, and embedded systems education. HackBEE specifications: MCU Raspberry Pi RP2350A CPU Dual-core Arm Cortex-M33 @ 150 MHz with Arm Trustzone, Secure boot OR Dual-core RISC-V Hazard3 @ 150 MHz Either two cores can be used. Memory 520 KB on-chip SRAM Package QFN-60 Storage Not disclosed USB 1x USB Type-C host/device port Security Arm TrustZone for Cortex-M33 cores, optional boot signing (OTP), protected OTP storage, SHA-256 [...] The post HackBEE is a Raspberry Pi RP2350 USB-C dongle for developers (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Giveaway Week 2025   M5Stack Tab5 ESP32-P4 IoT devkit",
    "link": "https://www.cnx-software.com/2025/11/03/giveaway-week-2025-m5stack-tab5-esp32-p4-iot-devkit/",
    "summary": "It s that time of the year when we organize CNX Software Giveaway Week, a global contest where we give away review samples or get companies to send units to readers. For the 12th edition of the contest, we have seven items to give away this time around: five review samples I will send myself, and two prizes from companies offering a router board and an industrial development kit. As usual, the contest is open worldwide, and CNX Software Thailand has a separate contest with four additional items for people with an address in Thailand. The first prize will be the M5Stack Tab5 ESP32-P4 IoT development kit featuring a 5-inch touchscreen display, a 2MP front-facing camera, a speaker, a dual-microphone array, a microSD card slot, an ESP32-C6 for wireless connectivity, sensors, and more. I had some fun reviewing the M5Stack Tab5 devkit by building the default firmware with the ESP-IDF framework, [...] The post Giveaway Week 2025 M5Stack Tab5 ESP32-P4 IoT devkit appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Creality Sermoon S1 high-end 3D scanner review   Part 1: specifications and unboxing",
    "link": "https://www.cnx-software.com/2025/11/02/creality-sermoon-s1-high-end-3d-scanner-review-part-1-specifications-and-unboxing/",
    "summary": "Creality has sent me the Sermoon S1 high-end 3D scanner for review. It supports blue laser line and infrared structured light scanning, offers high accuracy up to 0.02mm, scans objects from 5 x 5 x 5 m3 to 4000 x 4000 x 4000 mm3, and looks like a pretty cool device overall. I ll start the review by diving into the specifications, before going through an unboxing to check out the 3D scanner and its accessories. I ll then need to study a bit more before testing out with different objects in the second part of the review. Sermoon S1 3D scanner specifications Scanning Modes Blue laser lines Single Blue Laser Line Scanning rate: 108,000 measurements/s Working distance 200 to 600mm Outdoor Scanning Below 100,000 lux Laser Safety Class II (eye safe) 7 Parallel Blue Laser Lines Scanning rate: 756,000 measurements/s Working distance 150 to 400mm Outdoor Scanning [...] The post Creality Sermoon S1 high-end 3D scanner review Part 1: specifications and unboxing appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Review of Intel-based UP AI development kits   Part 1: Unboxing and first boot to Ubuntu Pro 24.04",
    "link": "https://www.cnx-software.com/2025/11/01/review-of-intel-based-up-ai-development-kits-part-1-unboxing-and-first-boot-to-ubuntu-pro-24-04/",
    "summary": "AAEON sent me three Intel-based UP AI development kits for review, namely the credit card-sized, Intel N150-based UP TWL, the Intel N150-based UP Squared Pro TWL with M.2 expansion slots and a Hailo-8L module, and the more powerful UP Xtreme ARL equipped with a 14-core Intel Core Ultra 5 225H processor. They offer entry-level, mid-range, and high-end x86-based alternatives to the AAEON NV8600-Nano AI developer kit I reviewed last August, equipped with an NVIDIA Jetson Orin Nano 8GB. All three models ship with Ubuntu Pro 24.04 and support the UP AI Toolkit and Network Optix Nx Meta IP video management platform. I ll review all three models independently, but in this first part, I ll go through the hardware and quickly try one of the boards. Unboxing Those are development kits that ship with not only the board, but also the same USB VGA camera provided with the NV8600-Nano kit, power supplies, [...] The post Review of Intel-based UP AI development kits Part 1: Unboxing and first boot to Ubuntu Pro 24.04 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "HUSKYLENS 2   A 6 TOPS LLM and AI vision camera with self-learning capabilities",
    "link": "https://www.cnx-software.com/2025/10/31/huskylens-2-a-6-tops-llm-and-ai-vision-camera-with-self-learning-capabilities/",
    "summary": "DFRobot HUSKYLENS 2 is an LLM and AI vision camera powered by a Kendryte K230 dual-core RISC-V SoC with a 6 TOPS AI accelerator and designed to be easy-to-use for makers, educators, competition teams, and AI enthusiasts. It provides an upgrade to the HUSKYLENS AI camera introduced in 2019 with the Kendryte K210 SoC. It features 1GB of LPDDR4, an 8GB eMMC flash, a microSD card slot, a 2MP camera sensor, a 4-pin Gravity expansion connector, and a USB-C port for power and programming. The company says the HUSKYLEN 2 comes preloaded with over 20 AI models, including object tracking, hand recognition, and instance segmentation, but users can also train and deploy their own AI models using features like the self-learning classifier. HUSLYLENSE 2 specifications: SoC Kendryte K230 CPU 64-bit RISC-V processor @ 1.6GHz with RVV 1.0 support 64-bit RISC-V processor @ 800MHz AI accelerator Up to 6 [...] The post HUSKYLENS 2 A 6 TOPS LLM and AI vision camera with self-learning capabilities appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Sakura Pi RK3308B SBC offers RGB LCD interface, supports mainline Linux",
    "link": "https://www.cnx-software.com/2025/10/31/sakura-pi-rk3308b-sbc-offers-rgb-lcd-interface-supports-mainline-linux/",
    "summary": "Sakura Pi RK3308B is a small SBC powered by the Rockchip RK3308B quad-core Cortex-A35 SoC that I saw when I covered the Linux 6.17 release at the end of last month. The board comes with 512 MB of DDR3 memory, a microSD card slot, an optional 4 GB or 8 GB eMMC flash, an RGB LCD interface to connect an LCD, two USB-C ports (one host, one OTG), a WiFi 5 and Bluetooth 4.2 module, and the usual 40-pin GPIO header. Sakura Pi RK3318B specifications: SoC Rockchip RK3308B quad-core Arm Cortex-A35 processor @ up to 1.3 GHz with built-in VAD (Voice Activity Detector); No GPU System Memory 512 MB DDR3 SDRAM Storage MicroSD card slot Optional 4 GB or 8 GB eMMC flash Display I/F 18-bit RGB666 LCD interface Connectivity Dual-band WiFi 5 & Bluetooth 4.2 via Ampak AP6255 module and ceramic antenna or external antenna via [...] The post Sakura Pi RK3308B SBC offers RGB LCD interface, supports mainline Linux appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP32JTAG   An open-source wireless JTAG and logic analyzer (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/10/31/esp32jtag-an-open-source-wireless-jtag-and-logic-analyzer/",
    "summary": "EZ32 ESP32JTAG is an open-source, wireless JTAG and logic analyzer tool that can debug both MCUs and FPGAs. It features a 16-channel 250 MHz logic analyzer and integrated UART interface, designed to replace tools such as ST-Link or Saleae analyzers in a single compact, wireless solution. The device is built around an ESP32-S3 dual-core SoC and a small FPGA with 5k logic gates and 1 Mbit of internal RAM to handle high-speed signal processing. Connectivity options include Wi-Fi 4, Bluetooth 5.0, and USB Type-C, and a small 1.83-inch LCD displays system information such as IP address and status. The ESP32JTAG is also equipped with four configurable 4-wire ports for JTAG, SWD, UART, and logic analyzer mode, and supports target voltage monitoring. EZ32 ESP32JTAG specifications: Wireless MCU Espressif Systems ESP32-S3 CPU dual-core Tensilica LX7 @ up to 240 MHz with vector instructions for AI acceleration Memory 512KB RAM, 8MB [...] The post ESP32JTAG An open-source wireless JTAG and logic analyzer (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESWIN EBC7702 Mini-DTX motherboard offers EIC7702X RISC-V SoC, up to 64GB RAM, Ubuntu 24.04 support",
    "link": "https://www.cnx-software.com/2025/10/30/eswin-ebc7702-mini-dtx-motherboard-offers-eic7702x-risc-v-soc-up-to-64gb-ram-ubuntu-24-04-support/",
    "summary": "ESWIN Computing, in collaboration with Canonical, has launched the EBC7702 Mini-DTX motherboard, a RISC-V development platform with ESWIN s new EIC7702X dual-die RISC-V SoC. This board can be considered an upgrade from the previous EBC7700 SBC and is designed for more demanding AI and data processing tasks. The motherboard features an 8-core 64-bit dual-die RISC-V CPU with an integrated AI accelerator delivering up to 40 TOPS (INT8) and 20 TFLOPS (FP16) performance. It supports up to 64GB LPDDR5 memory, 32GB onboard eMMC flash, and multiple storage interfaces, including M.2, SPI Flash, and MicroSD. Connectivity options include four Gigabit Ethernet ports, Wi-Fi, two HDMI outputs, two PCIe Gen3.0 x16 slots, USB 3.0/2.0 ports, and four fan headers. With support for AI, display, and camera modules, the board is designed for video analysis and edge AI workloads. ESWIN EBC7702 specifications: SoC ESWIN EIC7702X dual-die RISC-V SoC CPU 8x 64-bit Out-of-Order RISC-V [...] The post ESWIN EBC7702 Mini-DTX motherboard offers EIC7702X RISC-V SoC, up to 64GB RAM, Ubuntu 24.04 support appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Palm-sized PocketPD USB-C programmable power supply delivers up to 21V/5A output (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/10/30/palm-sized-pocketpd-usb-c-programmable-power-supply-pps-21v-5a-output/",
    "summary": "PocketPD is a compact USB PD programmable power supply developed by CentyLab in Salem, Oregon. Designed to fit in your pocket, it provides precise, programmable voltage and current control using the USB Power Delivery 3.0 PPS mode. The device outputs 3.3V to 21V at up to 5A, features constant voltage/current modes, and includes a 0.96-inch OLED display for real-time monitoring. Powered by a Raspberry Pi RP2040 MCU and AP33772 PD controller, it supports fine adjustment in 20mV/50mA steps, with built-in protections against short circuits and reverse current. Weighing just 63g, PocketPD also offers magnetic mounting, open-source firmware, and KiCad hardware files for customization. The company offers two versions, featuring either a detachable screw terminal or Anderson Powerpole/XT60 connector options. PocketPD specifications: MCU Raspberry Pi RP2040 dual-core Cortex-M0+ microcontroller @ 125 MHz with 264 KB SRAM Storage Non-volatile storage for user profiles (voltage/current settings) Display 0.96-inch OLED display [...] The post Palm-sized PocketPD USB-C programmable power supply delivers up to 21V/5A output (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Waveshare MK20 macro keyboard features twenty mechanical keys with 0.85-inch color LCD keycaps",
    "link": "https://www.cnx-software.com/2025/10/29/waveshare-mk20-macro-keyboard-features-twenty-mechanical-keys-with-0-85-inch-color-lcd-keycaps/",
    "summary": "Waveshare MK20 is a multifunctional macro keyboard with twenty mechanical keys featuring 0.85-inch LCD keycaps. As an upgrade to the earlier MK10 model, it adds a 2.8-inch secondary display along with two control knobs. The device supports AI voice interaction, real-time data display, and smart home integration with Home Assistant. Like its predecessor, the MK20 relies on a dual-system architecture: an Allwinner T113-S3 dual-core Cortex-A7 processor runs Linux to drive the displays, and a GD32 microcontroller runs QMK for low-latency keyboard and knob input. Each LCD key offers 128 128 resolution and supports dynamic images, videos, and multi-layer overlays, while the 2.8-inch secondary display (428 142 resolution) provides status or customization information. The keyboard also includes two rotary encoders with aluminum caps for volume, playback, or timeline control. The device is built with an aluminum alloy top case and a 2.5D acrylic lens for durability. Waveshare MK20 specifications: Main Controller Allwinner [...] The post Waveshare MK20 macro keyboard features twenty mechanical keys with 0.85-inch color LCD keycaps appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "TerraMaster launches Intel N150 NAS systems with 5GbE networking, AI photo recognition",
    "link": "https://www.cnx-software.com/2025/10/29/terramaster-intel-n150-nas-systems-5gbe-networking-ai-photo-recognition-privacy-protection/",
    "summary": "TerraMaster F4-425 Plus (4-bay) and F2-425 Plus (2-bay) hybrid AI NAS systems are upgrades to the earlier Intel N95-based F4-424 and F2-424 NAS systems with an Intel N150 processor, dual 5GbE ports (up from 2.5GbE), and up to three M.2 SSD slots for up to 144TB of hybrid storage. Both models feature DDR5 memory (up to 16GB), 4K/8K video transcoding, and support TerraMaster s TRAID technology for improved performance and data redundancy. They also offer USB expansion options and quiet cooling, making them NAS solutions suitable for home and business use. TerraMaster F4-425 Plus and F2-425 Plus specifications: SoC Intel Processor N150 CPU Quad-core Twin Lake processor @ up to 3.6 GHz (Turbo) with 6MB cache GPU 24EU Intel UHD graphics @ 1000 MHz Hardware transcoding F4-425 Plus H.264, H.265, MPEG-4, VC-1 up to 8K@60fps F4-425 Plus H.264, H.265, MPEG-4, VC-1 up to 4K@60fps TDP 6W to [...] The post TerraMaster launches Intel N150 NAS systems with 5GbE networking, AI photo recognition appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "NXP i.MX 952 processor supports local dimming for AI-enhanced automotive and industrial HMIs",
    "link": "https://www.cnx-software.com/2025/10/28/nxp-i-mx-952-processor-supports-local-dimming-for-ai-automotive-and-industrial-hmis/",
    "summary": "NXP has recently introduced the i.MX 952 applications processor, a new member of the i.MX 95 series, designed for AI-powered automotive and industrial applications, including driver monitoring, child presence detection, and in-cabin HMIs. The i.MX 952 features up to four Arm Cortex-A55 cores with Cortex-M7 and M33 microcontroller cores, and is compliant with ISO 26262 ASIL B and SIL2/SIL3 standards. It integrates an eIQ Neutron NPU for AI-based sensor fusion, a 500 Mpixel/s ISP with RGB-IR support, and is the first processor with built-in local dimming for better display efficiency. Security features include EdgeLock Secure Enclave with post-quantum cryptography, meeting ISO 21434 and IEC 62443 standards. It can be interfaced with NXP s PF09 PMIC, PF53 regulator, Trimension UWB, and IW693/AW693 Wi-Fi 6/6E SoCs, and is pin-to-pin compatible with other members of the i.MX 95 family. NXP i.MX 952 specifications: CPU Up to 4 Arm Cortex-A55 cores with 32KB + 32KB L1-cache, 64KB L2 [...] The post NXP i.MX 952 processor supports local dimming for AI-enhanced automotive and industrial HMIs appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Microchip PIC32-BZ6 BLE 6.0, Thread, and Matter wireless MCU integrates touch and motor control",
    "link": "https://www.cnx-software.com/2025/10/28/microchip-pic32-bz6-ble-6-0-thread-and-matter-wireless-mcu-integrates-touch-and-motor-control/",
    "summary": "Microchip has recently introduced the PIC32-BZ6 family of single-chip, multiprotocol wireless MCUs, also available as RF-certified modules, and designed for smart home, industrial automation, and automotive applications. The module supports Bluetooth LE 6.0, IEEE 802.15.4-based Thread and Matter, and proprietary mesh protocols. For wired connectivity, there are two CAN-FD ports, a 10/100 Mbps Ethernet MAC, and a USB 2.0 full-speed transceiver. Other features include CVD-based touch sensing and motor control interfaces for interactive and real-time applications. As a secure MCU, the PIC32-BZ6 integrates a hardware-based security engine, a secure boot ROM, and encryption accelerators, along with OTA update capability for long-term device management. The microcontroller offers up to 54 GPIO pins, multiple pin and package options (up to 132-pin VQFN), and automotive-grade variants rated for -40 C to +125 C operation. Microchip PIC32-BZ6 specifications: MCU Core 128 MHz Arm Cortex-M4F with FPU and DSP extensions Memory 512 KB multi-port SRAM (with [...] The post Microchip PIC32-BZ6 BLE 6.0, Thread, and Matter wireless MCU integrates touch and motor control appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Radxa Dragon Q6A   A $60+ Qualcomm QCS6490 Edge AI SBC with GbE, WiFi 6, three camera connectors",
    "link": "https://www.cnx-software.com/2025/10/27/radxa-dragon-q6a-a-qualcomm-qcs6490-edge-ai-sbc-with-gbe-wifi-6-three-camera-connectors/",
    "summary": "Radxa Dragon Q6A is a credit card-sized SBC powered by a Qualcomm QCS6490 octa-core SoC with a 12 TOPS AI accelerator, up to 16GB LPDDR5 memory, and the usual ports found on Raspberry Pi-like single board computers, such as gigabit Ethernet, four USB ports, HDMI video output, and a 40-pin GPIO header. The board also features an M.2 Key-M socket for SSD storage, a WiFi 6 and Bluetooth 5.4 wireless module, a MIPI DSI display interface, three MIPI CSI connectors, a connector for an eMMC or UFS flash module, a microphone input connector, and an RTC battery connector. Radxa Dragon Q6A specifications: SoC Qualcomm QCS6490 CPU Octa-core Kryo 670 with 1x Gold Plus core (Cortex-A78) @ 2.7 GHz, 3x Gold cores (Cortex-A78) @ 2.4 GHz, 4x Silver cores (Cortex-A55) @ up to 1.9 GHz GPU Adreno 643L GPU @ 812 MHz with support for Open GL ES 3.2, [...] The post Radxa Dragon Q6A A $60+ Qualcomm QCS6490 Edge AI SBC with GbE, WiFi 6, three camera connectors appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "1GHz Renesas RA8D2 and RA8M2 Cortex-M85 MCUs feature up to 1MB MRAM, 2MB SRAM",
    "link": "https://www.cnx-software.com/2025/10/27/1ghz-renesas-ra8d2-and-ra8m2-cortex-m85-mcus-feature-up-to-1mb-mram-2mb-sram/",
    "summary": "After introducing the 1 GHz RA8T2 MCU earlier this month, Renesas has recently expanded its RA8 lineup with the RA8D2 and RA8M2 groups of MCUs, where the RA8D2 is designed for graphics, HMI, and AI applications with support for display, camera, and audio interfaces, while the RA8M2 targets general-purpose, high-performance IoT and industrial control systems with networking and compute capabilities. Both MCU groups deliver a performance of up to 7,300 Coremarks, offer up to 1MB of MRAM and 2MB of SRAM, and support SiP options with up to 8MB flash. The RA8D2 adds HMI capabilities, including a 1280 800 graphics LCD controller, a 2D drawing engine, MIPI DSI and CSI-2 interfaces, and audio input support for voice and vision AI. Common features include dual Gigabit Ethernet with TSN, USB 2.0, CAN FD, I3C, and various analog peripherals. Integrated RSIP-E50D security, Helium acceleration for DSP/ML with various software support. Renesas RA8D2 and [...] The post 1GHz Renesas RA8D2 and RA8M2 Cortex-M85 MCUs feature up to 1MB MRAM, 2MB SRAM appeared first on CNX Software - Embedded Systems News ."
  }
]