[
  {
    "title": "Get a Creality 3D printer at an all-time low pricing until Christmas   up to $300 off K2 series with CFS bundle",
    "link": "https://www.tomshardware.com/3d-printing/get-a-creality-3d-printer-at-an-all-time-low-pricing-until-christmas-up-to-usd300-off-k2-series-with-cfs-bundle",
    "summary": "Get your hands on one of Creality's K2 combo deals across the K2 lineup this Christmas season; the K2, K2 Pro, and K2 Plus combos are all on sale for up to $300 off."
  },
  {
    "title": "Dell preps massive price hikes up to 30% citing memory pricing 'out of our control'   company reminds commercial customers that placing an order today for future delivery will not guarantee current prices",
    "link": "https://www.tomshardware.com/laptops/dell-preps-massive-price-hikes-up-to-30-percent-citing-memory-pricing-out-of-our-control-company-reminds-commercial-customers-that-placing-an-order-today-for-future-delivery-will-not-guarantee-current-prices",
    "summary": "Dell's commercial sales department is set to announce a wave of price hikes affecting RAM, storage, GPU, and monitor upgrades to all corporate clients starting on December 17, according to leaked internal documents."
  },
  {
    "title": "New app injects AMD's AI-driven FSR Redstone framegen into unsupported games   pre-alpha OptiScaler build demo shows nice improvements over legacy FSR frame gen",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/community-mod-forces-amds-new-redstone-ml-frame-generation-into-older-fsr-games",
    "summary": "A Reddit user has demonstrated AMD s new ML-powered FSR Redstone frame generation running in Monster Hunter Wilds, a game that was never designed to support it."
  },
  {
    "title": "Industry preps new 'cheap' HBM4 memory spec with narrow interface, but it isn't a GDDR killer   JEDEC's new SPHBM4 spec weds HBM4 performance and lower costs to enable higher capacity",
    "link": "https://www.tomshardware.com/pc-components/dram/industry-preps-cheap-hbm4-memory-spec-with-narrow-interface-but-it-isnt-a-gddr-killer-jedecs-new-sphbm4-spec-weds-hbm4-performance-and-lower-costs-to-enable-higher-capacity",
    "summary": "JEDEC is nearing completion of SPHBM4, a standard that enables full HBM4 bandwidth over a 512-bit interface using a 4:1 serialization, reusing standard HBM DRAM dies and a base die. The tech promises to enable a 2.5D integration on organic substrates to support up to 64 GB per stack and more stacks than HBM4 and HBM4E."
  },
  {
    "title": "Snag $760 worth of hardware for $469, including 32GB of DDR5 memory worth $407, in this stellar bundle deal   32GB of DDR5 memory, Intel Z890 motherboard, and 280mm liquid cooler included",
    "link": "https://www.tomshardware.com/pc-components/ram/snag-usd760-worth-of-hardware-for-usd469-including-32gb-of-ddr5-memory-worth-usd407-in-this-stellar-bundle-deal-32gb-of-ddr5-memory-intel-z890-motherboard-and-280mm-liquid-cooler-included",
    "summary": "This RAM-inspired bundle deal from Newegg includes a 32GB DDR5 kit from Corsair, an Intel Z890 motherboard, and a 280mm AIO cooler."
  },
  {
    "title": "Nvidia details new software that enables location tracking for AI GPUs   opt-in remote data center GPU fleet management includes power usage and thermal monitoring",
    "link": "https://www.tomshardware.com/pc-components/gpus/nvidia-details-new-software-that-enables-location-tracking-for-ai-gpus-opt-in-remote-data-center-gpu-fleet-management-includes-power-usage-and-thermal-monitoring",
    "summary": "Nvidia's GPU fleet management software can track spikes in power usage, monitor utilization, detect hotspots, spot anomalies, identify software errors, and detect the physical location of processors. However, the software is completely optional for its clients."
  },
  {
    "title": "$40 billion-plus crypto fraud scheme results in 15-year prison sentence for its creator   nine criminal counts include wire fraud and money laundering",
    "link": "https://www.tomshardware.com/tech-industry/usd40-billion-plus-crypto-fraud-scheme-results-in-15-year-prison-sentence-for-its-creator-nine-criminal-counts-include-wire-fraud-and-money-laundering",
    "summary": "Terra Project's crypto mogul Do Kwon jailed for 15 years"
  },
  {
    "title": "Creality Falcon2 Pro 60 Watt Laser Engraver review: Deep cuts and fine engravings",
    "link": "https://www.tomshardware.com/maker-stem/creality-falcon2-pro-60-watt-laser-engraver-review",
    "summary": "The Creality Falcon2 Pro 60W is a fully enclosed diode laser engraver with multiple safety features, intuitive first-party software, and a pull-out tray for easy clean-up that can be purchased on sale for $1,899 for the Single Unit package. With the included 1.6W laser module, the Falcon2 Pro is capable of cutting through thick material as easily as it can produce detailed engravings."
  },
  {
    "title": "Germany summons Russian ambassador over GRU-linked cyberattacks   air traffic control and elections systems targeted",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/germany-summons-russian-ambassador-over-gru-linked-cyberattacks-on-atc-and-elections",
    "summary": "Germany has formally summoned Russia s ambassador in Berlin after publicly attributing a series of cyber and influence operations to Moscow s GRU military intelligence agency."
  },
  {
    "title": "Bitcoin creator Satoshi disappeared on this day 15 years ago, leaving a final public message   'I've moved on to other things,' true identity of Satoshi Nakamoto entity remains unknown",
    "link": "https://www.tomshardware.com/tech-industry/cryptocurrency/bitcoin-creator-satoshi-disappeared-on-this-day-15-years-ago-leaving-a-final-public-message-ive-moved-on-to-other-things-true-identity-of-satoshi-nakamoto-entity-remains-unknown",
    "summary": "The presumed pseudonymous Bitcoin creator, Satoshi Nakamoto, disappeared without a trace on this day in 2010."
  },
  {
    "title": "AMD, Intel, and TI are  merchants  of death  says lawyer representing Ukrainian civilians   five new suits complain that Russian drones and missiles continue to use high-tech components from these brands",
    "link": "https://www.tomshardware.com/pc-components/amd-intel-and-ti-are-merchants-of-death-says-lawyer-representing-ukrainian-civilians-five-new-suits-complain-that-russian-drones-and-missiles-continue-to-use-high-tech-components-from-these-brands",
    "summary": "Five lawsuits were filed in Texas this week, putting some of the biggest names in PC tech under an uncomfortable spotlight, as their components are still being found in Russian weaponry."
  },
  {
    "title": "Nvidia weighs expanding H200 production as new China orders rush in, report claims   ByteDance and Alibaba listed as suitors for 'large orders' in the wake of sanctions lift",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/nvidia-weighs-expanding-h200-production-as-demand-outstrips-supply",
    "summary": "Nvidia is evaluating whether to increase production of its H200 data center GPUs after demand from Chinese customers is expected to exceed current supply."
  },
  {
    "title": "Oracle reportedly delays several new OpenAI data centers because of shortages   tight material and labor supply frustrate expansion plans, possibly by a year or more",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/oracle-reportedly-delays-several-new-openai-data-centers-because-of-shortages-tight-material-and-labor-supply-frustrate-expansion-plans-possibly-by-a-year-or-more",
    "summary": "Oracle reportedly delays some of the data centers for OpenAI from 2027 to 2028, citing labor and materials shortages."
  },
  {
    "title": "Jump on $740 worth of hardware, including $410 worth of DDR5 RAM, in this $480 Newegg AM5 bundle   32GB offering also includes an X870E motherboard and even a free 240mm AIO cooler",
    "link": "https://www.tomshardware.com/pc-components/jump-on-usd740-worth-of-hardware-including-usd410-worth-of-ddr5-ram-in-this-usd480-newegg-am5-bundle-32gb-offering-also-includes-an-x870e-motherboard-and-even-a-free-240mm-aio-cooler",
    "summary": "Save money on RAM with this Newegg combo deal that pairs 32GB of DDR5 RAM with an X870E motherboard, and free 240mm AIO cooler for just $480"
  },
  {
    "title": "Intel Core Ultra 7 270K Plus and Core Ultra 9 290K Plus spotted at Indian retailer   listings appear to corroborate prior leaks but don't reveal pricing or new info for upcoming Arrow Lake refresh",
    "link": "https://www.tomshardware.com/pc-components/cpus/intel-core-ultra-7-270k-plus-and-core-ultra-9-290k-plus-spotted-at-indian-retailer-listings-appear-to-corroborate-prior-leaks-but-dont-reveal-pricing-or-new-info-for-upcoming-arrow-lake-refresh",
    "summary": "We've gotten our first retail appearance of the Arrow Lake refresh family, listed at an Indian retailer but with barely any information. The specs mentioned seem regurgitated from existing media coverage and leaks, and there's no price, but at least the vendor is promising a 3-year warranty."
  },
  {
    "title": "Huawei's latest mobile is armed with China's most advanced process node to date despite using blacklisted chipmaker   Huawei Kirin 9030 mobile SoC made on SMIC N+3 process, but can't compete with 5nm node",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/huaweis-latest-mobile-is-chinas-most-advanced-process-node-to-date-despite-using-blacklisted-chipmaker-huawei-kirin-9030-mobile-soc-made-on-smic-n-3-process-but-cant-compete-with-5nm-nodes",
    "summary": "TechInsights says Huawei's Kirin 9030 is built on SMIC s N+3 process: an incremental, DUV-based extension of its 7nm-class technology that pushes density without EUV but falls well short of true 5nm nodes amid rising yield challenges."
  },
  {
    "title": "This ginormous 28TB Seagate hard drive offers unbeatable value storage for just under  15 per TB   pre-order this shuckable external HDD for only  419.99 at Amazon",
    "link": "https://www.tomshardware.com/pc-components/external-hdds/this-ginormous-28tb-seagate-hard-drive-offers-unbeatable-value-storage-for-just-under-gbp15-per-tb-pre-order-this-shuckable-external-hdd-for-only-gbp419-99-at-amazon",
    "summary": "Seagate's 28TB Expansion HDD gives you a huge amount of backup storage for just under 15 per TB."
  },
  {
    "title": "Framework raises DDR5 RAM upgrade prices by 50% amid DRAM shortage   only for Laptop DIY edition, says prices will likely rise again",
    "link": "https://www.tomshardware.com/pc-components/ram/framework-raises-ddr5-ram-upgrade-prices-by-50-percent-amid-dram-shortage-only-for-laptop-diy-edition-says-prices-will-likely-rise-again",
    "summary": "Framework, the computer manufacturer, has recently raised the price of the DDR5 memory options available for the Framework Laptop DIY Edition by 50%."
  },
  {
    "title": "Photonic latch memory could enable optical processor caches that run up to 60 GHz, twenty times faster than standard caches   optical SRAM stores and outputs data entirely as light, but density challenges remain",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/usc-and-us-madison-researchers-debut-foundry-made-photonic-memory-latch",
    "summary": "Researchers from the University of Southern California Information Sciences Institute and the University of Wisconsin-Madison have demonstrated what they describe as the first regenerative photonic memory latch."
  },
  {
    "title": "Intel tests chipmaking tools from sanctioned China-focused tool maker, report claims   move could raise political and national security concerns, firm was backed by CEO Lip-Bu Tan's investment firm",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/intel-tests-chipmaking-tools-from-sanctioned-china-focused-tool-maker-report-claims-move-could-raise-political-and-national-security-concerns-firm-was-backed-by-ceo-lip-bu-tans-investment-firm",
    "summary": "Intel has evaluated wet etch tools from ACM Research for its 14A fabrication process, raising political and national security concerns."
  },
  {
    "title": "This $549 Acer gaming laptop is simply unbeatable value with Nvidia RTX 5050 GPU and 16GB RAM   rival model also on sale for $50 more, featuring AMD Ryzen CPU and 1200p display",
    "link": "https://www.tomshardware.com/laptops/gaming-laptops/this-usd549-acer-gaming-laptop-is-simply-unbeatable-value-with-nvidia-rtx-5050-gpu-and-16gb-ram-rival-model-also-on-sale-for-usd50-more-featuring-amd-ryzen-cpu-and-1200p-display",
    "summary": "There's a huge discount on two Acer Nitro V gaming laptops right now with one of Nvidia's latest GeForce RTX GPUs, starting from an impossible-to-beat $549."
  },
  {
    "title": "China mulls $70 billion domestic chip fabrication injection, would be largest of any government semiconductor investment   Huawei and Cambricon among candidates in push to compete with Nvidia, other U.S. firms",
    "link": "https://www.tomshardware.com/tech-industry/china-mulls-usd70-billion-domestic-chip-fabrication-injection-would-be-largest-of-any-government-semiconductor-investment-huawei-and-cambricon-among-candidates-in-push-to-compete-with-nvidia-other-u-s-firms",
    "summary": "China is considering investing up to an additional $70 billion in its domestic chip manufacturers in an effort to better compete with US firms like Nvidia. Although exact figures and investment strategies have yet to be decided, this move would be in line with China's \"whole nation\" approach to tackling its chip shortages."
  },
  {
    "title": "Acer Predator X34 X0 34-inch Mini LED 200 Hz gaming monitor review: Ultra wide, ultra fast, and ultra bright",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/acer-predator-x34-x0-34-inch-mini-led-200-hz-gaming-monitor-review",
    "summary": "The 34-inch ultra-wide genre gets a new member from Acer, the Predator X34 X0 200 Hz Mini LED Gaming Monitor. It sports 3440x1440 resolution, Adaptive-Sync Quantum Dot color, HDR 1000, and a 1500R curve."
  },
  {
    "title": "PNY's RTX 5070 GPU falls $50 below its MSRP launch price   grab one quickly via Walmart while stocks last",
    "link": "https://www.tomshardware.com/pc-components/gpus/msis-rtx-5070-gpu-falls-usd50-below-its-msrp-launch-price-grab-one-quickly-via-walmart-while-stocks-last",
    "summary": "Grab an RTX 5070 from PNY for just $499, $50 below the MSRP launch price. Limited stock available at Walmart."
  },
  {
    "title": "Here are the top ten PowerShell commands in Windows that will get you started",
    "link": "https://www.tomshardware.com/software/here-are-the-top-ten-powershell-commands-in-windows-that-will-get-you-started",
    "summary": "PowerShell is a powerful tool and if you want to be a Windows power user, you need to learn it, so here are the top ten PowerShell commands to get you started."
  },
  {
    "title": "Rivian unveils its own in-house RAP1 AI chip and ACM3 self-driving platform automaker one-ups Tesla with LiDAR support",
    "link": "https://www.tomshardware.com/tech-industry/rivian-unveils-its-own-in-house-rap1-ai-chip-and-acm3-self-driving-platform-automaker-one-ups-tesla-with-lidar-support",
    "summary": "Rivian's ACM3 module and RAP1 chip outshine Tesla with LiDAR support"
  },
  {
    "title": "Cambricon targets 500,000 AI chips in 2026 as China accelerates domestic hardware push   low yields and limited HBM supply could threaten chip ambitions",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/cambricon-targets-500000-ai-chips-in-2026-as-china-accelerates-domestic-hardware-push",
    "summary": "Cambricon Technologies is preparing one of the most aggressive production ramp-ups attempted by a Chinese AI chipmaker."
  },
  {
    "title": "Nintendo Switch 2 RAM prices rise 41%, NAND flash up 8%   console giant shares nosedive in face of increased cost warnings",
    "link": "https://www.tomshardware.com/video-games/nintendo/nintendo-switch-2-ram-prices-rise-41-percent-nand-flash-up-8-percent-console-giant-shares-nosedive-in-face-of-increased-cost-warnings",
    "summary": "Nintendo loses $14b market cap thanks to RAM shortage"
  },
  {
    "title": "'Outlet' RAM sold in Japan as new with huge markups, scuffed packaging   Crucial DDR5-5600 64GB kit commands $600 overseas as AI shortage bites",
    "link": "https://www.tomshardware.com/pc-components/ram/outlet-ram-sold-in-japan-as-new-with-huge-markups-scuffed-packaging-crucial-ddr5-5600-64gb-kit-commands-usd600-overseas-as-ai-shortage-bites",
    "summary": "Japanese retailer Sofmap offloads Crucial's Pro DDR5-5600 C46 64GB (2x32GB) memory kit for $602.74."
  },
  {
    "title": "Hoto's electric screwdriver set is a hobbyist's ultimate Christmas gift for less than  29   record-low price for 12-bit precision kit with USB-C charging, perfect for PC builds and DIY",
    "link": "https://www.tomshardware.com/desktops/pc-building/hotos-electric-screwdriver-set-is-a-hobbyists-ultimate-christmas-gift-for-less-than-gbp29-record-low-price-for-12-bit-precision-kit-with-usb-c-charging-perfect-for-pc-builds-and-diy",
    "summary": "Grab this impressive Hoto NEX O1 Pro mini electric screwdriver set with 12 bits at a record-low price"
  },
  {
    "title": "Chinese government wades into Dutch chipmaker dispute   presses Netherlands to resolve Nexperia saga as supply concerns grow",
    "link": "https://www.tomshardware.com/tech-industry/china-presses-netherlands-to-resolve-nexperia-dispute-as-supply-concerns-grow",
    "summary": "China has called on the Netherlands to move quickly to resolve the dispute surrounding Nexperia after months of supervision measures and a retaliatory export freeze disrupted shipments of components."
  },
  {
    "title": "Asus' new 5K gaming monitor is so high-end it doesn't even officially support RTX 40-series GPUs   the XG27JCG is a 5K 180Hz beast with 330Hz 1440p dual-mode support",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/asus-new-5k-gaming-monitor-is-so-high-end-it-doesnt-even-officially-support-rtx-40-series-gpus-the-xg27jcg-is-a-5k-180hz-beast-with-330hz-1440p-dual-mode-support",
    "summary": "Asus is betting on overpriced GPUs in this ultra high-res and high refresh rate pairing, dubbed the \"XG27JCG,\" a new 5K 180 Hz monitor that can only run on Nvidia's RTX 50-series, officially, or AMD's RX 7600 and up. It supports all the gaming features you could ever want, along with solid color accuracy and HDR support."
  },
  {
    "title": "CyberPower's Supreme gaming PC packs 64GB of DDR5-6400 RAM and an RTX 5080 GPU for $2499   that's $700+ of RAM in today's market",
    "link": "https://www.tomshardware.com/desktops/gaming-pcs/cyberpowers-supreme-gaming-pc-packs-64gb-of-ddr5-6400-ram-and-an-rtx-5080-gpu-for-usd2499-thats-usd700-of-ram-in-todays-market",
    "summary": "Procure yourself a gaming PC before the RAM prices push prebuilt rigs beyond reach. CyberPower's Supreme gaming PC with RTX 5080 and 64GB of DDR5-6400 RAM is reduced to $2499."
  },
  {
    "title": "ASRock X870E Taichi OCF Motherboard Review: The right formula for extreme AMD overclocking",
    "link": "https://www.tomshardware.com/pc-components/motherboards/asrock-x870e-taichi-ocf-motherboard-review",
    "summary": "ASRock s X870E Taichi OCF is a well-designed motherboard full of high-end features and tools for manual overclocking."
  },
  {
    "title": "Intel fails to get EU antitrust ruling overturned in longstanding 16-year AMD competition case   chipmaker sees $1.2 billion fine reduced to $278 million",
    "link": "https://www.tomshardware.com/pc-components/cpus/intel-fails-to-get-eu-antitrust-ruling-overturned-in-longstanding-16-year-amd-competition-case-chipmaker-sees-usd1-2-billion-fine-reduced-to-usd278-million",
    "summary": "Intel lost its challenge to overturn an EU antitrust ruling on Wednesday, meaning it now faces a fine of $278 million."
  },
  {
    "title": "TSMC ponders upgrading 2nd Japan fab to 4nm   could pave the way for more advanced chips for Japanese customers (Updated)",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/tmsc-ponders-upgrading-2nd-japan-fab-to-4nm-could-pave-the-way-for-more-advanced-chips-for-japanese-customers",
    "summary": "TSMC reportedly mulls making 4nm chips in Japan amid putting construction of Fab 23 phase 2 on pause."
  },
  {
    "title": "Biwin Black Opal OC Lab Gold Edition DDR5-6000 C28 4x48GB Review: High-Performance Memory For Demanding Applications",
    "link": "https://www.tomshardware.com/pc-components/ram/biwin-black-opal-oc-lab-gold-edition-ddr5-6000-c28-4x48gb-review",
    "summary": "Biwin launches a very special DDR5-6000 192GB memory kit from its OC labs. Can the spacious memory kit outperform the current competition on the market?"
  },
  {
    "title": "UC Berkeley Ph.D. candidate busted repeatedly sabotaging rival student's computer, causing $46,000 in damages   hidden camera sting catches perp causing \"sparks to fly out of the laptop,\" student arrested on three felony counts",
    "link": "https://www.tomshardware.com/laptops/uc-berkeley-ph-d-candidate-busted-by-hidden-camera-repeatedly-sabotaging-rival-students-computer-arrested-on-three-felony-counts-may-have-caused-usd46-000-in-damage",
    "summary": "PhD student rivalry extends to repeated physical laptop damage, hidden camera shows."
  },
  {
    "title": "Score a new Bambu Lab 3D printer for as little as  149 in this massive UK end-of-year sale   savings include up to 20% off printers and 46% off filament, ready for Christmas",
    "link": "https://www.tomshardware.com/3d-printing/score-a-new-bambu-lab-3d-printer-for-as-little-as-gbp149-in-this-massive-uk-end-of-year-sale-savings-include-up-to-20-percent-off-printers-and-46-percent-off-filament-ready-for-christmas",
    "summary": "Save on these top 3D printers this Christmas in Bambu Lab's end-of-year sale"
  },
  {
    "title": "RAM scalping takes hold on eBay, some DDR5 selling for more than $2,000   price-gouged kits fetch 7x their original value, adding almost double the markup on already inflated prices",
    "link": "https://www.tomshardware.com/pc-components/ram/ram-scalping-takes-hold-on-ebay-some-kits-selling-for-more-than-usd2-000-price-gouged-kits-fetch-7x-their-original-value-adding-almost-double-the-markup-on-already-inflated-prices",
    "summary": "Scalpers exploit the memory shortage to sell memory kits at exorbitant prices on platforms like eBay."
  },
  {
    "title": "Microsoft, Google, OpenAI, and Anthropic join forces to form Agentic AI alliance, according to report   organization backed by the Linux Foundation is set to create open source standards for AI agents",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/microsoft-google-openai-and-anthropic-join-forces-to-form-agentic-ai-alliance-according-to-report-organization-backed-by-the-linux-foundation-is-set-to-create-open-source-standards-for-ai-agents",
    "summary": "The world's leading AI firms are collaborating on a new Agentic Artificial Intelligence Foundation managed by the Linux Foundation to build open standards around AI agents. The move will focus on three key open source tools to begin with, sharing findings on technical problems."
  },
  {
    "title": "Dev gambles on 'obviously fake' $8K Grace Hopper system, scores $80,000 worth of hardware on Reddit for one-tenth of the cost   buyer's haul includes 960GB of DDR5 RAM worth more than what he paid for the entire rig",
    "link": "https://www.tomshardware.com/desktops/servers/developer-gambles-on-obviously-fake-usd8k-grace-hopper-system-scores-usd80-000-worth-of-hardware-on-reddit-for-one-tenth-of-the-cost-buyers-haul-includes-960gb-of-ddr5-ram-worth-more-than-what-he-paid-for-the-entire-rig",
    "summary": "This used Nvidia Grace Hopper system price seemed unbelievable. But it required a lot of cleaning and intricate work to get it running smoothly."
  },
  {
    "title": "Prusa brings Noctua's iconic beige and brown to 3D printer nozzleheads everywhere   accurately matching 3D printed parts to Noctua gear is now trivial",
    "link": "https://www.tomshardware.com/tech-industry/prusa-brings-noctuas-iconic-beige-and-brown-to-nozzleheads-everywhere-accurately-matching-3d-printed-parts-to-noctua-gear-is-now-trivial",
    "summary": "Prusa releases Noctua color-matched 3D printing filaments"
  },
  {
    "title": "Basement AI lab captures 10,000 hours of brain scans to train thought-to-text AI models   largest known neural dataset collected from thousands of humans over six months",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/basement-lab-produces-10000-hours-of-neural-data-for-thought-to-text-research",
    "summary": "Conduit says it has collected roughly 10,000 hours of noninvasive neural data from thousands of unique individuals in a basement studio."
  },
  {
    "title": "China starts list of government-approved AI hardware suppliers: Cambricon and Huawei are in, Nvidia is not",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/china-starts-list-of-government-approved-ai-hardware-suppliers-cambricon-and-huawei-are-in-nvidia-is-not",
    "summary": "Chinese government began to add government-approved AI suppliers to the Information Technology Innovation List in a bid to accelerate deployment of domestic hardware. But can Chinese semiconductor industry satisfy the needs of domestic AI industry?"
  },
  {
    "title": "User reports claim December Windows 11 security update fixes AMD GPU hanging and driver crashing",
    "link": "https://www.tomshardware.com/software/windows/user-reports-claim-december-windows-11-security-update-fixes-amd-gpu-hanging-and-driver-crashing",
    "summary": "A multitude of AMD GPU owners claim the December security update for Windows 11 has fixed GPU hanging and driver crashing, primarily on RX 9000 series GPUs."
  },
  {
    "title": "Framework puts Dell and Apple on blast over egregious RAM prices   modular laptop maker will be forced to increase memory prices, but won't \"gouge customers\" like other vendors",
    "link": "https://www.tomshardware.com/laptops/framework-puts-dell-and-apple-on-blast-over-egregious-ram-prices-modular-laptop-maker-will-be-forced-to-increase-memory-prices-but-wont-gouge-customers-like-other-vendors",
    "summary": "Memory prices are rising everywhere, and the latest to be hit in the aftermath of this crisis is modular laptop manufacturer Framework, which just announced its own price hike in a very interesting fashion. The company replied to a tweet showing Dell's allegedly insane markup on RAM upgrades that later turned out to be incorrect."
  },
  {
    "title": "Bambu Lab's end-of-year sale is live with up to 35% off   score huge discounts on 3D printers and accessories while you can",
    "link": "https://www.tomshardware.com/3d-printing/bambu-labs-end-of-year-sale-is-live-with-up-to-35-percent-off-score-huge-discounts-on-3d-printers-and-accessories-while-you-can",
    "summary": "Save on some of the best 3D printers in Bambu Lab's end-of-year sale"
  },
  {
    "title": "The Nvidia H200 export saga, as it happened    Beijing ponders response and buyers line up, while Blackwell remains locked behind restrictions",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/us-eases-nvidia-export-restrictions-h200-cleared-for-china-under-tight-controls",
    "summary": "The U.S. government has formally approved the export of Nvidia s high-performance H200 AI chips to China, reinstating access to a class of silicon previously barred under national security rules."
  },
  {
    "title": "Nvidia decries 'far-fetched' reports of smuggling in face of DeepSeek training reports   unnamed sources claim Chinese company is involved in Blackwell smuggling ring",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/nvidia-decries-far-fetched-reports-of-smuggling-in-face-of-deepseek-training-reports-unnamed-sources-claim-chinese-company-is-involved-in-blackwell-smuggling-ring",
    "summary": "DeepSeek is allegedly involved in a \"phantom data center\" smuggling scheme to get Blackwell GPU servers into China as part of training its newest LLM generation. While Nvidia refutes the claims as \"farfetched\", some proof indicates otherwise."
  },
  {
    "title": "UP Xtreme ARL AI Dev Kit review   Benchmarks and AI workloads on an Intel Core Ultra 5 225H Arrow Lake SBC",
    "link": "https://www.cnx-software.com/2025/12/14/up-xtreme-arl-ai-dev-kit-review-benchmarks-and-ai-workloads-on-an-intel-core-ultra-5-225h-arrow-lake-sbc/",
    "summary": "That s the last part of my review of three Intel-based UP AI development kits, and after testing the UP TWL AI Dev Kit with an Intel N150 CPU and the UP Squared Pro TWL AI Dev Kit with an Intel N150 CPU coupled with an Hailo-8L M.2 AI accelerator, I ll now report my experience with the high-end UP Xtreme ARL AI Dev Kit with a 14-core Intel Core Ultra 5 225H Arrow Lake single board computer with Intel Arc 130T graphics delivering up to a combined 83 TOPS of AI performance. I ve followed the same procedure as with the previous models, using the pre-installed Ubuntu 24.04 Pro operating system to report system information, run some benchmarks, and go through AI workloads using Nx Meta and the AAEON UP AI Toolkit system. It just ran additional benchmarks and tests since it s my first Intel Arrow Lake platform. UP Xtreme ARL system [...] The post UP Xtreme ARL AI Dev Kit review Benchmarks and AI workloads on an Intel Core Ultra 5 225H Arrow Lake SBC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "CIX releases P1 CPU TRM and developer guides for GPU, AI accelerator, OS and firmware/BIOS",
    "link": "https://www.cnx-software.com/2025/12/13/cix-releases-p1-cpu-trm-and-developer-guides-for-gpu-ai-accelerator-os-and-firmware-bios/",
    "summary": "CIX has finally released the technical reference manual (TRM) for the P1 (CD8180/CD8160) Arm Cortex-A720/A520 SoC, along with developer guides for the GPU (Arm Immortalis G720 and NVIDIA/AMD discrete graphics cards), the AI accelerator, as well as OS (Android, Linux, and Windows) and firmware (BIOS) installation and development. A slow (but steady?) progress There was a lot of excitement when the Radxa Orion O6 mini-ITX motherboard was introduced in December 2024, as we were told the CIX P1 12-core Armv9 processor would offer performance similar to Apple M1 SoC and Qualcomm 8cx Gen3 platform, at an affordable price ($199 and up for the mini-ITX board), and software support would include a Debian image, full UEFI via an open-source EDKII implementation, as well as an SDK along with hardware and software documentation, community forum support, and regular firmware & OS updates. CIX was even called a native open source ecosystem chip [...] The post CIX releases P1 CPU TRM and developer guides for GPU, AI accelerator, OS and firmware/BIOS appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Diptyx E-Reader   An open-source, ESP32-powered, dual-screen e-book reader (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/12/diptyx-e-reader-an-open-source-esp32-powered-dual-screen-e-book-reader/",
    "summary": "There are plenty of e-book readers on the market, but the Diptyx E-Reader feels more like a proper book since it features two e-paper displays that can be folded or opened thanks to a custom-made plastic enclosure. While it s powered by an ESP32-S3 wireless module with a PCB antenna, both WiFi and Bluetooth are disabled in the firmware, and instead, users can load EPUB files through the reader s USB Type-C port. The combination of an automatic standby mode (using deep sleep) and e-ink displays enables the dual-screen device to run for weeks on a single charge. Two buttons are used to access the next or previous page, and a third one powers the device up in a few seconds. Diptyx E-Reader specifications: Wireless module ESP32-S3-WROOM-1 SoC Espressif Systems ESP32-S3-N16R8 CPU ESP32-S3 dual-core LX7 microprocessor @ up to 240 MHz with Vector extension Memory 8MB PSRAM Storage [...] The post Diptyx E-Reader An open-source, ESP32-powered, dual-screen e-book reader (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Renesas RA6W1/RA6W2 Cortex-M33 wireless MCUs offer dual-band Wi-Fi 6, BLE, Matter, 15-year availability",
    "link": "https://www.cnx-software.com/2025/12/12/renesas-ra6w1-ra6w2-cortex-m33-wireless-mcus-offer-dual-band-wi-fi-6-ble-matter-15-year-availability/",
    "summary": "Renesas has added the RA6W1 (Wi-Fi 6) and the RA6W2 (Wi-Fi 6 + BLE) MCUs to its high-performance RA6 family, adding dual-band Wi-Fi 6 and Bluetooth LE, as well as Matter connectivity to the series. Both models feature a 160 MHz Arm Cortex-M33 core, dual-band Wi-Fi 6 with WPA3 security, on-chip PA/LNA/RF switch, and a full TCP/IP stack for fast connectivity. They integrate up to 704 KB SRAM, 256 KB ROM, and support eMMC/SD, O-QSPI, and QSPI for external flash and/or PSRAM. The series also includes generic peripherals like SPI, I C, I S/PDM, SDIO, 12-bit ADCs, PWM timers, and up to 28 GPIOs. Offered in compact QFN/WLCSP packages, the RA6W1/2 MCUs target smart home, wearables, industrial, and consumer IoT markets where long battery life and wireless connectivity are essential. Renesas RA6W1 specifications: MCU core Arm Cortex-M33 @ up to 160 MHz, Armv8-M architecture with MPU and SysTick Memory & Storage [...] The post Renesas RA6W1/RA6W2 Cortex-M33 wireless MCUs offer dual-band Wi-Fi 6, BLE, Matter, 15-year availability appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "nRF9151 SMA DK development kit offers cellular IoT, DECT NR+, and 5G NTN satellite connectivity",
    "link": "https://www.cnx-software.com/2025/12/12/nrf9151-sma-dk-development-kit-offers-cellular-iot-dect-nr-and-5g-ntn-satellite-connectivity/",
    "summary": "Nordic Semiconductor s nRF9151 SMA DK development kit is designed for building IoT applications using LTE-M/NB-IoT cellular IoT, DECT NR+, or 5G NTN (Non-Terrestrial Network) satellite connectivity. The development kit offers three ways to connect a SIM card, namely a NanoSIM card slot, an MFF2 SIM footprint for eSIM or software iSIM, and a 10-pin SIM connector. It also includes two SMA connectors for GPS and LTE antennas or lab equipment, multiple current measurement connectors, and Arduino UNO headers for expansion, notably the nRF7002 EK for adding Wi-Fi 6 locationing capabilities. nRF9151-SMA-DK specifications: Wireless System-in-Package Nordic Semi nRF9151 CPU Arm Cortex-M33 @ 64 MHz Memory 256KB RAM Storage 1MB flash Connectivity Multimode LTE-M/NB-IoT/NB-NTN modem with DECT NR+ support and GNSS. 700-2200 MHz LTE band support. Power Class 5 20 dBm Power Class 3 23 dBm 1.9 GHz and 915 Mhz DECT NR+ band support Security Arm [...] The post nRF9151 SMA DK development kit offers cellular IoT, DECT NR+, and 5G NTN satellite connectivity appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "UP Squared Pro TWL AI Dev Kit Review   Intel N150 + Hailo-8L accelerator tested on Ubuntu 24.04",
    "link": "https://www.cnx-software.com/2025/12/11/up-squared-pro-twl-ai-dev-kit-review-intel-n150-hailo-8l-accelerator-tested-on-ubuntu-24-04/",
    "summary": "I ve been asked to review three Intel-based UP AI development kits running Ubuntu 24.04 Pro. Last time, I tested the UP TWL SBC with Nx Meta and UP AI Toolkit, and most AI workloads would pass, but since these were running on the Intel N150 CPU or GPU, the performance was not optimal for most. I ll now switch to the UP Squared Pro TWL mid-range AI devkit review with another Intel Processor N150 SBC fitted with a 13 TOPS Hailo-8L M.2 AI accelerator. Both the UP TWL and UP Squared Pro TWL come with a 64GB eMMC flash, and I found out it was rather tight since AI software and models can take a lot of space. The UP Squared Pro TWL has a few M.2 sockets, so I ll install an NVMe SSD to expand storage before installing the UP AI toolkit. As usual, I ll run a few benchmarks and [...] The post UP Squared Pro TWL AI Dev Kit Review Intel N150 + Hailo-8L accelerator tested on Ubuntu 24.04 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Up to 16-core AMD EPYC Embedded 2005 Series Zen 5 processors support up 28 PCIe Gen5 lanes, offer 10-year availability",
    "link": "https://www.cnx-software.com/2025/12/11/up-to-16-core-amd-epyc-embedded-2005-series-zen-5-processors-support-up-28-pcie-gen5-lanes-offer-10-year-availability/",
    "summary": "After the release of the high-performance EPYC Embedded 9005, AMD has now introduced the EPYC Embedded 2005 Series, a mid-range processor family also based on the Zen 5 architecture and designed for space-constrained networking, storage, and industrial edge applications. The new SoCs feature up to 16 cores (32 threads) with 64 MB L3 cache, support dual-channel DDR5-5600 memory with ECC, and offer 28 lanes of PCIe Gen5 connectivity. It also supports advanced RAS capabilities, BMC, PCIe Hot Plug, multi-SPI ROM, and AMD Infinity Guard security. The processors come in a compact 40 x 40mm BGA package, which, according to AMD, is up to 2.4x smaller than competing enterprise solutions (Intel Xeon 6500P-B). Yet, they are designed for 24/7 operation, with up to 10 years of availability with full open-source software support. These features make it suitable for networking switches/routers, cold storage systems, aerospace, robotics, and other high-reliability embedded infrastructure. EPYC [...] The post Up to 16-core AMD EPYC Embedded 2005 Series Zen 5 processors support up 28 PCIe Gen5 lanes, offer 10-year availability appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "iWave Systems iG-RainboW-G69M TI AM62L OSM Size-S system-on-module powers Raspberry Pi-sized SBC",
    "link": "https://www.cnx-software.com/2025/12/11/iwave-systems-ig-rainbow-g69m-ti-am62l-osm-size-s-system-on-module-powers-raspberry-pi-sized-sbc/",
    "summary": "Yesterday, I wrote about the Beacon AM62L SoM, one of the first system-on-module based on Texas Instruments AM62L dual-core Cortex-A53 SoC for low-power IoT and HMI applications. It turns out there s another AM62L module compliant with the OSM Size-S standard, along with a Raspberry Pi-sized carrier board. iWave Systems iG-RainboW-G69M is a 30x30mm CPU module with 1GB or 2GB LPDDR4, 8GB eMMC flash by default, and 332 LGA contacts exposing interfaces such as RGB LCD and MIPI CSI display interfaces, dual gigabit Ethernet, I2S audio, USB 2.0 interfaces, and a range of low-speed I/Os. iWave Systems iG-RainboW-G69M specifications: SoC Texas Instruments AM62Lx CPU Dual-core Arm Cortex-A53 processor up to 1.25GHz Cache 32KB L1 D-cache, 32KB L1 I-cache per core; shared 256KB L2 cache System Memory 1GB LPDDR4, expandable up to 2GB Storage 8GB eMMC flash (other capacities available upon request) 32Kbit EPPROM 332 LGA contacts Storage [...] The post iWave Systems iG-RainboW-G69M TI AM62L OSM Size-S system-on-module powers Raspberry Pi-sized SBC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "IoT HDMI switch   An ESP32-C3-powered 2-source HDMI switch automated with Home Assistant",
    "link": "https://www.cnx-software.com/2025/12/11/iot-hdmi-switch-an-esp32-c3-powered-2-source-hdmi-switch-automated-with-home-assistant/",
    "summary": "Designed by Guimpt in Spain, the IoT HDMI Switch is an ESP32-C3-based open-source HDMI switch that integrates with Home Assistant and ESPHome to automate up to two HDMI inputs for TVs, monitors, or projectors. It targets smart home setups that need seamless source switching without manually handling cables. It includes a 3D-printed enclosure for a compact install behind media equipment. The device also offers open hardware and firmware for easy upgrade, and it lets users switch inputs via phone, voice assistant, or a button. It also supports automations such as automatically selecting a game console or media player. It works with common HDMI devices like Chromecast, Raspberry Pi, PCs, and consoles, making it ideal for smart home enthusiasts, DIY tinkerers, and anyone who wants a hands-free media setup. IoT HDMI Switch specifications: SoC Espressif Systems ESP32-C3FH4 Single-core 32-bit RISC-V microcontroller @ up to 160 MHz Memory 400 KB [...] The post IoT HDMI switch An ESP32-C3-powered 2-source HDMI switch automated with Home Assistant appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "AMD Ryzen Embedded 8840U COM Express Type 6 Compact module takes up to 128GB DDR5",
    "link": "https://www.cnx-software.com/2025/12/10/amd-ryzen-embedded-8840u-com-express-type-6-compact-module-takes-up-to-128gb-ddr5/",
    "summary": "SolidRun has unveiled a new COM Express Type 6 Compact module powered by the AMD Ryzen Embedded 8840U Series with up to 39 TOPS of AI performance for industrial, medical, automation, and edge AI applications. The module supports up to 128GB DDR5 of memory via two SO-DIMM sockets, on-module M.2 NVME SSD storage, and features an Intel i226 2.5GbE controller. It exposes I/Os through standard board-to-board connectors, including 16-lane PCIe Gen4, four DisplayPort video outputs, eDP or LVDS display interface, two SATA, various USB ports, and more. Ryzen R8000 CoM6 specifications: SoC AMD Ryzen Embedded 8840U CPU 8-core/16-thread Zen4 processor up to 3.3 GHz / 5.1 GHz (Turbo) GPU AMD Radeon 780M with 12x Compute Units @ 2700 MHz (RDNA3 graphics) AI 16 TOPS NPU (AMD XDNA) Total combined 39 TOPS of AI performance Memory 2x SODIMM DDR5-5600 with/without ECC up to 128GB RAM Storage [...] The post AMD Ryzen Embedded 8840U COM Express Type 6 Compact module takes up to 128GB DDR5 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "STEVAL-ROBKIT1   A robot evaluation kit based on STM32H725 and STM32G0 microcontrollers",
    "link": "https://www.cnx-software.com/2025/12/10/steval-robkit1-a-robot-evaluation-kit-based-on-stm32h725-and-stm32g0-microcontrollers/",
    "summary": "The STEVAL-ROBKIT1 is an evaluation kit for robotics applications based on ST s STM32H725 and STM32G0 Arm microcontrollers. It s the first such robot kit from the company, and it targets both traditional engineering teams, educators, and students. The kit features an STM32H725 main board, an STM32G0 motor-control PCB, and a 1.53MP camera + ToF sensor module, as well as a robotic frame, wheels, and motors with encoders. It does not require a soldering iron for assembly to make it easier for students. STEVAL-ROBKIT1 key components and features: Main board STEVAL-ROBKIT1-1 SoC STMicro STM32H725IGT6 Arm Cortex-M7 microcontroller @ 550 MHz with 1MB flash, 564 KB SRAM with ECC Wireless BlueNRG-M2 Bluetooth LE 5.2 SoC Sensors 6-axis IMU (LSM6DSV16BX) Magnetometer (LIS2MDL) Microphone (MP34DT06J) Expansion 40-pin Raspberry Pi-like header Motor control board STEVAL-ROBKIT1-2 SoC STMicro STM32G071CBT6 Arm Cortex-M0+ microcontroller at 64 MHz with 128 KB flash, 36KB SRAM Motor [...] The post STEVAL-ROBKIT1 A robot evaluation kit based on STM32H725 and STM32G0 microcontrollers appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "52Pi UPS Gen 6 UPS for Raspberry Pi 4/5 supports up to 4x external battery packs, PikaPython scripting",
    "link": "https://www.cnx-software.com/2025/12/10/52pi-ups-gen-6-ups-raspberry-pi-hat-supports-up-to-4x-external-battery-packs-pikapython-scripting/",
    "summary": "The 52Pi UPS Gen 6 is another UPS solution for the Raspberry Pi 5 that supports external battery packs for long-duration projects, and uses I C plus PikaPython scripting to manage power settings and safe shutdowns. Designed for the Raspberry Pi 5 and 4B, the module mounts on the bottom of the board and delivers power via pogo pins. It also includes an aluminum heatsink with an automatic fan for cooling. It runs on two 18650 batteries, which can be mounted to the Pi with spacers, and there is an option to add three more battery packs in parallel if you need longer runtime. The board also features a physical power button for manual control, a 12V power interface for SATA hard drives, and switching hardware (bumpless power transfer) that instantly falls back to battery power so the system stays on during a power outage. 52Pi UPS Gen 6 specifications: Main [...] The post 52Pi UPS Gen 6 UPS for Raspberry Pi 4/5 supports up to 4x external battery packs, PikaPython scripting appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Beacon AM62L   A compact (38x28mm), low-power dual-core Cortex-A53 System-on-Module (SoM)",
    "link": "https://www.cnx-software.com/2025/12/10/beacon-am62l-a-compact-38x28mm-low-power-dual-core-cortex-a53-system-on-module-som/",
    "summary": "Beacon EmbeddedWorks has announced a compact (38x28mm) System-on-Module (SoM) based on the recently introduced low-power Texas Instruments Sitara AM62L dual-core Cortex-A53 SoC designed for IoT, HMI, and general-purpose applications requiring a display. The AML62L SoM features LPDDR4 or DDR4 memory, an 8-bit eMMC flash, and an optional WiFi 5 and Bluetooth 5.0 LE module. All I/Os are exposed through two board-to-board connectors, including RGB LCD or MIPI DSI display interface, two gigabit Ethernet interfaces with TSN support, USB 2.0, CAN FD, analog inputs, and more. Beacon AM62L specifications: SoC Texas Instruments AM62L dual-core Arm Cortex-A53 processor up to 1.25GHz; 5600 DMIPS System Memory LPDDR4, DDR4 Storage 8-bit eMMC flash Wireless 802.11ax WiFi 6 1 1 and Bluetooth 5.0 LE; cnxsoft: 802.11ax is WiFi 6, but the company only mentions support for WiFi 5 in other parts of the description. 2x board-to-board connector Storage 2x 4-bit SD/SDIO [...] The post Beacon AM62L A compact (38x28mm), low-power dual-core Cortex-A53 System-on-Module (SoM) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "7.3-inch full color e-paper wooden photo frame is designed for the Raspberry Pi Zero",
    "link": "https://www.cnx-software.com/2025/12/09/7-3-inch-full-color-e-paper-wooden-photo-frame-is-designed-for-the-raspberry-pi-zero/",
    "summary": "Waveshare RPi-Zero-PhotoPainter-ACCE is a 7.3-inch color e-paper photo frame designed for the Raspberry Pi Zero family. It s an 800 480 resolution display based on E-Ink Spectra 6 (E6), and housed in a wooden frame. The display also features an RTC with backup battery support, a LiPo battery connector with UPS circuitry , a USB-C port for power, a 3-pin debug/serial header, a power button, and a charging LED. It supports portrait and landscape orientation on the desk thanks to a rotatable stand and wall mounting through a hook hanger. RPi-Zero-PhotoPainter-ACCE specifications: Display E-Ink Spectra 6 (E6) Full-color display with Black, White, Green, Blue, Red, and Yellow Resolution 800 480 pixels Pixel Pitch 0.2 x 0.2mm Viewing Angle > 170 Refresh Time Full refresh 12s Partial refresh Not supported Grayscale Two shades of gray Dimensions 160 x 96mm Expansion 40-pin HAT connector to connect Raspberry [...] The post 7.3-inch full color e-paper wooden photo frame is designed for the Raspberry Pi Zero appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "FlashESP is an all-in-one web-based tool for ESP32/ESP8266 Arduino development and firmware flashing",
    "link": "https://www.cnx-software.com/2025/12/09/flashesp-is-an-all-in-one-web-based-tool-for-esp32-esp8266-arduino-development-and-firmware-flashing/",
    "summary": "FlashESP is a web-based tool allowing the development of Arduino sketches and firmware flashing for ESP32 and ESP8266 hardware platforms. I initially thought it was similar to ESP Web Tools for flashing firmware from the web and used by projects like ESPHome, but it goes further than that, and it looks like an Arduino Cloud Editor for ESP32/ESP8266 instead, since users can select boards, write code, load libraries, and flash the resulting firmware from a compatible web browser without installing anything else on their computer. FlashESP key features: Cloud Compilation Real-time compilation with live logs. Auto Configuration Intelligent board and library detection. One-Click Flash Web Serial integration. Connect your ESP via USB and flash directly from a compatible browser (WebSerial support needed) without any drivers or downloads. Public Explorer Discover community projects. Flexible Visibility Create private projects for your team, public for the world, or [...] The post FlashESP is an all-in-one web-based tool for ESP32/ESP8266 Arduino development and firmware flashing appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Radxa C200 Orin Developer Kit   An NVIDIA Jetson Orin NX 8GB devkit with three M.2 PCIe 4.0 slots",
    "link": "https://www.cnx-software.com/2025/12/09/radxa-c200-orin-developer-kit-an-nvidia-jetson-orin-nx-8gb-devkit-with-three-m-2-pcie-4-0-slots/",
    "summary": "The Radxa C200 is a compact developer kit built around the NVIDIA Jetson Orin NX 8GB module. It features three PCIe 4.0 NVMe slots and 117 TOPS AI Super Mode for high-speed storage expansion, fast-bootable SSDs, and data-intensive AI workloads. It supports 8GB LPDDR5 memory, two M.2 M-Key slots (PCIe 4.0 x2/x4) for NVMe storage or other expansion, and an M.2 E-key (PCIe 4.0 x1) slot for Wi-Fi/BT or other compatible modules. Ports include DisplayPort 1.2 video output, four USB 3.2 Gen2 Type-A ports, a USB Type-C port with recovery mode, Gigabit Ethernet, two MIPI CSI interfaces, and a 40-pin GPIO header. Additional features include CAN bus, PoE headers, RTC battery, and a PWM fan connector, extending system integration options. Radxa C200 Orin Developer Kit specifications: SoM NVIDIA Jetson Orin NX 8GB module CPU 6-core Arm Cortex-A78AE v8.2 64-bit CPU, 1.5MB L2 cache + 4MB L3 cache de [...] The post Radxa C200 Orin Developer Kit An NVIDIA Jetson Orin NX 8GB devkit with three M.2 PCIe 4.0 slots appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "NestDisk   An Intel N150 NAS, mini PC, and AI Box with four M.2 PCIe slots",
    "link": "https://www.cnx-software.com/2025/12/08/nestdisk-an-intel-n150-nas-mini-pc-and-ai-box-with-four-m-2-pcie-slots/",
    "summary": "Youyeetoo NestDisk in an Intel N150 mini PC that can be used as a mini NAS or AI box, thanks to four M.2 PCIe slots that can be fitted with NVMe SSDs or AI accelerator cards and two 2.5GbE network ports. The computer features 12GB LPDDR5 of memory, a 64GB eMMC flash, two HDMI 2.1 ports, a headphone jack, WiFi 6 connectivity, a full-function USB-C port, and three USB 3.2 ports. It s not a fanless design, since it s actively cooled with a 30mm internal silent fan , and an external USB dual fan accessory is available as an option. NestDisk specifications: SoC Intel Processor N150 (default) Quad-core Twin Lake processor @ up to 3.6 GHz (Turbo) with 6MB cache GPU 24EU Intel UHD graphics @ 1000 MHz Options for Processor N250, N350, or N350 CPUs (but not for sale yet) Memory 12GB LPDDR5 (option for 6GB, 16GB); note: soldered [...] The post NestDisk An Intel N150 NAS, mini PC, and AI Box with four M.2 PCIe slots appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Quarky Intellio   A LEGO-compatible AI, Augmented Reality, and IoT learning platform (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/08/quarky-intellio-lego-compatible-ai-augmented-reality-iot-learning-platform/",
    "summary": "Quarky Intellio is an ESP32-S3-based development kit designed as an educational platform for learning AI, Augmented Reality (AR), and IoT concepts. It is compatible with LEGO bricks and targets users aged 10 and older. The core AI-AR module features an SPI TFT display interface, a 5MP camera, a speaker and microphone, a microSD card slot for data storage, a USB-C port for programming and charging, servo and GPIO expansion ports, and a 1,000 mAh battery. The company offers a discovery kit with the core module only as well as a rover car kit, and since it s compatible with LEGO, users can easily create their own robot. Quarky Intellio specifications: Core module Espressif Systems ESP32-S3-WROOM-1-N16R8 SoC ESP32-S3 CPU Dual-core LX7 processor with up to 240MHz Memory 512KB SRAM, 8MB PSRAM (SiP) Storage 384KB ROM Wireless WiFi 4 802.11b/g/n and Bluetooth 5.0 LE Storage 16MB flash [...] The post Quarky Intellio A LEGO-compatible AI, Augmented Reality, and IoT learning platform (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Nordic nRF7002 EBII adds dual-band Wi-Fi 6 to nRF54L series development kits",
    "link": "https://www.cnx-software.com/2025/12/08/nordic-nrf7002-ebii-adds-dual-band-wi-fi-6-to-nrf54l-series-development-kits/",
    "summary": "Nordic has introduced the nRF7002 EBII as an updated Wi-Fi 6 expansion board for its nRF54L series development kits. The earlier nRF7002 WiFi 6 board was a low-cost add-on for the Thingy:53, mainly for basic prototyping. The new EBII is designed for the newer nRF54L series of SoCs with dual-band Wi-Fi 6 support, power-profiling options, and more. Built around the nRF7002 Wi-Fi Companion IC, it supports Wi-Fi 6 features such as TWT, OFDMA, and BSS coloring for power efficiency and reduced interference. The EBII communicates with nRF54L15 and nRF54LM20 DKs through SPI/QSPI host interfaces, and includes headers for power profiling. Additionally, it features an onboard chip antenna, supports both STA and SoftAP modes, and maintains backward compatibility with 802.11a/b/g/n/ac. These features make it suitable for low-power multiprotocol IoT devices in smart homes, Matter, industrial sensing, wearables, and connected health applications. nRF7002 Expansion Board II specifications: Wi-Fi Companion IC Nordic nRF7002 [...] The post Nordic nRF7002 EBII adds dual-band Wi-Fi 6 to nRF54L series development kits appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "YumiAI: An AI-Native End-to-End Hardware Innovation Platform For Embedded Engineers (Sponsored)",
    "link": "https://www.cnx-software.com/2025/12/08/yumiai-an-ai-native-end-to-end-hardware-innovation-platform-for-embedded-engineers/",
    "summary": "Anyone who has designed a custom ESP32 board or an RK3588 carrier knows the real bottleneck isn t creativity it s the grunt work. Finding components that are actually in stock, checking pin compatibility, verifying footprints, building symbols, and dealing with yet another NRND surprise. It slows down even simple projects. A Multi-Agent System Built for Hardware Workflows YumiAI is a multi-agent engineering stack with the following features: Function Definition Agent: interprets requirements ( STM32WL LoRaWAN node, USB-C power ) and structures them into a proper engineering spec. Component Selection Agent: pulls real-time availability and pricing from DigiKey, Mouser, and LCSC. PCB Schematic Agent: generate circuit schematics using factory rules from a decade of manufacturing data to avoid unbuildable designs. The Killer Feature Today: Idea Validation While the schematic/PCB engine is still in active testing and complex designs will require manual review the market and business layers are already production-ready. Before spending [...] The post YumiAI: An AI-Native End-to-End Hardware Innovation Platform For Embedded Engineers (Sponsored) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "AQEX qUPS-P-BC-2.0 UPS HAT works with large capacity, multi-chemistry batteries (Li-Ion, LiFePO4, Sodium-Ion)",
    "link": "https://www.cnx-software.com/2025/12/07/aqex-qups-p-bc-2-0-ups-hat-works-with-large-capacity-multi-chemistry-batteries-li-ion-lifepo4-sodium-ion/",
    "summary": "Developed by Hungary-based AQEX, qUPS-P-BC-2.0 is a Raspberry Pi-compatible UPS HAT that supports multi-chemistry batteries, including Li-Ion, LiFePO , Sodium-Ion, and even supports large, high-capacity packs up to 300Ah. It is designed for applications that require long backup times and reliable 5V power. It features an offline UPS-like architecture with a highly efficient boost converter, adjustable input voltage and energy thresholds, as well as AUTO/ON/OFF operating modes to prevent reboot loops or unsafe restarts. Communication with the Raspberry Pi is handled through three GPIO pins to provide alerts for power loss and low battery. The board supports up to 7.5A discharge, 2A charging, USB-C and auxiliary 6 28V input, reverse-polarity and thermal protection, and external power-control capability. It s also stackable with other HATs thanks to a robust soldered 40-pin header. AQEX qUPS-P-BC-2.0 specifications: Compatibility Raspberry Pi 5 / 4B / 3B+ and other boards with compatible form factor and 40-pin PIO header [...] The post AQEX qUPS-P-BC-2.0 UPS HAT works with large capacity, multi-chemistry batteries (Li-Ion, LiFePO4, Sodium-Ion) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP32-C6-Devkit-Lipo   A small, open-source hardware ESP32-C6 board with battery support, UEXT connector",
    "link": "https://www.cnx-software.com/2025/12/06/esp32-c6-devkit-lipo-small-open-source-hardware-esp32-c6-board-with-battery-support-uext-connector/",
    "summary": "Olimex ESP32-C6-DevKit-Lipo board is a small open-source hardware board based on the ESP32-C6 WiFi 6, Bluetooth 5.0 LE, and Zigbee/Thread SoC with support for LiPo batteries and UEXT expansion modules. It s the second announcement from the company this week, and comes after they introduced the MOD-ESP32-C5 to add wireless connectivity to boards equipped with a UEXT connector. The ESP32-C6-DevKit-Lipo adds to the list of small ESP32-C6 USB-C boards, such as the 01Space ESP32-C6 board and Seeed Studio XIAO ESP32C6, among many others. It s actually larger than most similar boards, but differentiates itself with its open-hardware design, dual USB-C design, breadboard compatibility, LiPo battery circuitry, and a UEXT connector. ESP32-C6-Devkit-Lipo specifications: Wireless module ESP32-C6-WROOM-1-N4 module Espressif Systems ESP32-C6 SoC CPU Single-core 32-bit RISC-V processor @ 160 MHz Memory 512KB SRAM, 16KB low-power SRAM Wireless 2.4 GHz WiFi 6 1T1R with Target Wake Time (TWT) support Bluetooth LE 5.0 [...] The post ESP32-C6-Devkit-Lipo A small, open-source hardware ESP32-C6 board with battery support, UEXT connector appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ExtrudeX machine recycles failed/old 3D prints into new filament (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/05/extrudex-machine-recycles-failed-old-3d-prints-into-new-filament/",
    "summary": "When 3D printing, users will always waste filament one way or the other, either due to a failed print or because of the support for the print, and there may also be test/old prints that you don t need/use anymore, for example, a retraction cube or a benchy. That means all that material usually ends up in the dustbin. Priyank Pal, founder of Creative3dp, did not like all that waste, so he created the ExtrudeX machine to recycle 3D print waste and filament scraps back into usable filament. On top of that, the machine itself is 3D printable and much more affordable than commercial solutions from companies such as Filabot. I d usually provide the specifications here, but as a crowdfunded project, the ExtrudeX s full technical details are not fully available. We just know that a single DC gear motor drives the main screw inside a metal barrel, while band heaters and [...] The post ExtrudeX machine recycles failed/old 3D prints into new filament (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Rikomagic DS08   A Rockchip RK3588-powered 8K digital signage player with RTC and watchdog support",
    "link": "https://www.cnx-software.com/2025/12/05/rikomagic-ds08-rockchip-rk3588-powered-8k-digital-signage-player-with-rtc-and-watchdog/",
    "summary": "Rikomagic DS08 is a Rockchip RK3588-powered Android 13 digital signage player with 8K and 4K HDMI video outputs, RTC and watchdog support, and support for portrait and landscape orientation. It looks to be an update to the Rockchip RK3288-powered Rikikomagic DS02 introduced in 2020. The new model appears to have the same enclosure, but with a slightly different port layout, and much better specifications. Besides an octa-core Cortex-A76/A55 SoC, the system ships with 8GB of RAM and a 128GB eMMC flash, and features a Gigabit Ethernet port, WiFi 6 and Bluetooth 5.2 connectivity, optional 4G LTE, and a few USB ports. Rikomagic DS08 specifications: SoC Rockchip RK3588 CPU Octa-core 64-bit Armv8 SoC with 4x Cortex-A76 cores @ 2.4GHz, 4x Cortex-A55 cores @ 1.8 GHz GPU Arm Mali-G610 MP4 with support for OpenGL ES 3.2, OpenCL 2.2, Vulkan 1.1 NPU Up to 6 TOPS, supports INT4/INT8/INT16, compatible [...] The post Rikomagic DS08 A Rockchip RK3588-powered 8K digital signage player with RTC and watchdog support appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Edgi-Talk machine learning development kit features Infineon PSOC Edge E84 Edge AI SoC (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/05/edgi-talk-machine-learning-platform-features-infineon-psoc-edge-e84-soc/",
    "summary": "Edgi-Talk is a machine learning platform/development kit powered by an Infineon PSOC Edge E84 Arm Cortex-M55/M33 SoC featuring Arm Helium, an Arm Ethos-U55 micro NPU, and an ultra-low-power NNLite neural network accelerator, all of which enable AI/ML processing at varying power/performance levels. The devkit also comes with 128 MB PSRAM, 128MB QSPI flash, a 4.3-inch capacitive touchscreen display, two digital microphones, a speaker, WiFi 6 and Bluetooth LE 6.0 wireless connectivity, motion and environmental sensors, as well as a 40-pin Raspberry Pi header and two PMOD connectors for expansion. Edgi-Talk specifications: SoC Infineon PSOC Edge E84 CPU Arm Cortex-M55 @ 400 MHz with FPU, MPU, Arm Helium support, 256KB i-TCM, 256KB D-TCM, and 5MB SRAM Arm Cortex-M33 @ 200 MHz with 1MB SRAM, 64KB ROM GPU Low-power 2.5D GPU NPU Dual architecture Arm Ethos-U55 NPU + NNLITE NPU System Memory 128 MB PSRAM Storage 128 MB [...] The post Edgi-Talk machine learning development kit features Infineon PSOC Edge E84 Edge AI SoC (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Mini review of JOYROOM PODIX 140W 5-port USB GaN charger with power meter function",
    "link": "https://www.cnx-software.com/2025/12/04/mini-review-of-joyroom-podix-140w-5-port-usb-gan-charger-with-power-meter-function/",
    "summary": "I ve just received a review sample of the JOYROOM PODIX 140W 5-port USB GaN charger, which I found interesting because it integrates a power meter function for the whole charger and for each individual port, which could be useful for reviews of USB-powered boards and devices. In this short review, I ll go through an unboxing, before testing the features with a smartphone, and trying to stress it a little with five devices, including a laptop, a USB-C powered HDMI display, a wireless display, an Android smartphone, and a Raspberry Pi 5 SBC. JOYROOM PODIX 140W charger unboxing I received the device in its retail package, reading JOYROOM PODIX 140W 5-port desktop GaN charger and listing key features like fast charging, 80cm retractable cables, and a 1.54-inch ultra large display, as well as compatibility with standards such as USB PD 3.1, PPS, AFC, SCP, FCP, and QC 3.0. The side of [...] The post Mini review of JOYROOM PODIX 140W 5-port USB GaN charger with power meter function appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Olimex LT8912B-based MIPI-HDMI adapter board adds HDMI output to the ESP32-P4-Devkit board",
    "link": "https://www.cnx-software.com/2025/12/04/olimex-lt8912b-based-mipi-hdmi-adapter-board-adds-hdmi-output-to-the-esp32-p4-devkit-board/",
    "summary": "Olimex MIPI-HDMI adapter board is built around Lontium Semiconductors LT8912B MIPI DSI to HDMI bridge chip designed to work with their own ESP32-P4-DevKit. The board outputs up to 1080p60 8-bit HDMI via its LT8912B converter and supports 1 4 MIPI DSI data lanes (80 Mbps to 1.5 Gbps per lane) in continuous-clock mode, outputting HDMI 1.4 video in a compact 60 24 mm form factor. These features make it suitable for UI rendering, video streaming, media playback, vision workflows, and HMI applications like digital signage, kiosk systems, and portable multimedia devices. Olimex MIPI-HDMI adapter specifications: Mail Chip LT8912B Single-Channel MIPI DSI Bridge to LVDS/HDMI/MHL converter MIPI Interface 15-pin FPC connector 1 clock lane + 1 to 4 data lanes D-PHY 1.1 and DSI 1.02 compliant 80 Mbps to 1.5 Gbps per lane supported data rate Continuous-clock mode only HDMI output HDMI Type-A connector HDMI 1.4 transmitter Up to 1080p [...] The post Olimex LT8912B-based MIPI-HDMI adapter board adds HDMI output to the ESP32-P4-Devkit board appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Jetway B420UADN1 fanless Intel N97 mini PC supports three 4K displays for kiosks and digital signage applications",
    "link": "https://www.cnx-software.com/2025/12/04/jetway-b420uadn1-fanless-intel-n97-mini-pc-supports-three-4k-displays-for-kiosks-and-digital-signage-applications/",
    "summary": "Jetway B420UADN1 is a compact Intel N97 fanless mini PC designed for kiosks and digital signage applications with support for up to three independent 4K displays through four display interfaces: HDMI, DisplayPort, and two USB-C with DP Alt mode. At first, I thought we had already covered it since the Jetway B420PADN1 embedded box PC has a similar design, but it only comes with one HDMI port. The new B420UADN1 fanless mini PC also supports DDR5 SO-DIMM memory and M.2 NVMe or SATA storage, and offers two 2.5GbE ports, optional WiFi/Bluetooth support, a 3.5mm audio jack, a few USB 3.2/2.0 Type-A ports, and an RS-232/442/485 COM port for peripherals like barcode readers. Jetway B420UADN1 specifications: SoC Intel Processor N97 quad-core Alder Lake-N CPU @ up to 3.6 GHz with 6MB cache, 24 EU Intel UHD graphics @ up to 1.20 GHz; TDP: 12W System Memory Up to 32GB [...] The post Jetway B420UADN1 fanless Intel N97 mini PC supports three 4K displays for kiosks and digital signage applications appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "MetaComputing AI PC with Framework Laptop 13 features CIX P1 12-core Arm processor with up to 45 TOPS",
    "link": "https://www.cnx-software.com/2025/12/04/metacomputing-ai-pc-with-framework-laptop-13-features-cix-p1-12-core-arm-processor-with-up-to-45-tops/",
    "summary": "MetaComputing, a Switzerland-based company founded in 2024, has announced the MetaComputing AI PC with Framework Laptop 13 featuring the same CIX P1 12-core Cortex-A720/A520 SoC with 45 TOPS found in SBCs like the Orion O6 and Orange Pi 6 Plus, or the MINISFORUM MS-R1 mini PC. As far as I know, it s the first laptop based on CIX P1. It features 16GB or 32GB of RAM and a 1TB SSD and ships with the Framework Laptop 13 chassis (Pro model). There s also a Standard model with a co-branded Framework and Cooler Master Case. MetaComputing AI PC specifications (preliminary): SoC CIX P1 (CP8180) 12-core DynamIQ processor 4x Cortex A720 big cores @ up to 2.6 GHz 4x Cortex A720 medium cores 4x Cortex A520 LITTLE cores Cache 12MB shared L3 cache GPU Arm Immortalis G720 MC10 with hardware ray-tracing support, graphics APIs: Vulkan 1.3, OpenGL ES 3.2, OpenCL 3.0 VPU Video [...] The post MetaComputing AI PC with Framework Laptop 13 features CIX P1 12-core Arm processor with up to 45 TOPS appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Silicognition ManT1S ESP32 board supports T1S single-pair Ethernet for robotics and automation (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/03/silicognition-mant1s-esp32-board-t1s-single-pair-ethernet-for-automation-and-robotics/",
    "summary": "Silicognition ManT1S is an ESP32 board with a 4-pole terminal block for T1S single-pair Ethernet (SPE) communication and daisy-chaining, as well as unpopulated headers for GPIOs and programming, and a Qwicc connector for I2C expansion. The IEEE 802.3cg 10BASE-T1S networking standard enables engineers and users to easily network and distribute power to up to eight T1S nodes over a single pair of wires, which makes it suitable for robotics, industrial/home automation, and other projects that benefit from a reduction in the number of cables and associated weight. The company also designed the ManT1S Bridge to interface a standard Ethernet RJ45 to a single-pair T1S mixing segment. ManT1S specifications: System-in-Package ESP32-PICO-V3-O2 SoC ESP32 CPU Xtensa dual-core 32-bit LX6 microprocessor up to 240 MHz Memory 520B SRAM Storage 448 KB ROM Wireless WiFi 4 and Bluetooth 4.2/5.x Memory 2 MB PSRAM Storage 8 MB [...] The post Silicognition ManT1S ESP32 board supports T1S single-pair Ethernet for robotics and automation (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Nordic nRF54LV10A is a tiny, low-voltage Bluetooth LE SoC for battery-powered medical devices",
    "link": "https://www.cnx-software.com/2025/12/03/nordic-nrf54lv10a-tiny-low-voltage-bluetooth-le-soc-for-battery-powered-medical-devices/",
    "summary": "Nordic Semi has unveiled a new member of the nRF54L series: the nRF54LV10A ultra-low-power, low-voltage Bluetooth LE SoC designed for battery-powered medical devices such as trackers, wearable biosensors, and continuous glucose monitors. The nRF54LV10A is offered in a tiny 2.3 1.9mm CSP package or 6x6mm QFN48 package, and since it operates within 1.2 to 1.7V DC supply, it can be powered directly by a 1.5V silver oxide battery typically found in wearables, including medical and healthcare devices. Nordic nRF54LV10A key features and specifications: CPU Arm Cortex-M33 @ up to 128 MHz with up to 1012 KB NVM and 192 KB SRAM; 123 CoreMark/mA @ 1.5 V, 503 CoreMark RISC-V coprocessor @ 128 MHz Ultra-low-power multiprotocol 2.4 GHz radio Bluetooth 6.0 LE with Channel Sounding support for distance measurement, indoor positioning, or presence detection 802.15.4..4-2020 radio up to 250 kbps Proprietary 2.4 GHz up to 4 Mbps Maximum Tx power +4 [...] The post Nordic nRF54LV10A is a tiny, low-voltage Bluetooth LE SoC for battery-powered medical devices appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Tyr   A Rust GPU driver for Arm Mali GPUs",
    "link": "https://www.cnx-software.com/2025/12/03/tyr-a-rust-gpu-driver-for-arm-mali-gpus/",
    "summary": "One interesting addition to the just-released Linux 6.18 kernel is the Tyr Rust GPU driver for CSF-based Arm Mali GPUs, which is a port of the mature Panthor C GPU driver merged into Linux 6.10. It was developed by Collabora in collaboration with Arm and Google. Tyr aims to implement the same userspace API offered by Panthor, so that it can eventually be used as a drop-in replacement in the company s PanVK Vulkan driver. After several years, the Tyr Rust driver might replace the Panthor C driver, but in the meantime, Panthor will keep being used since it is more mature and conformant with OpenGL ES 3.1 since July 2024. The work on Tyr is fairly advanced, and Collabora provided an update at the end of November. The key takeaway is that the Tyr (prototype) driver works with GNOME, Weston, and even full-screen 3D games like SuperTuxKart while matching the [...] The post Tyr A Rust GPU driver for Arm Mali GPUs appeared first on CNX Software - Embedded Systems News ."
  }
]