[
  {
    "title": "Microsoft let Asus set the prices for Xbox Rog Ally, confirms Xbox President   work on next-gen console hardware is already underway with AMD",
    "link": "https://www.tomshardware.com/video-games/handheld-gaming/microsoft-let-asus-set-the-prices-for-xbox-rog-ally-confirms-xbox-president-work-on-next-gen-console-hardware-is-already-underway-with-amd",
    "summary": "Xbox President Sarah Bond has just confirmed that Microsoft relied on Asus' experience in handhelds to help determine the price of the Xbox Ally. The team at Xbox is confident and proud of the device, with sold-out preorders. Sarah also talks about how the next-gen Xbox console is also in the works with AMD as we speak."
  },
  {
    "title": "Cooler Master Hyper 212 3DHP Review: Engineering better heatpipes, improving thermal efficiency",
    "link": "https://www.tomshardware.com/pc-components/air-cooling/cooler-master-hyper-212-3dhp-review",
    "summary": "Cooler Master s 3DHP heatpipes promise to be the biggest evolution for cooling in years. Do they deliver? We tested the Hyper 212 3DHP with AMD s Ryzen 9 9950X to determine if Cooler Master s heatpipes live up to the hype."
  },
  {
    "title": "Lucky Facebook Marketplace shopper finds souped-up prototype GTX 2080 Ti inside a $500 PC   mythical Nvidia project features 12GB of VRAM and higher memory bandwidth",
    "link": "https://www.tomshardware.com/pc-components/gpus/lucky-facebook-marketplace-shopper-finds-souped-up-prototype-gtx-2080-ti-inside-a-usd500-pc-mythical-nvidia-project-features-12gb-of-vram-and-higher-memory-bandwidth",
    "summary": "Specifications suggest Nvidia once considered a more powerful TU102 design for the RTX 2080 Ti GPU"
  },
  {
    "title": "Microsoft denies Mexico data center linked to water shortages, local illnesses, and power outages   stomach bugs and even hepatitis reported in region as 1.5 Gigawatt AI data center buildout looms",
    "link": "https://www.tomshardware.com/tech-industry/microsoft-denies-mexico-data-center-linked-to-water-shortages-local-illnesses-and-power-outages-stomach-bugs-and-even-hepatitis-reported-in-region-as-1-5-gigawatt-ai-data-center-buildout-looms",
    "summary": "Microsoft has denied claims that its data center in central Mexico is tied to a recent spate of power outages, water shortages, and health concerns, claiming it always prioritizes the needs of local communities in any actions it takes."
  },
  {
    "title": "Razer Iskur V2 X Gaming Chair Review: An affordable, frills-free entry-level gaming chair",
    "link": "https://www.tomshardware.com/peripherals/gaming-chairs/razer-iskur-v2-x-gaming-chair-review",
    "summary": "Razer puts the Iskur V2 through a cost-cutting spree, and the result is the Iskur V2 X."
  },
  {
    "title": "Alibaba Cloud says it cut Nvidia AI GPU use by 82% with new pooling system  up to 9x increase in output lets 213 GPUs perform like 1,192",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/alibaba-says-new-pooling-system-cut-nvidia-gpu-use-by-82-percent",
    "summary": "Alibaba Cloud claims its new Aegaeon pooling system reduced the number of Nvidia GPUs required to serve large language models by 82% during a multi-month beta test inside its Model Studio marketplace."
  },
  {
    "title": "Bambu Lab is selling the awesome P1S 3D printer for an all-time low of $449   clip the coupon for a $100 saving",
    "link": "https://www.tomshardware.com/3d-printing/bambu-lab-is-selling-the-awesome-p1s-3d-printer-for-an-all-time-low-of-usd449-clip-the-coupon-for-a-usd100-saving",
    "summary": "Pick up the Bambu Lab P1S for a song. Only $449 for one of our favorite 3D printers."
  },
  {
    "title": "Embattled Dutch chipmaker Nexperia blasts ousted CEO over false accusations   claims of unpaid salaries and independent operation in China are 'falsehoods', say company",
    "link": "https://www.tomshardware.com/tech-industry/embattled-dutch-chipmaker-nexperia-blasts-ousted-ceo-over-false-accusations-claims-of-unpaid-salaries-and-independent-operation-in-china-are-falsehoods-say-company",
    "summary": "The ousted ex-CEO of Dutch chip firm, Nexperia, has reportedly been claiming that Chinese workers can defy Dutch administrators and that staff haven't been paid. Dutch management denies these claims, calling them \"factually incorrect and misleading.\""
  },
  {
    "title": "Colossal AWS outage breaks the internet   Roblox, Fortnite, Zoom, Snapchat, and beyond all crippled",
    "link": "https://www.tomshardware.com/tech-industry/colossal-aws-outage-breaks-the-internet-roblox-fortnite-zoom-and-beyond-all-crippled",
    "summary": "Amazon is tracking a massive AWS outage that has crippled large parts of the internet."
  },
  {
    "title": "Musk challenges legendary AI researcher Karpathy to an AI coding showdown against Grok 5   gets a polite 'no' to an IBM Deep Blue-like showdown",
    "link": "https://www.tomshardware.com/tech-industry/musk-challenges-kaparthy-to-an-ai-coding-showdown",
    "summary": "Elon Musk has proposed a public coding contest between xAI s Grok 5 and former OpenAI research lead Andrej Karpathy, comparing it to the 1997 showdown between Garry Kasparov and IBM s Deep Blue."
  },
  {
    "title": "TSMC gives an ultra-rare video look inside its fabs   'Silver Highway' and fab tools revealed in flyby video of company's US Arizona Fab 21",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/tsmc-gives-an-ultra-rare-video-look-inside-its-fabs-silver-highway-and-fab-tools-revealed-in-flyby-video-of-companys-us-arizona-fab-21",
    "summary": "TSMC's new flyby video of its Fab 21 in Arizona offers a rare glimpse inside the fully operational N4/N5 cleanroom, highlighting ASML's EUV scanners producing chips for Apple, AMD, and Nvidia."
  },
  {
    "title": "Razer DeathAdder V4 Pro Review: As good as the DeathAdder V3 Pro",
    "link": "https://www.tomshardware.com/peripherals/gaming-mice/razer-deathadder-v4-pro-review",
    "summary": "The DeathAdder V4 Pro retains the fantastic shape of its predecessor, weighs about 10% less, and includes an 8K wireless polling dongle in the box."
  },
  {
    "title": "Enthusiast plays Battlefield 6 on his CPU watercooler's tiny 2.1-inch screen   480x480 resolution MSI liquid cooler screen good enough for XP farming",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/enthusiast-plays-battlefield-6-on-his-cpu-watercoolers-screen-tiny-2-1-inch-480x480-msi-liquid-cooler-screen-good-enough-for-xp-farming",
    "summary": "Battlefield 6 is an intense game with gorgeous visuals that demands the best screen possible. But what if you're at work and your literal job is to test displays? That's when a bit of ingenuity kicks in and you switch to the tiny screen on your CPU's liquid cooler to maximize gaming efficiency like a boss."
  },
  {
    "title": "DOSBox Pure Unleashed is ready for Windows, Mac, and Linux computers after five years in development   enhanced standalone release no longer restricted to being a RetroArch core",
    "link": "https://www.tomshardware.com/video-games/retro-gaming/dosbox-pure-unleashed-is-ready-for-windows-mac-and-linux-computers-after-five-years-in-development-enhanced-standalone-release-no-longer-restricted-to-being-a-retroarch-core",
    "summary": "The first public release of DOSBox Pure Unleashed, a new version of the DOS emulator by Psyraven, was made available on Saturday evening"
  },
  {
    "title": "Windows 11's October update just broke the Windows Recovery Environment   USB keyboards and mice unusable in Windows RE after latest bug hits",
    "link": "https://www.tomshardware.com/software/windows/windows-11s-october-update-just-broke-the-windows-recovery-environment-usb-keyboards-and-mice-unusable-in-windows-re-after-latest-bug-hits",
    "summary": "Like a moth to a flame, Windows has attracted yet another bug. In the latest October update, the recovery environment renders your USB keyboard and mouse unresponsive, making it impossible to interact with your PC. Microsoft has already taken note of the issue and plans to fix it in a future update."
  },
  {
    "title": "Palantir chief takes a jab at Nvidia CEO Jensen Huang, says people decrying  China hawks  are useful idiots   'The first step to ending our dependence on China is admitting we have a problem'",
    "link": "https://www.tomshardware.com/tech-industry/big-tech/palantir-chief-takes-a-jab-at-nvidia-ceo-jensen-huang-says-people-decrying-china-hawks-are-useful-idiots-the-first-step-to-ending-our-dependence-on-china-is-admitting-we-have-a-problem",
    "summary": "The Palantir CTO called out Jensen Huang's 'China hawk' comments."
  },
  {
    "title": "The Intel i386 turns 40 years old   275,000 transistors running at 16MHz changed personal computing forever",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/intel-386-at-40",
    "summary": "Introduced in October 1985, the third-generation x86 processor was the first 32-bit chip in Intel s PC line, the origin point for the IA-32 instruction set, and the architectural turning point that transformed personal computing."
  },
  {
    "title": "The $150 external HyperSpace Trackpad Pro is an Apple Magic Trackpad alternative for Windows users with haptic feedback and pressure sensitivity   crowdfunded peripheral ships in Q1 2026",
    "link": "https://www.tomshardware.com/peripherals/the-usd150-external-hyperspace-trackpad-pro-is-an-apple-magic-trackpad-alternative-for-windows-users-with-haptic-feedback-and-pressure-sensitivity-crowdfunded-peripheral-ships-in-q1-2026",
    "summary": "The HyperSpace Trackpad Pro packs premium build quality, zero-latency performance, and app-specific customization, all aimed at bringing macOS-style trackpad precision to Windows setups."
  },
  {
    "title": "WeCreat Lumos review: Premium and portable",
    "link": "https://www.tomshardware.com/maker-stem/wecreat-lumos-review",
    "summary": "The WeCreat Lumos is a fast, portable, capable, laser engraver with great resolution and limited cutting abilities."
  },
  {
    "title": "OceanGate Titan submersibles' catastrophic implosion crushed its computers into twisted mass of metal and electronics   investigators find signs of thermal damage, too",
    "link": "https://www.tomshardware.com/tech-industry/oceangate-titan-computers-crushed-into-twisted-mass-of-metal-and-electronics-during-catastrophic-implosion-investigators-find-signs-of-thermal-damage-too",
    "summary": "Investigators reveal the twisted metal and electronics found at the OceanGate Titan implosion site. However, data recovery efforts have been fruitless."
  },
  {
    "title": "BitLocker reportedly auto-locks users' backup drives, causing loss of 3TB of valuable data   Windows automatic disk encryption can permanently lock your drives",
    "link": "https://www.tomshardware.com/software/windows/bitlocker-reportedly-auto-locks-users-backup-drives-causing-loss-of-3tb-of-valuable-data-windows-automatic-disk-encryption-can-permanently-lock-your-drives",
    "summary": "An unfortunate Reddit user lost access to 3 terabytes of data stored across two drives when BitLocker automatically encrypted them without the user's knowledge, within Windows 11. With no keys to unlock the drives, the data is now permanently gone with no hopes for conventional recovery."
  },
  {
    "title": "Stinky thermal paste emits acidic vapors, corrodes copper, 'glues' heatsinks to processors, and permanently damages coolers - SGT-4 TIM is a chemically reactive blend, finds investigation",
    "link": "https://www.tomshardware.com/pc-components/thermal-paste/stinky-thermal-paste-emits-acidic-vapors-corrodes-copper-glues-heatsinks-to-processors-and-permanently-damages-coolers-sgt-4-tim-is-a-chemically-reactive-blend-finds-investigation",
    "summary": "An investigation revealed that the popular low-cost Amech SGT-4 thermal paste is a chemically reactive PDMS-based compound containing that releases acetic acid, produces a vinegar odor, corrodes copper surfaces, and even creates ant holes on surfaces."
  },
  {
    "title": "Teacher uses cheap laser and solar panel to transmit wireless sound   iPad powers home project that was inspired by solar panel making noise when attached to speaker",
    "link": "https://www.tomshardware.com/maker-stem/teacher-uses-cheap-laser-and-solar-panel-to-transmit-wireless-sound-ipad-powers-home-project-that-was-inspired-by-solar-panel-making-noise-when-attached-to-speaker",
    "summary": "YouTube creator and high school teacher ChemTeacherPhil demonstrated how to use light to transmit sound wirelessly to a solar panel and utilize it to play music."
  },
  {
    "title": "Carry your favorite apps wherever you go with PortableApps",
    "link": "https://www.tomshardware.com/pc-components/usb-flash-drives/carry-your-favorite-apps-wherever-you-go-with-portableapps",
    "summary": "The family IT support season is upon us, and this project will have all the tools that you need to solve family IT problems, communicate with loved ones, and get some work done."
  },
  {
    "title": "North Korean state-sponsored hackers slip unremovable malware inside blockchains to steal cryptocurrency   EtherHiding embeds malicious JavaScript payloads in smart contracts on public blockchains",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/north-korea-hiding-malware-inside-blockchain-smart-contracts",
    "summary": "Google says DPRK group UNC5342 is using EtherHiding to deliver backdoors and steal crypto, marking the first nation-state adoption of a tactic built for takedown-resistant attacks."
  },
  {
    "title": "be quiet! System Power 11 550W power supply review",
    "link": "https://www.tomshardware.com/pc-components/power-supplies/be-quiet-system-power-11-550w-power-supply-review",
    "summary": "A budget-friendly power supply that balances fundamental reliability with modern connectivity, though its aging platform reveals itself under stress."
  },
  {
    "title": "Nvidia and TSMC produce the first Blackwell wafer made in the U.S.   chips still need to be shipped back to Taiwan to complete the final product",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/nvidia-and-tsmc-produce-the-first-blackwell-wafer-made-in-the-u-s-chips-still-need-to-be-shipped-back-to-taiwan-to-complete-the-final-product",
    "summary": "Nvidia and TSMC have produced the first Blackwell wafer at TSMC s Arizona fab, marking a historic step in bringing advanced AI chip manufacturing to the U.S.. However, the chip still relies on Taiwan for final CoWoS-L packaging, which leaves the achievement largely symbolic for now."
  },
  {
    "title": "'Budget' portable CD player for audiophiles launches at $319   built-in CD ripping support, high-quality DAC, and amplifier",
    "link": "https://www.tomshardware.com/peripherals/budget-portable-cd-player-for-audiophiles-launches-at-usd319-built-in-cd-ripping-support-high-quality-dac-and-amplifier",
    "summary": "Hi-Fi audio company Shanling just released a \"budget\" portable CD player for audiophiles."
  },
  {
    "title": "Optical drive demand surges amid Windows 10 retirement   Japanese users switching to Windows 11 are buying up Blu-ray drives",
    "link": "https://www.tomshardware.com/software/windows/optical-drive-demand-surges-amid-windows-10-retirement-japanese-users-switching-to-windows-11-are-buying-up-blu-ray-drives",
    "summary": "Windows 10 reaching end-of-life has apparently breathed new life into optical disc drives, which have seen a sudden rise in demand in shops across Tokyo. People upgrading to Windows 11 want internal Blu-Ray (BD-R) disc drives to continue using their physical media, even if they're being forced to upgrade systems."
  },
  {
    "title": "Jensen says Nvidia s China AI GPU market share has plummeted from 95% to zero   the Chinese market previously amounted to 20% to 25% of the chipmaker's data center revenue",
    "link": "https://www.tomshardware.com/tech-industry/jensen-huang-says-nvidia-china-market-share-has-fallen-to-zero",
    "summary": "Nvidia CEO Jensen Huang said last week that the company s share of China s advanced AI accelerator market has collapsed from roughly 95% to zero as US export controls continue to bite."
  },
  {
    "title": "Secret SpaceX satellites are transmitting mysterious signals on the wrong spectrum   a classified network caught sending data on the uplink frequency",
    "link": "https://www.tomshardware.com/service-providers/network-providers/secret-spacex-satellites-are-transmitting-mysterious-signals-on-the-wrong-spectrum-a-classified-network-caught-sending-data-on-the-uplink-frequency",
    "summary": "An amateur satellite tracker stumbled upon classified SpaceX satellites that are sending data down a frequency band reserved for uplinks."
  },
  {
    "title": "Score a 17-button mouse on the cheap   the Corsair Scimitar RGB Elite is 33% off on Newegg",
    "link": "https://www.tomshardware.com/peripherals/gaming-mice/score-a-17-button-mouse-on-the-cheap-the-corsair-scimitar-rgb-elite-is-33-percent-off-on-newegg",
    "summary": "The Corsair Scimitar RGB Elite mouse features a sturdy build, fast sensor, and 17 programmable buttons."
  },
  {
    "title": "Jensen Huang personally delivers DGX Spark Mini PCs to Elon Musk and Sam Altman   separately",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/jensen-huang-personally-delivers-dgx-spark-mini-pcs-to-elon-musk-and-sam-altman-separately",
    "summary": "We spotted both Elon Musk and Sam Altman being handed cute glittering DGX Spark mini PCs by Jensen Huang this week."
  },
  {
    "title": "Power bricks and wall warts for EU market must include detachable USB-C cables by 2028   New legislation also adds power rating labels for cables",
    "link": "https://www.tomshardware.com/tech-industry/power-bricks-and-wall-warts-must-be-usb-c-by-2028-new-eu-legislation-also-adds-power-rating-labels-for-power-units-and-cables",
    "summary": "EU mandates USB-C for most power bricks and wall warts by 2028"
  },
  {
    "title": "Second-gen Phison SSD controllers hit the market with 14.9 GB/s speeds   TeamGroup Z54E spearheads a new army of PCIe 5.0 drives",
    "link": "https://www.tomshardware.com/pc-components/ssds/second-gen-phison-ssd-controllers-hit-the-market-with-14-9-gb-s-speeds-teamgroup-z54e-spearheads-a-new-army-of-pcie-5-0-drives",
    "summary": "TeamGroup has announced the T-Force Z54E, a PCIe 5.0 SSD that leverages Phison's speedy E28 controller."
  },
  {
    "title": "Intel Foundry secures contract to build Microsoft's Maia 2 next-gen AI processor on 18A/18A-P node, claims report   could be first step in ongoing partnership",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/intel-foundry-secures-contract-to-build-microsofts-maia-2-next-gen-ai-processor-on-18a-18a-p-node-claims-report-could-be-first-step-in-ongoing-partnership",
    "summary": "Intel Foundry will reportedly produce Microsoft's next-generation Maia processor for AI applications on its 18A process technology, which could mark a big win for the company both in terms of earnings and goodwill."
  },
  {
    "title": "AMD's gaming-optimized Ryzen 9 9900X3D CPU hits all all-time low price, finally makes sense   now just $50 more than a 9800X3D",
    "link": "https://www.tomshardware.com/pc-components/amds-gaming-optimized-ryzen-9-9900x3d-cpu-hits-all-all-time-low-price-finally-makes-sense-now-just-usd50-more-than-a-9800x3d",
    "summary": "AMD's Ryzen 9 9900X3D 12-core 3D-VCache CPU is on a 17% discount, fixing its biggest problem that we complained about during our review. At just $499, the 9900X3D is just $50 more expensive than a 9800X3D and has the same price-per-core ratio as the Ryzen 9 9950X3D."
  },
  {
    "title": "Anthropic targets gigantic $26 billion in revenue by the end of 2026   eye-watering sum is more than double OpenAI's projected 2025 earnings",
    "link": "https://www.tomshardware.com/tech-industry/anthropic-targets-gigantic-usd26-billion-in-revenue-by-the-end-of-2026-eye-watering-sum-is-more-than-double-openais-projected-2025-earnings",
    "summary": "Claude AI developer Anthropic has released its revenue projections for the next year, and they are ambitious. Off the back of what it claims is a plan to reach $9 billion in revenue by the end of 2025, it's now targeting as much as $26 billion by the end of 2026, more than double OpenAI's 2025 revenue projections."
  },
  {
    "title": "MSI's new AI-powered PC building assistant recommends the 9800X3D as a budget CPU   EZ PC Builder spec'd out over $1,700 of parts for a $1,000 build",
    "link": "https://www.tomshardware.com/desktops/pc-building/msis-new-ai-powered-pc-building-assistant-recommends-the-9800x3d-as-a-budget-cpu-ez-pc-builder-specd-out-over-usd1-700-of-parts-for-a-usd1-000-build",
    "summary": "MSI's new AI chatbot, \"EZ PC Builder,\" is here to get you started on your first gaming computer. It's in beta, so there are some quirks, well, a lot of quirks, such as suggesting the 9800X3D as a budget CPU and building a $1,700+ PC when asked for something under $1,000. It also tries to suggest MSI products at literally every point it can."
  },
  {
    "title": "Micron is preparing to exit China s data center memory market completely, report claims   Beijing banned company's chips from 'critical information infrastructure' in 2023",
    "link": "https://www.tomshardware.com/pc-components/ram/reports-suggest-micron-is-preparing-to-exit-chinas-data-center-memory-market",
    "summary": "Micron is reportedly preparing to halt sales of server memory chips to data centers in mainland China, after its business there failed to recover from a 2023 cybersecurity ban."
  },
  {
    "title": "Get a 27-inch 180Hz FHD display for just $95 at Newegg   Asrock gaming monitor price slashed by 40%",
    "link": "https://www.tomshardware.com/pc-components/get-a-27-inch-180hz-fhd-display-for-just-usd95-at-amazon-asrock-gaming-monitor-price-slashed-by-40-percent",
    "summary": "The ASRock Phantom Gaming PG27FFT1B is a great budget gaming monitor, and it's even greater now that its price is below $100."
  },
  {
    "title": "TP-Link Deco BE65-Outdoor review: Blanketing your outdoor areas with high-speed Wi-Fi 7 coverage",
    "link": "https://www.tomshardware.com/networking/routers/tp-link-deco-be65-outdoor-review-blanketing-your-outdoor-areas-with-high-speed-wi-fi-7-coverage",
    "summary": "The Deco BE65-Outdoor offers excellent outdoor performance to blanket a yard or outdoor shed with internet connectivity."
  },
  {
    "title": "Massive AI data center buildouts are squeezing energy supplies   New energy methods are being explored as power demands are set to skyrocket",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/massive-ai-data-center-buildouts-are-squeezing-energy-supplies-new-energy-methods-are-being-explored-as-power-demands-are-set-to-skyrocket",
    "summary": "A perfect storm of massive data centre buildout and new innovations in energy could materially change what our supplies look like in the future."
  },
  {
    "title": "Apple M5 chip smashes Snapdragon X2 Elite in early single-thread benchmarks   single core scores rival Intel's Core Ultra 9 285K and beat AMD's 9950X3D, teasing multi-core potential of future variants",
    "link": "https://www.tomshardware.com/pc-components/cpus/apple-m5-chip-smashes-snapdragon-x2-elite-in-early-single-thread-benchmarks-single-core-scores-rival-intels-core-ultra-9-285k-and-beat-amds-9950x3d-teasing-multi-core-potential-of-future-variants",
    "summary": "The M5 chip in the new iPad Pro and MacBook Pro refreshes performs slightly differently, as revealed by Geekbench results. This makes sense considering how one is a thin-and-light tablet, while the other is a thick, pro laptop designed to sustain performance for longer with active cooling."
  },
  {
    "title": "TSMC moves up 2nm production plans in Arizona    CEO also hints at further site expansion beyond $165 billion commitment",
    "link": "https://www.tomshardware.com/tech-industry/tsmc-moves-up-2nm-production-plans-in-arizona-ceo-also-hints-at-further-site-expansion-beyond-usd165-billion-commitment",
    "summary": "TSMC is ramping up its construction to unlock N2 production in Arizona, while also mentioning that it's purchasing another plot of land to expand the fab."
  },
  {
    "title": "Amazon reveals 960 megawatt nuclear power plans to cope with AI demand   Richland, Washington site tapped for deployment of Xe-100 small modular reactors",
    "link": "https://www.tomshardware.com/tech-industry/amazon-unveils-plans-for-modular-nuclear-plant-in-washington",
    "summary": "Amazon has revealed plans to help build one of the United States first modular nuclear power campuses in a move designed to supply carbon-free electricity for its growing AI and cloud workloads."
  },
  {
    "title": "Give your mouse the finger with this wild cursor control ring   Prolo Ring hits Kickstarter, hoping to transform your finger into the ultimate macro and gesture device",
    "link": "https://www.tomshardware.com/peripherals/wearable-tech/give-your-mouse-the-finger-with-this-wild-cursor-control-ring-prolo-ring-hits-kickstarter-hoping-to-transform-your-finger-into-the-ultimate-macro-and-gesture-device",
    "summary": "Prolo Ring is the latest in the line of Kickstarters trying to computer inputs. Still, it's pretty cool to see a smart ring that has a trackpad, a modifier button, and a motion sensor all built into one, aided with customizable software that should make interacting with your PC more fun, if not more seamless."
  },
  {
    "title": "New $1 US coins to feature Steve Jobs and Cray-1 supercomputer   US Mint's 2026 American Innovation Program to memorialize computing history",
    "link": "https://www.tomshardware.com/tech-industry/new-us-usd1-coins-to-feature-steve-jobs-and-cray-1-supercomputer-us-mints-2026-american-innovation-program-to-memorialize-computing-history",
    "summary": "Steve Jobs and the Cray-1 supercomputer are joining the heads of former presidents and the Statue of Liberty as icons on United States coinage."
  },
  {
    "title": "Razer Phantom White collection launches   translucent gaming peripherals include Basilisk V3 Pro 35K mouse, BlackWidow V4 75% keyboard",
    "link": "https://www.tomshardware.com/peripherals/razer-phantom-white-collection-launches-translucent-gaming-peripherals-include-basilisk-v3-pro-35k-mouse-blackwidow-v4-75-percent-keyboard",
    "summary": "Razer just released a new translucent colorway with the Phantom White option for a $10 to $20 premium."
  },
  {
    "title": "Multiple generations of Intel's modern chips see price hikes up to 20% overseas   foreign markets are feeling the pinch on 12th, 13th, and 14th-gen chips",
    "link": "https://www.tomshardware.com/pc-components/cpus/multiple-generations-of-intels-modern-chips-see-price-hikes-up-to-20-percent-overseas-foreign-markets-are-feeling-the-pinch-on-12th-13th-and-14th-gen-chips",
    "summary": "International reports indicate that Intel's 12th, 13th, and 14th Generation processors are selling for up to 20% more in markets like Korea and Japan."
  },
  {
    "title": "LILYGO T-2CAN upgrades TTGO T-CAN485 with ESP32-S3, dual Isolated CAN Bus",
    "link": "https://www.cnx-software.com/2025/10/20/lilygo-t-2can-upgrades-ttgo-t-can485-with-esp32-s3-dual-isolated-can-bus/",
    "summary": "LILYGO T-2CAN is an updated version of the earlier TTGO T-CAN485, with a more powerful ESP32-S3 MCU and two isolated CAN bus interfaces. Like its predecessor, it is designed for vehicle diagnostics, industrial CAN monitoring, and wireless CAN-to-cloud gateways. The board features an ESP32-S3 MCU with 16MB Flash and 8MB PSRAM, along with two MCP2515 CAN controllers supporting CAN V2.0B at up to 1 Mb/s. It also offers Qwiic connectors and a 26-pin GPIO header (unpopulated) for expansion, and supports both USB Type-C (5V) and DC (12 24V) power inputs. Additional features include BOOT and RESET buttons, an external antenna connector, and onboard debugging via USB. LILYGO T-2CAN specifications: ESP32-S3-WROOM-1U wireless module SoC ESP32-S3 dual-core Tensilica LX7 microcontroller @ up to 240 MHz with 2.4 GHz 802.11n WiFi 4 and Bluetooth 5.0 LE connectivity Memory 8MB PSRAM Storage 16MB SPI flash IPEX antenna connector Industrial control interfaces via 2x [...] The post LILYGO T-2CAN upgrades TTGO T-CAN485 with ESP32-S3, dual Isolated CAN Bus appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "$165 Banana Pi BPI-R4 Pro board offers 2x 10GbE SFP+ cages, 7x 10GbE/2.5GbE/GbE RJ45 ports, WiFi 7 support",
    "link": "https://www.cnx-software.com/2025/10/20/banana-pi-bpi-r4-pro-board-offers-2x-10gbe-sfp-cages-6x-10gbe-2-5gbe-gbe-ports-wifi-7-support/",
    "summary": "The Banana Pi BPI-R4 Pro is a new router board based on MediaTek Filogic 880 (MT7988A) Cortex-A73 SoC offering two 10GbE SFP+ cages/RJ45 ports combos, four 2.5GbE RJ45 ports, two Gigabit Ethernet interfaces, and optional WiFi 7 support via the Banana Pi BPI-R4-MIC-BE14 dual mini PCIe module. As its name implies, it s a Pro/upgraded version of the Banana Pi BPI-R4 board first introduced in 2023, which doubles the memory to 8GB DDR4, doubles the SPI flash s capacity to 256MB, and adds a few networking ports, M.2 expansion slots for a total of six, and a few other minor features highlighted in bold in the specifications below. Banana Pi BPI-R4 Pro specifications: SoC MediaTek MT7988A (Filogic 880) quad-core Arm Corex-A73 processor @ 1.8GHz with AI-powered packet accelerator called TOPS (Tunnel Offload Processor System) System Memory 8GB DDR4 Storage 8GB eMMC flash 256MB SPI NAND Flash MicroSD card slot 2x [...] The post $165 Banana Pi BPI-R4 Pro board offers 2x 10GbE SFP+ cages, 7x 10GbE/2.5GbE/GbE RJ45 ports, WiFi 7 support appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "RP2350 Tiny and Tiny XL boards clone Solder Party s RP2350 stamp layouts at nearly half the price",
    "link": "https://www.cnx-software.com/2025/10/19/rp2350-tiny-and-tiny-xl-boards-clone-solder-party-rp2350-stamp-modules/",
    "summary": "While searching Aliexpress, I stumbled upon the RP2350 Tiny and Tiny XL, both of which are RP2350-based low-cost stamp-size development boards that look exactly like the Solder Party s RP2350 Stamp modules, but are available at nearly half the price. Both modules feature the Raspberry Pi RP2350 dual-core Arm Cortex-M33 microcontroller and an integrated LiPo charging circuitry. The RP2350 Tiny offers 30x GPIOs, while the larger RP2350 Tiny XL breaks out 48x GPIOs, adds PSRAM, and includes SWD/UART JST connectors. Key interfaces include USB host/device, UART, SPI, I C, PWM, ADC, and PIO state machines, along with Secure Boot and Arm TrustZone. These features make this board suitable for rapid prototyping and testing with CircuitPython support. RP2350 Tiny and Tiny XL specifications: Microcontroller RP2350 Tiny Raspberry Pi RP2350A MCU, QFN-60; 7 7 mm RP2350 Tiny XL Raspberry Pi RP2350B MCU,QFN-80; 10 10 mm Memory 520KB internal RAM, 8KB OTP storage Storage 16MB [...] The post RP2350 Tiny and Tiny XL boards clone Solder Party s RP2350 stamp layouts at nearly half the price appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "MIPI SoundWire I3S (SWI3S) targets high-bandwidth, low-latency audio applications",
    "link": "https://www.cnx-software.com/2025/10/18/mipi-soundwire-i3s-swi3s-targets-high-bandwidth-low-latency-audio-applications/",
    "summary": "The MIPI Alliance has recently released the SoundWire I3S (MIPI SWI3S v1.0) specification for high-bandwidth, low-latency audio applications which unify control and data over a single, power-efficient interface. SWI3S builds upon the two-pin, multi-drop architecture of MIPI SoundWire released in 2014, and offers higher bandwidth, low power consumption, much better noise immunity, and support for scalable multi-device topologies to meet the increasing requirements of embedded audio systems. MIPI SWI3S v1.0 supports data rates up to 76 Mbps against 24 Mbps for the earlier SLIMbus and SoundWire audio interfaces, and improves noise immunity by operating in forwarded clock or differential low voltage signaling . It also implements a range of new features such as Hubs, multiple PHY support, control CRC, power-saving techniques, and more. MIPI SoundWire I3S key features: Transports audio data, control commands, interrupt signals, and synchronization information over a unified two-pin link Forwarded bit clock single-ended (FBCSE) and differential low-voltage [...] The post MIPI SoundWire I3S (SWI3S) targets high-bandwidth, low-latency audio applications appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Allwinner T153-based industrial SoM and SBC feature a mix of Arm Cortex-A7 and RISC-V cores",
    "link": "https://www.cnx-software.com/2025/10/17/allwinner-t153-based-industrial-som-and-sbc-feature-a-mix-of-arm-cortex-a7-and-risc-v-cores/",
    "summary": "Forlinx has recently introduced the Allwinner T153-based FET153-S SoM and the OK153-S SBC. The Allwinner T153 processor features a hybrid architecture that combines a quad-core Arm Cortex-A7 CPU with an XuanTie E907 RISC-V core. The board features up to 1GB DDR3 RAM, 8GB eMMC, triple Gigabit Ethernet, dual CAN-FD, RS-485, and a Local Bus for PSRAM or FPGA expansion. Display options include support for RGB, LVDS, and MIPI DSI interfaces, and camera inputs are offered via parallel or MIPI CSI. Additional I/O include multiple UART, I C, SPI, I S, GPADC, and GPIO options, along with Wi-Fi/Bluetooth, a USB Type-C OTG port, and a Mini PCIe socket for 4G modules. Target applications include real-time control and edge computing, industrial automation, IoT gateways, and embedded systems. Forlinx FET153-S system-on-module Specifications: SoC Allwinner T153 CPU 4x Arm Cortex-A7 cores @ up to 1.6GHz XuanTie E907 RISC-V core @ up to 600MHz GPU 2D [...] The post Allwinner T153-based industrial SoM and SBC feature a mix of Arm Cortex-A7 and RISC-V cores appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Google s open-source, RISC-V-based Coral NPU is integrated into Synaptics SL2610 Edge AI SoCs",
    "link": "https://www.cnx-software.com/2025/10/17/google-open-source-coral-npu-synaptics-sl2610-edge-ai-socs/",
    "summary": "Google has very recently introduced Coral NPU full-stack, open-source RISC-V-based platform for always-on AI on low-power edge devices and wearables. The first chip to integrate the Coral NPU is the upcoming Synaptics Astra SL2610 family. Google Coral NPU The Coral NPU aims to address the software fragmentation on entry-level AI accelerators that makes them difficult to program. By releasing an open-source NPU and associated source code, Google hopes its design will be adopted by silicon vendors, reduce software fragmentation over time, and help machine learning (ML) developers bring products to market faster. Building on the works on the Coral platform, the new, open-source Coral NPU is comprised of three main components: A scalar core A lightweight, C-programmable RISC-V core that manages data flow to the back-end cores. It uses a simple run-to-completion model for ultra-low power consumption and traditional CPU functions. A vector execution unit A single instruction [...] The post Google s open-source, RISC-V-based Coral NPU is integrated into Synaptics SL2610 Edge AI SoCs appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Raspberry Pi-like Allwinner A527/T527 industrial SBC features dual camera support and AI acceleration",
    "link": "https://www.cnx-software.com/2025/10/16/raspberry-pi-allwinner-a527-t527-industrial-sbc-dual-camera-ai-acceleration/",
    "summary": "EBYTE has recently released an Allwinner A527/T527-based Raspberry Pi-like industrial SBC with dual camera and AI features, with a design very similar to the Walnut Pi 2B, and to a lesser extent, the Orange Pi 4A. It is designed for embedded, IoT, and smart commercial applications. The board supports up to 4GB LPDDR4 RAM, 32GB eMMC storage, and MicroSD card expansion. Display options include HDMI 2.0 and a 4-lane MIPI DSI interface enabling dual 4K output, while two 4-lane MIPI CSI connectors allow simultaneous camera inputs. Connectivity options include Gigabit Ethernet, Wi-Fi 4, Bluetooth 4.2, and a PCIe 2.1 x1 slot for high-speed expansion. It also features four USB 2.0 ports, a Type-C power interface, and a 40-pin Raspberry Pi-compatible GPIO header. EBYTE Allwinner A527/T527 SBC specifications: SoC Allwinner T527 (industrial) / Allwinner A527 (commercial) CPU Octa-core Arm Cortex-A55 processor with four cores @ 1.80 GHz (T527) or 2.0 [...] The post Raspberry Pi-like Allwinner A527/T527 industrial SBC features dual camera support and AI acceleration appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "$4 Shrike-lite FPGA board combines 1120 LUTs Renesas ForgeFPGA with Raspberry Pi RP2040 MCU",
    "link": "https://www.cnx-software.com/2025/10/16/4-shrike-lite-fpga-board-renesas-forgefpga-raspberry-pi-rp2040-mcu/",
    "summary": "Shrike-lite is an ultra-cheap FPGA board based on a 1120 LUTs Renesas ForgeFPGA device (SLG47910V) and also equipped with a Raspberry Pi RP2040 microcontroller. The board also features a USB-C port for power and programming, two 18-pin headers and a 12-pin PMOD-compatible header for I/Os, as well as Boot and Reset buttons, but not much else since it s designed as a minimal development board. Shrike-lite and Shrike boards specifications: FPGA Renesas ForgeFPGA (SLG47910V,1120 LUTs) 1120 5-bit LUTs 1120 DFFs 5 kb distributed memory 32 kb BRAM Configurable through NVM and/or SPI interface Package STQFN-24 MCU Raspberry Pi RP2040 dual-core Cortex-M0+ microcontroller @ 125 MHz with 264KB SRAM FPGA/ MCU interface 6-bit high-speed bridge Storage QSPI flash for configuration and storage USB USB Type-C for programming & power Expansion 2x 18-pin headers for RP2040 and ForgeFPGA s I/Os 12-pin PMOD compatible header Misc Boot and Reset buttons [...] The post $4 Shrike-lite FPGA board combines 1120 LUTs Renesas ForgeFPGA with Raspberry Pi RP2040 MCU appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Orange Pi 6 Plus   CIX P1 SBC offers up to 64GB LPDDR5 memory, 45 TOPS of AI performance",
    "link": "https://www.cnx-software.com/2025/10/15/orange-pi-6-plus-cix-p1-sbc-64gb-lpddr5-45-tops-ai-performance/",
    "summary": "We wrote about the Orion O6N Nano-ITX SBC yesterday, mentioning that the Orange Pi 6 Plus was in the works. The good news is that the CIX P1 (CD8180/CD8180) single board from Orange Pi is now available on AliExpress for $223.90 with 16GB RAM and $268.89 with 32GB RAM, including a heatsink with fan, and a 100W USB-C port adapter. It s the smallest CIX P1 board we ve covered so far, but it still packs of lot of features including up to 64GB LPDDR5, two M.2 Key-M sockets for storage and/or AI accelerators, one M.2 Key-E socket for WiFi and Bluetooth, dual 5GbE networking, five displays interfaces via HDMI, DP, USB-C, and eDP, two 4-lane camera interfaces, and more. Orange Pi 6 Plus specifications: SoC Cix P1 (Codename: CD8180 or CD8160) 12-core DynamIQ processor 4x Cortex A720 big cores @ up to 2.6 GHz 4x Cortex A720 medium cores @ up to [...] The post Orange Pi 6 Plus CIX P1 SBC offers up to 64GB LPDDR5 memory, 45 TOPS of AI performance appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "nRF9160-based Minew MTB04 5G IoT shipping label offers GPS, LTE-M/NB-IoT, 360-day battery life",
    "link": "https://www.cnx-software.com/2025/10/15/nrf9160-based-minew-mtb04-5g-iot-shipping-label-offers-gps-lte-m-nb-iot-360-day-battery-life/",
    "summary": "Minew s MTB04 5G shipping label is a durable, disposable smart IoT tracking label designed for global logistics and real-time asset monitoring. Built on Nordic s nRF9160 SiP and compatible with nRF9151 for satellite communication, it supports GPS and 5G-ready NB-IoT/LTE-M connectivity for worldwide shipment tracking. Its ultra-thin, IP67-rated, and peel-and-stick design makes it stick on parcels, containers, or trucks for high-value or sensitive cargo monitoring. The label integrates multiple sensors for ambient light, movement, tilt, tamper, and optional temperature detection, enabling shipment condition monitoring and security alerts. It features intelligent network switching, ultra-low power consumption (lasting up to 360 days with daily reporting), and built-in 8MB storage. Each unit includes a preloaded SIM with a six-month data plan and supports OTA firmware updates through Minew s TagCloud 3.0 platform for remote management. Minew MTB04 specifications: SiP (one or the other) Nordic Semi nRF9160-SICA system-in-package with Arm Cortex-M33 MCU, 1024 KB flash, 256 KB SRAM, [...] The post nRF9160-based Minew MTB04 5G IoT shipping label offers GPS, LTE-M/NB-IoT, 360-day battery life appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Radxa Orion O6N   A smaller, cheaper 12-core Armv9 Nano-ITX SBC based on CIX P1 (CD8160) SoC",
    "link": "https://www.cnx-software.com/2025/10/14/radxa-orion-o6n-smaller-cheaper-12-core-armv9-nano-itx-sbc-cix-p1-cd8160-soc/",
    "summary": "Radxa Orion O6N is a Nano-ITX SBC powered by CIX P1 (CD8160 variant) 12-core Cortex-A720/A50 processor with a 30/45 TOPS AI accelerator, up to 64GB LPDDR5, support for UFS and M.2 NVMe storage, and plenty of interfaces. It s a smaller and cheaper version of the Orion O6 mini-ITX motherboard introduced at the end of last year. It offers most of the same features, but is equipped with a CD8160 SoC instead of a CD8180 with a slightly lower CPU frequency for the Cortex-A720 big cores (2.6 vs 2.8 GHz), more storage options, fewer display interfaces, no dedicated audio port, 2.5GbE networking instead of 5GbE, and a few other differences you can see in the specifications below. Radxa Orion O6N specifications (highlights in bold and strikethrough show differences against Orion O6): SoC Cix P1 (Codename: CD8160) 12-core DynamIQ processor 4x Cortex A720 big cores @ up to 2.6 GHz 4x Cortex A720 [...] The post Radxa Orion O6N A smaller, cheaper 12-core Armv9 Nano-ITX SBC based on CIX P1 (CD8160) SoC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ADLINK OSM-IMX95   An NXP i.MX 95 OSM Size-L system-on-module for IoT and industrial applications",
    "link": "https://www.cnx-software.com/2025/10/14/adlink-osm-imx95-nxp-i-mx-95-osm-type-l-system-on-module/",
    "summary": "ADLINK OSM-IMX95 is an OSM Size-L solder-on system-on-module powered by an NXP i.MX 95 hexa-core Arm Cortex-A55 SoC with an up to 2 TOPS eIQ Neutron NPU/AI accelerator. It follows the OSM-IMX93 OSM Size-L module based on NXP i.MX 93 SoC, but features a more powerful SoC, up to 16GB LPDDR4L RAM, up to 256GB eMMC flash, and high-speed interfaces like USB 3.0 and PCIe Gen3. The new NXP i.MX 95 OSM module is designed for Smart Home, Smart Building, Smart City, medical, and Industry 4.0 applications. ADLINK OSM-IMX95: SoC NXP i.MX 95 CPU Up to 6x Arm Cortex-A55 cores @ up to 1.8 GHz Real-time co-processors Arm Cortex-M7 @ 800MHz and Cortex-M33 @ 250MHz 2D/3D Graphics Acceleration Arm Mali-G310 3D GPU with OpenGL ES 3.2, Vulkan 1.2, OpenCL 3.0 2D GPU Video Encode / Decode 4Kp30 H.265 and H.264 AI/ML 2 TOPS eIQ Neutron NPU System [...] The post ADLINK OSM-IMX95 An NXP i.MX 95 OSM Size-L system-on-module for IoT and industrial applications appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Ubo Pod   A Raspberry Pi 4/5-based personal AI assistant (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/10/13/ubo-pod-a-raspberry-pi-4-5-personal-ai-assistant/",
    "summary": "The Ubo Pod Developer Edition (DE) is an open-source AI vision and conversational voice assistant platform built around the Raspberry Pi 4 or 5, and designed for developers who want more control over their AI experiences. The device aims to replace black boxes like Amazon Echo or Google Next AI assistants, with an open hardware smart speaker running open-source software, and offering features such as speech-to-text, LLMs/VLMs, text-to-speech, tool calling, and various multiple trigger mechanisms, among others. The Ubo Pod supports both cloud-based and fully local private AI, and features an embedded GUI on the integrated display and a WebUI for no-code setup. Ubo Pod specifications: SBC Ubo Pro 4 Raspberry Pi 4 Ubo Pro 5 Raspberry Pi 5 Storage 32GB MicroSD card included and preloaded with OS. Ubo Pro 5 M.2 PCIe socket for NVMe SSD (or AI accelerator) Display 1.54-inch color TFT IPS display [...] The post Ubo Pod A Raspberry Pi 4/5-based personal AI assistant (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Arylic launches Up2Stream.net website for DIY audio enthusiasts (Sponsored)",
    "link": "https://www.cnx-software.com/2025/10/13/arylic-up2stream-net-website-for-diy-audio-enthusiasts/",
    "summary": "Arylic has launched Up2Stream.net, a dedicated platform for the company s DIY audio products, aiming to build a focused hub where makers can discover, innovate, and access tailored audio solutions. To celebrate the launch, Arylic is offering a 15% off welcome discount on all products available on the new Up2Stream.net website. This limited-time offer is the perfect opportunity for DIY audio enthusiasts to explore the platform s offerings and start their next project with savings. A Hub for DIY Audio Innovation Up2Stream.net is more than just a website it s a community-driven space where makers can discover the tools and inspiration needed to bring their audio ideas to life. The platform showcases Arylic s Up2Stream product line, including WiFi and Bluetooth audio receiver boards, amplifiers, and multiroom streaming solutions. Whether you re upgrading a vintage stereo system, building a wireless speaker, or creating a multiroom audio setup, Up2Stream.net provides everything you need to innovate with ease. [...] The post Arylic launches Up2Stream.net website for DIY audio enthusiasts (Sponsored) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Digilent Analog Discovery Studio Max   A 14-in-1 portable electronics trainer kit with four breadboards",
    "link": "https://www.cnx-software.com/2025/10/13/digilent-analog-discovery-studio-max-a-14-in-1-portable-electronics-trainer-kit-with-four-breadboards/",
    "summary": "The Analog Discovery Studio Max (ADS Max) is an all-in-one electronics trainer kit with four breadboards developed by Digilent for academic and engineering experimentation. Designed for both classroom and remote learning, it combines the functionality of 14 essential instruments into one, making it ideal for circuit design, signal analysis, and embedded systems education. The instruments include an oscilloscope, waveform generator, logic and spectrum analyzers, DMM, programmable and static power supplies, and a protocol analyzer. It supports WaveForms software, LabVIEW, C, and Python for control and data analysis. With a 100 MS/s, 14-bit oscilloscope, 15 V power supplies, 16 digital I/O channels, and WaveForms SDK, it provides a complete learning and experimentation ecosystem. Analog Discovery Studio Max specifications: Core Instruments Oscilloscope 4x single-ended BNC channels, 14-bit resolution (16-bit with averaging) 25 V input range (50 V p-p max), 50 MHz @ 3 dB bandwidth 100 MS/s per channel, 1 M [...] The post Digilent Analog Discovery Studio Max A 14-in-1 portable electronics trainer kit with four breadboards appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "4-inch square HDMI displays with USB touchscreen sell for $33 and up",
    "link": "https://www.cnx-software.com/2025/10/12/4-inch-square-hdmi-displays-with-usb-touchscreen/",
    "summary": "We ve already seen some small HDMI displays, mostly useful for SBCs like Raspberry Pi boards, including a 7-inch monitor with a stand, a 7-inch HDMI touchscreen display, and a 7.9-inch ultrawide HDMI display. Today, I ve come across another form factor with two 4-inch square HDMI touchscreen displays with 720 720 resolution: the VIEWE model appears to be new and is the cheaper of the two at about $33, while the Waveshare 4inch HDMI LCD (C) has been around for a couple of years and offers extra features such as a 3.5 mm audio jack and speakers support, and mounting for Raspberry Pi 3/4/5 single board computers with adapters. VIEWE 4-inch square HDMI touchscreen display VIEWE 4-inch HDMI display (UEDX72720040-HMD-RB-A) specifications: Display 4-inch square HDMI TFT display with 720 720 resolution ST7703 display driver Brightness 300 cd/ Active area 71.93 x 71.93 mm Touchscreen 5-point capacitive touch screen via USB-C [...] The post 4-inch square HDMI displays with USB touchscreen sell for $33 and up appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP32-based dual-port WLED controller features Ethernet port, 24V DC input",
    "link": "https://www.cnx-software.com/2025/10/11/esp32-based-dual-port-wled-controller-features-ethernet-port-24v-dc-input/",
    "summary": "When it comes to ESP32-based WLED controllers, some of the best options are boards like the Adafruit Sparkle Motion, Mini Sparkle Motion, and Sparkle Motion Stick, but most of the time, they are out of stock. Thankfully, there are similar alternatives like the xChroma WLED Type-C and HACK Lab HackLED Pro, with similar features and wider availability. Now adding to that list is the 2-Port ESP32 ETH0 WLED Controller, which not only adds Ethernet connectivity but also supports dual outputs and 5V 24V LEDs, making it an excellent alternative to the Adafruit ones. The board supports both Ethernet and Wi-Fi connectivity and includes an onboard DC-DC converter that delivers a stable 5V supply to the ESP32 and logic circuits. Each output channel is fused with a 6A resettable polyfuse and a status LED that lights up during fault conditions. For added safety, the main power input is protected against reverse polarity, [...] The post ESP32-based dual-port WLED controller features Ethernet port, 24V DC input appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "FoBE IDEA Mesh Tracker C1   An nRF52840-based LoRa GPS tracker with sensors, OLED, knob, and more",
    "link": "https://www.cnx-software.com/2025/10/10/fobe-idea-mesh-tracker-c1-an-nrf52840-based-lora-gps-tracker-with-sensors-oled-knob-and-more/",
    "summary": "Designed by FoBE Studio in China, the FoBE IDEA Mesh Tracker C1 is a LoRa-powered off-grid communication device designed for outdoor GPS tracking, sensor data exchange, and mesh networking in remote environments. Built around the Nordic nRF52840 MCU, it integrates LoRa, GPS, BLE, and motion sensors, making it suitable for location tracking, environmental monitoring, and off-grid communication projects. The device integrates a GPS module, LoRa transceiver, 0.96-inch OLED display, buzzer, a 3-axis accelerometer, and a 3-axis gyroscope. Other ports include a USB-C port, reserved SWDIO/SWCLK headers, an 8-pin GPIO expansion header, and dual IPEX connectors for LoRa and GPS antennas. There is also a rotary encoder and two user buttons, and two indicator LEDs for controls and status feedback. Power input is provided via a 2-pin MX1.25 battery interface for portable, battery-powered outdoor IoT applications. FoBE IDEA Mesh Tracker C1 specifications: SoC Nordic Semiconductor nRF52840 CPU 32-bit Arm Cortex-M4F [...] The post FoBE IDEA Mesh Tracker C1 An nRF52840-based LoRa GPS tracker with sensors, OLED, knob, and more appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Avalue EPC-ASL Intel N97 fanless industrial mini PC is designed for 24/7 operation",
    "link": "https://www.cnx-software.com/2025/10/10/avalue-epc-asl-intel-n97-fanless-industrial-mini-pc-is-designed-for-24-7-operation/",
    "summary": "Avalue Technology s EPC-ASL is a rugged fanless industrial mini PC built around the Intel Processor N97. Designed for 24/7 operation and edge computing, the mini PC is suitable for industrial environments, such as smart manufacturing, retail, logistics, and surveillance. The PC supports up to 16GB DDR5 memory, dual 2.5GbE, and various I/O options, including six USB ports, dual RS-232, HDMI 2.0, and DisplayPort 1.4a for multi-display setups. Storage and expansion are supported by M.2 Key-B/E slots, which accommodate Wi-Fi 6E, LTE, 5G, or SSD modules for enhanced connectivity and storage. The system also includes TPM 2.0 security, +12V/24V DC input, and wall-mount support. Avalue EPC-ASL specifications: SoC Intel Processor N97 quad-core processor up to 3.6 GHz with 6MB cache, 24EU Intel UHD Graphics Gen 12 @ 1.2 GHz; TDP: 12W System Memory Up to 16GB DDR5 4800MHz via 1x SO-DIMM socket (Up to 64GB DDR5 is likely supported, but Avalue [...] The post Avalue EPC-ASL Intel N97 fanless industrial mini PC is designed for 24/7 operation appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Weffort Outdoor Smart Shade Review with Home Assistant over Matter/Thread",
    "link": "https://www.cnx-software.com/2025/10/09/weffort-outdoor-smart-shade-review-with-home-assistant-over-matter-thread/",
    "summary": "We re going to do a quick review of smart outdoor motorised shades from Weffort another brand that makes smart shades compatible with popular Smart Home platforms, including Home Assistant, SmartThings, Google Home, Apple HomeKit, and Amazon Alexa. The cool thing about Weffort s shades is that everything s fully customisable and made-to-order from the fabric and motors to casing styles, size, and the Smart Home platform you want to use with. With various options, it might sound complicated at first (usually people just let a pro handle it), but it s actually way easier than you think. Plus, the shades are lightweight, so you can totally install them by yourself. Custom-made shades Before we got the test unit from Weffort, they let us locate a good spot for installation and testing so that we could take measurements following the guide on their website, which also has tips on choosing materials, installation, measurements, [...] The post Weffort Outdoor Smart Shade Review with Home Assistant over Matter/Thread appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "upyOS modular MicroPython-based OS for microcontrollers works with ESP32, RP2040, etc ",
    "link": "https://www.cnx-software.com/2025/10/09/upyos-modular-micropython-based-os-for-microcontrollers-esp32-rp2040/",
    "summary": "upyOS is a modular, lightweight MicroPython-based operating system (OS) that provides a Unix-like experience on low-resource microcontrollers such as Espressif Systems ESP32/ESP32-C3/ESP32-S3, Raspberry Pi RP2040, and others. Inspired by smolOS, upyOS offers remote development tools, OTA updates, and a built-in web server. Its modular architecture separates system functions into reusable components, instead of large, monolithic programs. Key Features: Modular architecture: Commands and system functionality are broken down into small, independent modules to reduce memory usage. Built-in shell environment: Execute commands and scripts directly, providing a Unix-like CLI experience. Startup and shutdown scripting: Configure boot and shutdown behaviors using /etc/init.sh and /etc/end.sh. Recovery mode: A built-in failsafe mechanism lets users recover the system when booting fails. Background execution: Supports threads and asyncio for background tasks, along with & sufix, hold, resume, kill and killall commands for process control. Remote development support: Telnet and FTP servers allow file transfer and terminal access over [...] The post upyOS modular MicroPython-based OS for microcontrollers works with ESP32, RP2040, etc appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Ampetronic Auri is a Bluetooth Auracast audio system for public spaces",
    "link": "https://www.cnx-software.com/2025/10/08/ampetronic-auri-bluetooth-auracast-audio-system-for-public-spaces/",
    "summary": "Ampetronic, in partnership with Listen Technologies, has introduced Auri, a Bluetooth Auracast-powered audio system/assistive listening solution designed for public spaces. It is designed to deliver clear, wireless audio to any Auracast-enabled device or dedicated Auri receiver without the need for pairing. The Auri system consists of the TX2N transmitter, RX1 receiver, and D4/D16 docking stations, managed through Auri Manager software. The TX2N features a 100 m coverage with balanced mic/line inputs, PoE, Audio over IP, and optional Dante support. The RX1 receiver features dual 3.5 mm jacks, an OLED display, and low-latency audio output for earbuds, headphones, or hearing aids. Docking stations become useful for charging, configuration, and network-based management for multiple receivers. These features make this system suitable for corporate, education, entertainment, government, healthcare, transport, and hospitality environments. Auri Auracast system specifications: Auri RX1 audio receiver Audio Output 2x 3.5mm TRRS jacks for wired headphones or inductive neck loops [...] The post Ampetronic Auri is a Bluetooth Auracast audio system for public spaces appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Qualcomm acquires Arduino, introduces Arduino UNO Q  dual-brain  SBC",
    "link": "https://www.cnx-software.com/2025/10/07/qualcomm-acquires-arduino-introduces-arduino-uno-q-dual-brain-sbc/",
    "summary": "Qualcomm has just signed an agreement to acquire Arduino, and the goal of the purchase is to combine Qualcomm s leading-edge products and technologies with Arduino s vast ecosystem and community to empower businesses, students, entrepreneurs, tech professionals, educators, and enthusiasts to quickly and easily bring ideas to life. They also took the opportunity to launch the Arduino UNO Q dual-brain SBC powered by a Qualcomm DragonWing QRB2210 SoC running Linux and an STMicro STM32U585 MCU for real-time control, as well as the Arduino App Lab integrated development environment to unify the Arduino journey across Real time OS, Linux, Python, and AI flows . Will the acquisition change anything? I suppose we ll see more and more Arduino boards based on Qualcomm processors, but the company also promises to preserve Arduino s open approach and community: Arduino will retain its independent brand, tools, and mission, while continuing to support a wide range of microcontrollers and microprocessors [...] The post Qualcomm acquires Arduino, introduces Arduino UNO Q dual-brain SBC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Sub $7 CH32V317 board offers 10/100Mbps Ethernet, dual USB 2.0 Type-C, DVP interface",
    "link": "https://www.cnx-software.com/2025/10/07/sub-7-ch32v317-board-offers-10-100mbps-ethernet-dual-usb-2-0-type-c-dvp-interface/",
    "summary": "The nanoCH32V317 from MuseLab is a low-cost RISC-V development board designed for prototyping embedded systems and education. Built around the 144MHz WCH CH32V317WCU6 MCU. This development board is suitable for various embedded, IoT, prototyping, and automation projects. Other features of the development board include a USB 2.0 high-speed and full-speed controller, a 10/100Mbps Ethernet MAC with PHY, SDIO, and a DVP interface for digital video input, as well as advanced motor PWM timers for control applications. The board also includes an 8MHz main crystal and a 32.768KHz RTC crystal. For programming, it includes a dual USB Type-C interface, a USB ISP, as well as an SWD port. nanoCH32V317 board specifications: MCU WCH CH32V317WCU6 32-bit RISC-V core up to 144 MHz clock frequency USB 2.0 High-Speed (HS) and Full-Speed (FS) controllers Integrated Ethernet MAC + 10/100M PHY DVP interface, SDIO, and advanced motor PWM timer support Memory Up to [...] The post Sub $7 CH32V317 board offers 10/100Mbps Ethernet, dual USB 2.0 Type-C, DVP interface appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "wafer.space lets you design your custom silicon just for $7 per die (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/10/07/wafer-space-lets-you-design-your-custom-silicon-just-for-7-per-die/",
    "summary": "wafer.space has launched its first pooled silicon fabrication run on Crowd Supply, called the GF180MCU Run 1, which enables designers, engineers, and companies to create 1,000 custom ASICs using GlobalFoundries 180 nm mixed-signal process. Each slot provides a fixed 3.88 5.07 mm (19.67 mm ) die area replicated 1,000 times, meaning you will receive 1000 chips, with options for bare dies or chip-on-board packaging. The GF180MCU process supports 5 metal layers, MIM capacitors (~2.0 fF/ m ), poly and high-res poly resistors, and standard-Vt MOS devices. Users can handle their own pad ring, ESD, and I/O layout while wafer.space manages fabrication, dicing, and shipping from Singapore. Designs can be open or closed source, and full wafers are also available for advanced testing or collection. Designs are submitted to wafer.space as GDSII files (the standard file format for chip layouts). Wafer.space automatically checks these files to make sure they can be manufactured correctly. [...] The post wafer.space lets you design your custom silicon just for $7 per die (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "The latest Raspberry Pi OS images are now based on Debian 13  Trixie ",
    "link": "https://www.cnx-software.com/2025/10/06/raspberry-pi-os-debian-13-trixie/",
    "summary": "Since Debian 13 Trixie was released last August, it was just a matter of time until Raspberry Pi OS followed. Raspberry Pi announced the update from Bookworm to Trixie a few days ago. The new Raspberry Pi OS images get the new and updated packages from Debian 13, and features like 64-bit time support to solve the Y2K38 bug. However, as Simon Long, UX engineer at Raspberry Pi, points out, there have been fewer changes in newer versions of Debian, and most changes in the new version of Pi OS are cosmetic, although there are some interesting under-the-hood changes as well. The most obvious change from the user s perspective is the new theme featuring a completely new set of icons, a new font (Nunito Sans Light), new desktop backgrounds (the new default is a photo of the sun rising over the Drakensberg mountains in Lesotho), and some other small tweaks. [...] The post The latest Raspberry Pi OS images are now based on Debian 13 Trixie appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "1GHz Renesas RA8T2 Cortex-M85 MCUs feature MRAM and EtherCAT for industrial motor control",
    "link": "https://www.cnx-software.com/2025/10/06/1ghz-renesas-ra8t2-cortex-m85-mcus-feature-mram-and-ethercat-for-industrial-motor-control/",
    "summary": "Renesas has recently introduced the new RA8T2, an AI-powered motor control Cortex-M85 MCU that can be considered a direct upgrade to the RA8T1, which launched last year. The RA8T2 offers higher performance along with networking options for industrial, robotics, and other motor control systems. The RA8T2 features a 1GHz Arm Cortex-M85 core, an optional 250MHz Cortex-M33 core, up to 1MB MRAM and 2MB SRAM, a 300MHz PWM timer, dual 16-bit ADCs with simultaneous sampling, high-speed comparators, fast PWM shutdown, and more. Connectivity options include dual Gigabit Ethernet, EtherCAT slave, USB, CAN FD, I3C, and SPI, while security features include TrustZone and a cryptographic engine. Renesas RA8T2 key features and specifications: MCU core Arm Cortex-M85 up to 1 GHz (Armv8.1-M, TrustZone, FPU, MVE, ETM) Arm Cortex-M33 up to 250 MHz (Armv8-M, DSP, TrustZone, ETM) Memory & Storage Up to 1 MB MRAM 2 MB SRAM (with ECC) 256 KB TCM for [...] The post 1GHz Renesas RA8T2 Cortex-M85 MCUs feature MRAM and EtherCAT for industrial motor control appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Easily add 80+ Mbps Ethernet to microcontrollers with WIZ630io QSPI RJ45 module",
    "link": "https://www.cnx-software.com/2025/10/05/easily-add-80-mbps-ethernet-to-microcontrollers-with-wiz630io-qspi-rj45-module/",
    "summary": "WIZnet WIZ630io is a small module featuring an RJ45 jack and a W6300 controller supporting up to 80+ Mbps Ethernet over QSPI @ 150 MHz. As a reminder, the W6300 features 64KB of SRAM for 8 sockets, each with a 4KB TX/RX buffer by default. It is notably found in the WIZnet W6300-EVB-Pico2 development board powered by a Raspberry Pi RP2350 MCU. The WIZ630io allows you to easily add Ethernet to any RP2350 board or other microcontroller with a SPI or QSPI interface. WIZnet WIZ630io specifications: W6300 QSPI Ethernet controller Host Interface High-speed QSPI (MODE 0/3), system bus with 2 address signals & 8-bit data Internal 32KB SRAM for Tx/ Rx buffers (64KB in total) 8x independent sockets with 64KB Memory 10BaseT / 10BaseTe / 100BaseTX Ethernet PHY Integrated Auto negotiation (Full and half-duplex, 10 and 100-based) Auto-MDIX only on Auto-Negotiation Mode IP Fragmentation not supported Hardwired TCP/IP protocols [...] The post Easily add 80+ Mbps Ethernet to microcontrollers with WIZ630io QSPI RJ45 module appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "kv4p HT   Turn an Android smartphone into a ham radio transceiver",
    "link": "https://www.cnx-software.com/2025/10/04/kv4p-ht-turn-an-android-smartphone-into-an-ham-radio-transceiver/",
    "summary": "kv4p HT is an open-source hardware VHF or UHF radio designed to plug into the USB-C port of an Android smartphone and turn it into a handheld ham radio transceiver. It s based on an ESP32 wireless module and an SA818 radio module. This accessory makes your phone capable of off-grid voice and text communication with a Technician-class amateur radio license. It s small enough to fit into a pocket, partially because it does not need a battery, relying on the built-in battery of your phone. kv4p HT V2.0 specifications: Wireless module ESP32-WROOM-32E-N4 SoC ESP32 dual-core Tensilica LX6 microcontroller @ up to 240 MHz with 520KB SRAM Storage 4MB flash Wireless 2.4 GHz WiFi 4 and Bluetooth 4.2 BR/LE connectivity, built-in PCB antenna VHF Radio SA818-V radio module or DRA818V (134 174MHz) VHF low-pass filter SMA antenna connector Tx Power Up to 1 Watt for several [...] The post kv4p HT Turn an Android smartphone into a ham radio transceiver appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Linux-based Vega OS replaces Android-based Fire OS  in Amazon Fire TV Stick 4K Select",
    "link": "https://www.cnx-software.com/2025/10/03/linux-based-vega-os-replaces-android-based-fire-os-in-amazon-fire-tv-stick-4k-select/",
    "summary": "Amazon has recently introduced the Fire TV Stick 4K Select media streamer with a MediaTek MT8698 quad-core Cortex-A55 processor, 1GB RAM, 8GB eMMC flash, HDMI 2.1 video output, and WiFi 5 and Bluetooth 5.0 connectivity. However, the most interesting part of the announcement is the software, as Amazon has dropped the Android-based Fire OS used in its previous devices and instead relies on the new Linux-based Vega OS for the Fire TV Stick 4K Select. Amazon Fire TV Stick 4K Select (AFTCA002) specifications: SoC MediaTek MT8698 MCM CPU Quad-core Arm Cortex-A55 clocked up to 1.7 GHz GPU Mali G310v2 up to 500 MHz with OpenGL ES 3.1 support VPU (hardware video decoder) AV1 up to 3840x2160p (4K) @ 60 fps, 100 Mbps, 8-bit and 10-bit input with HDR10, HDR10+, and HLG H.265 (HEVC) up to 3840x2160p (4K) @ 60 fps, 35 Mbps, 8-bit and 10-bit input with [...] The post Linux-based Vega OS replaces Android-based Fire OS in Amazon Fire TV Stick 4K Select appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "M5Stack LLM-8850 card   An M.2 M-Key AI accelerator module based on Axera AX8850 24 TOPS SoC",
    "link": "https://www.cnx-software.com/2025/10/03/m5stack-llm-8850-card-an-m-2-m-key-ai-accelerator-module-based-on-axera-ax8850-24-tops-soc/",
    "summary": "M5Stack LLM 8850 card is an M.2 M-Key 2242 AI acceleration module powered by an Axera AX8850 SoC delivering 24 TOPS ( INT8) of performance, and suitable for host devices such as Raspberry Pi 5, Rockchip RK3588 SBCs, and even x86 PCs like mini PCs with a spare M.2 Key-M socket. The card ships with 8GB RAM, a 32Mbit SPI NOR flash, and also supports H.265/H.264 8Kp30 video encoding and 8Kp60 video decoding, with up to 16 channels for 1080p videos. It is also equipped with an active cooling system to maintain stable temperatures and prevent thermal degradation inside enclosures. M5Stack LLM 8850 card specifications: SoC Axera AX8850 CPU Octa-core Cortex A55 processor at 1.7 GHz NPU 24 TOPS @ INT8 VPU Video Encoder 8K @ 30 fps H.264/H.265 encoding, supports scaling / cropping Video Decoder 8K @ 60 fps H.264/H.265 decoding, supports 16 channels 1080p parallel decoding, supports scaling / cropping Memory 8GB 64 bit LPDDR4x @ 4266 Mbps Storage 32Mbit QSPI NOR [...] The post M5Stack LLM-8850 card An M.2 M-Key AI accelerator module based on Axera AX8850 24 TOPS SoC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Snapdragon X2 Elite Extreme and X2 Elite processors target high-end Windows PCs",
    "link": "https://www.cnx-software.com/2025/10/02/snapdragon-x2-elite-extreme-and-x2-elite-processors-target-high-end-windows-pcs/",
    "summary": "Qualcomm has recently announced the Snapdragon X2 Elite Extreme (X2E-96-100) and Snapdragon X2 Elite (X2E-88-100 and X2E-80-100) processors for Windows PCs, which the company claims are the Fastest and Most Efficient for laptops. All three 3nm parts are equipped with six Performance cores clocked at up to 3.6 GHz, six or twelve Premium cores clocked at up to 5 GHz (single core) or 4.4 GHz (multi-core), an Adreno X2-85 or X2-90 GPU, an 80 TOPS Hexagon NPU for Copilot+, and an LPDDR5x memory interface for up to 128+ GB memory with up to 228GB/s bandwidth. Other highlights include the Snapdragon X75 5G modem, FastConnect 7800 WiFi 7 and Bluetooth 5.4 chipset, 4K video resolution for built-in and external displays, USB4, PCIe Gen5 interfaces, and more. Let s check the full specifications and differences between the three Snapdragon X2 Elite devices in the table below. Qualcomm claims the Snapdragon X2 Elite Extreme [...] The post Snapdragon X2 Elite Extreme and X2 Elite processors target high-end Windows PCs appeared first on CNX Software - Embedded Systems News ."
  }
]