[
  {
    "title": "Old Ryzen AM4 CPUs top US, UK Amazon charts as DDR5 pricing pushes buyers to last-gen platform   DDR4-friendly Ryzen 5 5800X, XT claim spots in the top 5",
    "link": "https://www.tomshardware.com/pc-components/cpus/old-ryzen-am4-cpus-top-us-uk-amazon-charts-as-ddr5-pricing-pushes-buyers-to-last-gen-platform-ddr4-friendly-ryzen-5-5800x-xt-claim-spots-in-the-top-5",
    "summary": "The five-year-old Ryzen 7 5800X and its 2024 refresh, the 5800XT, are among the best-selling CPUs this holiday season despite being two generations behind Zen 5."
  },
  {
    "title": "Seagate's 22TB Expansion external hard drive drops to an all-time low of $249.99   ideal for massive backups and data archives",
    "link": "https://www.tomshardware.com/pc-components/seagates-22tb-expansion-external-hard-drive-drops-to-an-all-time-low-of-usd249-99-ideal-for-massive-backups-and-data-archives",
    "summary": "The Seagate Expansion 22TB external HDD delivers huge storage capacity at a steep discount, making it a compelling choice for users who need dependable, plug-and-play mass storage."
  },
  {
    "title": "No, Asus isn't going into memory manufacturing   Taiwanese tech giant issues statement smashing rumor",
    "link": "https://www.tomshardware.com/pc-components/dram/no-asus-isnt-going-into-memory-manufacturing-taiwanese-tech-giant-issues-statement-smashing-rumor",
    "summary": "Asus has directly shut down a spurious rumor claiming it would enter the memory market within the next six months."
  },
  {
    "title": "AMD's dual-cache Ryzen 9 9950X3D2 appears in first benchmark leaks   gaming-focused CPU features 192MB of L3 cache stacked across both CCDs",
    "link": "https://www.tomshardware.com/pc-components/cpus/amds-dual-cache-ryzen-9-9950x3d2-appears-in-first-benchmark-leaks-gaming-focused-cpu-features-192mb-of-l3-cache-stacked-across-both-ccds",
    "summary": "AMD is preparing a new flagship gaming chip, the Ryzen 9 9950X3D2, which is said to have 192MB of L3 cache thanks to its dual-cache design that will add 3D V-Cache across both CCDs. The CPU originally leaked months ago, but it has finally appeared on benchmarking databases PassMark and Geekbench, with amicable scores to boot."
  },
  {
    "title": "The best Boxing Day tech deals at Amazon UK, Argos, Currys, Very, and more   huge price drops on gaming PCs, 3D printers, laptops, and peripherals",
    "link": "https://www.tomshardware.com/pc-components/the-best-boxing-day-tech-deals-at-amazon-uk-argos-currys-very-and-more-huge-price-drops-on-gaming-pcs-3d-printers-laptops-and-peripherals",
    "summary": "Christmas might be over with, but it's time to secure yourself a Boxing Day tech deal. We've put together a list of the best discounts from retailers including Amazon, Currys, Argos, Very, and more."
  },
  {
    "title": "Nvidia reportedly backs away from its effort to make its own public cloud, team reorg eases friction with customers   chipmaker shifts unit's focus to internal RD",
    "link": "https://www.tomshardware.com/tech-industry/nvidia-restructures-dgx-cloud-team-refocuses-cloud-efforts-internally",
    "summary": "Nvidia has reorganized its cloud computing group, further scaling back its ambitions to operate a public cloud service that would directly compete with Amazon Web Services."
  },
  {
    "title": "Shrug off the RAM price crisis with this $180 off ASRock X870 Taichi bundle   32GB V-Color DDR5-6000 RAM and Cooler Master 212 CPU cooler included",
    "link": "https://www.tomshardware.com/pc-components/motherboards/shrug-off-the-ram-price-crisis-with-this-usd180-off-asrock-x870-taichi-bundle-32gb-v-color-ddr5-6000-ram-and-cooler-master-212-cpu-cooler-included",
    "summary": "Buy this combo deal and get a flagship-class X870E Taichi motherboard, 32GB of V-Color XFinity+ DDR5-6000 RAM, and a free CPU heatsink for $529.99."
  },
  {
    "title": "LG UltraGear evo gaming monitor lineup announced ahead of CES 2026   27-inch 5K Mini LED, 39-inch curved Tandem OLED, and a 52-inch 5K2K large format display",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/lg-ultragear-evo-gaming-monitor-lineup-announced-ahead-of-ces-2026-27-inch-5k-mini-led-39-inch-curved-tandem-oled-and-a-52-inch-5k2k-large-format-display",
    "summary": "LG is expanding its gaming monitor portfolio with the launch of UltraGear evo, a premium sub-brand that brings a 5K Mini LED monitor with 2,304 dimming zones, a curved 5K2K OLED ultrawide, and the world s largest 5K2K gaming display"
  },
  {
    "title": "How China s control of battery supply chains is becoming a critical risk for U.S. military power and AI initiatives   reducing reliance will take nearly a decade",
    "link": "https://www.tomshardware.com/tech-industry/how-chinas-control-of-battery-supply-chains-is-becoming-a-critical-risk-for-us-ai-and-defense",
    "summary": "According to a special report by the New York Times, the U.S. government is concerned about how China sits at the center of that ecosystem, controlling large portions of battery manufacturing and processing."
  },
  {
    "title": "Intel displays tech to build extreme multi-chiplet packages 12 times the size of the largest AI processors, beating TSMC's biggest    floorplan the size of a cellphone, armed with HBM5, 14A compute tiles and 18A SRAM",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/intel-displays-tech-to-build-extreme-multi-chiplet-packages-12-times-the-size-of-the-largest-ai-processors-beating-tsmcs-planned-biggest-floorplan-the-size-of-a-cellphone-armed-with-hbm5-14a-compute-tiles-and-18a-sram",
    "summary": "Intel Foundry has released a video of a multi-chiplet 2.5D/3D processor with a 10,296 mm^2 silicon footprint, including leading-edge technologies such as 14A and 18A."
  },
  {
    "title": "Copy of Grand Theft Auto that runs in a web browser gets taken down by DMCA   Take Two says DOS Zone infringed company s intellectual property rights despite disclaimers and requirement to own original copy of title for full game",
    "link": "https://www.tomshardware.com/video-games/browser-run-copy-of-grand-theft-auto-gets-taken-down-by-dcma-take-two-says-dos-zone-infringed-companys-intellectual-property-rights-despite-disclaimers-and-requirement-to-own-original-copy-of-title-to-run-full-game-online",
    "summary": "Take-Two takes down the online demo of GTA: Vice City found on DOS Zone says it violates its copyright."
  },
  {
    "title": "Samsung Odyssey OLED G6 S27FG60 27-inch 500 Hz QD-OLED gaming monitor review: Phenomenal performance and color",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/samsung-odyssey-oled-g6-s27fg60-27-inch-500-hz-qd-oled-gaming-monitor-review",
    "summary": "Samsung brings maximum performance to one of its most colorful monitors with the Odyssey OLED G6 S27FG60. It s a 27-inch QD-OLED with 500 Hz, Adaptive-Sync, HDR True Black 500, HDR10, HDR10+ and wide gamut color."
  },
  {
    "title": "Elon Musk says xAI will have more AI compute than everyone else combined within five years   Macrohard-branded Colossus 2 data center a nod to Musk's AI project to challenge Microsoft",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/elon-musk-says-xai-will-have-more-ai-compute-than-everyone-else-combined-within-five-years-macrohard-branding-emblazoned-on-the-roof-of-the-colossus-2-data-center-in-nod-to-the-billionaires-ai-project-to-challenge-microsoft",
    "summary": "Elon Musk claimed on X that xAI will have more computing power than everyone else combined in less than five years."
  },
  {
    "title": "Robots fashioned from dead lobster exoskeletons have awesome strength, light weight, and flexibility   necrobotics advance mixes sustainable food waste with synthetic components",
    "link": "https://www.tomshardware.com/maker-stem/robot-kits/robots-fashioned-from-dead-lobster-exoskeletons-have-awesome-strength-light-weight-and-flexibility-necrobotics-advance-mixes-sustainable-food-waste-with-synthetic-components",
    "summary": "Swiss scientists have demonstrated the use of dead lobster tails as robotic appendages."
  },
  {
    "title": "Customer orders two Samsung 9100 Pro SSDs, receives 20 SSDs worth over $5,100 instead   lucky score of two boxes packed with ultra-fast 2 TB PCIe 5.0 drives",
    "link": "https://www.tomshardware.com/pc-components/ssds/redditor-orders-2x-samsung-9100-pro-ssds-receives-two-full-boxes-instead-worth-over-usd5-000-providentially-lucky-score-includes-20x-ultra-fast-2-tb-pcie-5-0-drives",
    "summary": "In what could only be described as an extremely timely Christmas miracle, a Redditor has received two full boxes of expensive, flagship SSDs worth $5,100, even though they paid for just two. A tale of Amazon's packaging error turned into relief amidst the ongoing component crisis."
  },
  {
    "title": "Google is allowing users to change their Gmail address, per official Google support doc   experimental @gmail feature rolling out in India first, no official announcement yet",
    "link": "https://www.tomshardware.com/software/google-workspace/google-is-allowing-users-to-change-their-gmail-address-as-per-official-google-support-doc-experimental-gmail-feature-rolling-out-in-india-first-no-official-announcement-yet",
    "summary": "Google is finally adding a much-awaited feature to Gmail, allowing to change your old @gmail addresses without needing to create a new account. After switching to a new Gmail, you'll receive emails on both addresses, and all your existing data will remain intact."
  },
  {
    "title": "Laptop maker Framework announces another immediate memory price hike, says additional increase expected within a month   encourages buyers to bring their own memory and check PCPartPicker for better deals",
    "link": "https://www.tomshardware.com/laptops/laptop-maker-framework-announces-another-memory-price-hike-says-another-increase-is-coming-within-a-month-encourages-buyers-to-bring-their-own-memory-and-check-pcpartpicker-for-better-deals",
    "summary": "Framework is increasing the prices of its memory modules in response to market pricing once more. Also encourages its buyers to look for better deal elsewhere as the memory market crunch bites into the PC building industry."
  },
  {
    "title": "AI data centers may soon be powered by retired Navy nuclear reactors from aircraft carriers and submarines   firm asks U.S. DOE for a loan guarantee to start the project",
    "link": "https://www.tomshardware.com/tech-industry/startup-proposes-using-retired-navy-nuclear-reactors-from-aircraft-carriers-and-submarines-for-ai-data-centers-firm-asks-u-s-doe-for-a-loan-guarantee-to-start-the-project",
    "summary": "A Texas energy startup proposes repurposing retired U.S. Navy nuclear reactors for use in AI data centers."
  },
  {
    "title": "This AMD-powered iBuyPower prebuilt has 32GB of DDR5 memory, Ryzen 7 CPU, and an RX 9060 XT GPU for just $1000   $250 off provides pricing relief during RAM pricing crisis",
    "link": "https://www.tomshardware.com/pc-components/this-amd-powered-ibuypower-prebuilt-has-32gb-of-ddr5-ram-ryzen-7-cpu-and-an-rx-9060-xt-gpu-for-just-usd1000-usd250-off-provides-pricing-relief-during-ram-pricing-crisis",
    "summary": "As memory prices remain stubbornly high, this $999 iBuyPower Slate gaming PC delivers a well-rounded AMD configuration."
  },
  {
    "title": "Nvidia buys AI chip startup Groq's assets for $20 billion in the company's biggest deal ever   Transaction includes acquihires of key Groq employees, including CEO",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/nvidia-buys-ai-chip-startup-groqs-assets-for-usd20-billion-in-the-companys-biggest-deal-ever-transaction-includes-acquihires-of-key-groq-employees-including-ceo",
    "summary": "Groq, a rival to Nvidia in the AI chip race, has entered into a non-exclusive agreement with the Green Team, with a deal valued at $20 billion, roughly $13 billion more than Groq's last evaluation. Nvidia will also hire the firm's founder and CEO, along with its President, as part of the biggest purchase it's ever made."
  },
  {
    "title": "Arch Linux kills off Nvidia Pascal GPU support   users still running GTX 10-series graphics cards will have to manually install older drivers",
    "link": "https://www.tomshardware.com/pc-components/gpus/arch-linux-kills-off-pascal-gpu-support-users-still-running-gtx-10-series-graphics-cards-will-have-to-manually-install-older-drivers",
    "summary": "Arch Linux is one of the first Linux distros to officially axe Pascal GPU support after Nvidia cancelled support in July. Arch is now using the 590 Nvidia Linux driver as its default Nvidia driver, which lacks Pascal support."
  },
  {
    "title": "Qualcomm Snapdragon X Elite's latest Linux benchmarks show significant regressions, performs similarly to five-year-old Intel Tiger Lake chips   promising chip continues to be plagued by software support issues",
    "link": "https://www.tomshardware.com/laptops/ultrabooks-ultraportables/qualcomm-snapdragon-x-elites-latest-linux-benchmarks-show-significant-regressions-promising-chip-continues-to-be-plagued-by-software-support-issues",
    "summary": "Qualcomm Snapdragon X Elite's latest Linux benchmarks show significant regressions"
  },
  {
    "title": "Russian enthusiasts planning do-it-yourself DDR5 memory amidst the worldwide shortage   building your own RAM is as 'easy' as sourcing your own memory modules and soldering them on empty PCBs",
    "link": "https://www.tomshardware.com/pc-components/ddr5/russian-enthusiasts-are-building-their-own-ddr5-ram-amidst-the-worldwide-shortage-as-easy-as-sourcing-your-own-memory-modules-and-soldering-them-on-empty-pcbs",
    "summary": "What are you willing to do to get your hands on DDR5 memory these days? Whatever it is, it probably doesn't match the lengths these Russian modders are reaching by trying to build their own RAM. You can actually follow along with your own parts, along with a bit of time to solder the memory ICs to the PCB."
  },
  {
    "title": "China chipmaker SMIC raises wafer prices by about 10% as memory demand tightens capacity",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/smic-raises-wafer-prices-by-about-10-percent-as-memory-demand-tightens-capacity",
    "summary": "The adjustment comes as China s largest foundry runs near full utilization and faces sustained demand from domestic customers building inventories of memory and logic chips."
  },
  {
    "title": "Starlink satellite pictured  tumbling  after recent  anomaly  in space   it will be incinerated when it enters the Earth s atmosphere in a few weeks",
    "link": "https://www.tomshardware.com/service-providers/network-providers/starlink-satellite-pictured-tumbling-after-recent-anomaly-in-space-it-will-be-incinerated-when-it-enters-the-earths-atmosphere-in-a-few-weeks",
    "summary": "Starlink satellite 35956 suffered from a serious anomaly on December 17. It has been pictured largely intact, tumbling in space, but it will be weeks before it burns up in the Earth's atmosphere."
  },
  {
    "title": "Pi calculation world record shattered at 314 trillion digits with a four-month run on a single server   StorageReview retakes the crown, thanks to storage bandwidth",
    "link": "https://www.tomshardware.com/pc-components/storage/pi-calculating-record-shattered-at-314-trillion-digits-with-a-four-month-run-on-a-single-server-storagereview-retakes-the-crown-thanks-to-storage-bandwidth",
    "summary": "StorageReview takes the Pi crown again with 314 trillion digits calculated"
  },
  {
    "title": "Corsair RM850x SHIFT 850W power supply review: Platinum performance at Gold pricing",
    "link": "https://www.tomshardware.com/pc-components/power-supplies/corsair-rm850x-shift-850w-power-supply-review",
    "summary": "An innovative power supply that relocates modular connectors to the chassis side for superior cable management, delivering Cybenetics Platinum efficiency under a Gold-level marketing badge for builders willing to verify case compatibility."
  },
  {
    "title": "TSMC s Christmas Card evokes a retro 8-bit winter wonderland    pixelated  kids play Breakout with snowballs, carving out a festive scene",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/tsmcs-christmas-card-evokes-an-8-bit-winter-wonderland-pixelated-kids-play-breakout-with-snowballs-carving-out-a-festive-scene",
    "summary": "TSMC has shared a super-cool digital greetings card with a retro-nostalgic 8-bit style gaming animation."
  },
  {
    "title": "This $299 Asus 4K gaming monitor is back to its lowest ever price   save $170 on this budget-friendly IPS display with fast 160Hz refresh rate and Nvidia G-Sync support",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/this-usd299-asus-4k-gaming-monitor-is-back-to-its-lowest-ever-price-save-usd170-on-this-budget-friendly-ips-display-with-fast-160hz-refresh-rate-and-nvidia-g-sync-support",
    "summary": "This impressive Asus ROG gaming monitor, with a 4K resolution and HDR support, along with a decent 160Hz refresh rate, is back at its lowest ever price on Amazon for just $299."
  },
  {
    "title": "Floppy disk pre-paid cash card launched in Taiwan   NFC payment method 'only has a card function' warns supplier, so keep it out of your FDD",
    "link": "https://www.tomshardware.com/pc-components/storage/floppy-disk-pre-paid-cash-card-launched-in-taiwan-nfc-payment-method-only-has-a-card-function-warns-supplier-so-keep-it-out-of-your-fdd",
    "summary": "Taiwan s iPass has released a new custom payment card that looks just like a Floppy Disk."
  },
  {
    "title": "New $110 Intel Z790 motherboard with DDR4 support is a Christmas gift to the world amid the memory pricing crisis   an affordable home for Alder Lake, Raptor Lake, and Raptor Lake Refresh CPUs",
    "link": "https://www.tomshardware.com/pc-components/motherboards/new-usd110-intel-z790-motherboard-with-ddr4-support-is-a-christmas-gift-to-the-world-amid-the-memory-pricing-crisis-an-affordable-home-for-alder-lake-raptor-lake-and-raptor-lake-refresh-cpus",
    "summary": "Chinese manufacturer Onda launches the Z790PRO WiFi B4 motherboard with a sub-$100 price tag."
  },
  {
    "title": "AMD EXPO 1.2 could supercharge Ryzen CPUs with CUDIMM support amid global DRAM crunch   full AMD CUDIMM support is on the horizon",
    "link": "https://www.tomshardware.com/pc-components/ram/amd-expo-1-2-could-supercharge-ryzen-cpus-with-cudimm-support-amid-global-dram-crunch-full-amd-cudimm-support-is-on-the-horizon",
    "summary": "AMD prepares EXPO 1.2 revision that could bring CUDIMM support to next-generation Ryzen processors."
  },
  {
    "title": "The Christmas Present Peeker Trap uses an ESP32 Cam board, photoresistor, buzzer, and connected app to catch even the sneakiest of gift glimpsers",
    "link": "https://www.tomshardware.com/maker-stem/the-christmas-present-peeker-trap-uses-an-esp32-cam-board-photoresistor-buzzer-and-connected-app-to-frame-even-the-sneakiest-of-gift-glimpsers",
    "summary": "Here's a project for makers who suspect that they have a Christmas present peeker in their home."
  },
  {
    "title": "Motherboard, CPU, and RAM bundle deal for $629.99 makes it feel like there s no memory shortage   nearly $240 in savings",
    "link": "https://www.tomshardware.com/pc-components/motherboard-cpu-and-ram-bundle-deal-for-usd629-99-makes-it-feel-like-theres-no-memory-shortage-nearly-usd240-in-savings",
    "summary": "Newegg is offering a massive discount when you purchase this motherboard, processor, and memory bundle."
  },
  {
    "title": "SK hynix expands U.S. presence with new Bellevue, Seattle office in efforts to get closer to its largest customers   offices near Nvidia, Amazon, and Microsoft highlight co-designed HBM efforts",
    "link": "https://www.tomshardware.com/pc-components/dram/sk-hynix-expands-us-footprint-with-seattle-area-office-near-nvidia-and-amazon",
    "summary": "SK hynix is expanding its U.S. presence with a new office in the Seattle metropolitan area, placing the world s leading HBM supplier within minutes of Nvidia, Amazon, and Microsoft."
  },
  {
    "title": "Researchers discover that some biodegradable electronics produce microplastics as they degrade   the investigated material is commonly used in medical research",
    "link": "https://www.tomshardware.com/tech-industry/manufacturing/researchers-discover-that-some-biodegradable-electronics-produce-microplastics-as-they-degrade-the-investigated-material-is-commonly-used-in-medical-research",
    "summary": "Researchers from Northeastern University discovered that PEDOT:PSS, which is typically used in medical research, breaks down into harmful microplastics."
  },
  {
    "title": "Microsoft promises to nearly double Windows storage performance after forcing slow software-accelerated BitLocker on Windows   new CPU hardware-accelerated crypto will also improve battery life, but requires new CPUs",
    "link": "https://www.tomshardware.com/software/windows/microsoft-forced-slow-software-accelerated-bitlocker-on-windows-but-expects-to-nearly-double-storage-performance-and-improve-battery-life-with-new-cpu-hardware-accelerated-crypto-new-feature-requires-new-cpus-that-arent-available-on-the-market-yet",
    "summary": "The new BitLocker implementation offloads encryption and decryption to dedicated crypto engines on supported SoCs, delivering faster storage performance and reduced CPU usage."
  },
  {
    "title": "Study shows playing Super Mario Bros. and Yoshi games fights burnout and can 'enhance happiness in life'   popular titles are proven to  instill childlike wonder  among young adults",
    "link": "https://www.tomshardware.com/video-games/study-shows-playing-super-mario-bros-and-yoshi-games-fights-burnout-and-can-enhance-happiness-in-life-popular-titles-are-proven-to-instill-childlike-wonder-among-young-adults",
    "summary": "A study revealed that games like Super Mario Bros. and Yoshi can bring back good childhood memories."
  },
  {
    "title": "Asus' new high-end ROG Swift PG32UCDM3 monitor leaks with a 240 Hz QD-OLED display and a BlackShield coating   new coating should offer 40% deeper black levels",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/asus-new-high-end-rog-swift-pg32ucdm3-monitor-leaks-with-a-240-hz-qd-oled-display-and-a-blackshield-coating-new-coating-should-offer-40-percent-deeper-black-levels",
    "summary": "ROG Swift 4K 240 Hz display with a QD-OLED panel and BlackShield coating breaks cover"
  },
  {
    "title": "LG Display reveals world's first 4K 240Hz OLED gaming monitor with a true RGB \"striped\" subpixel layout   New panel succeeds WOLED with multi-stack Tandem OLED",
    "link": "https://www.tomshardware.com/monitors/lg-display-reveals-worlds-first-4k-240hz-oled-gaming-monitor-with-a-true-rgb-striped-subpixel-layout-new-panel-succeeds-woled-with-multi-stack-tandem-oled",
    "summary": "OLED screens, while the pinnacle of display tech today, still aren't perfect, and one area where OLED monitors in specific have struggled is text clarity. Either due to the unorthodox subpixel layout of these panels or the addition of a white subpixel, fringing around text has been a persistent issue, but LG has seemingly solved both at one go."
  },
  {
    "title": "China's reverse-engineered Frankenstein EUV chipmaking tool hasn't produced a single chip   sanctions-busting experiment is still years away from becoming operational",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/chinas-reverse-engineered-frankenstein-euv-chipmaking-tool-hasnt-produced-a-single-chip-sanctions-busting-experiment-is-still-years-away-from-becoming-operational",
    "summary": "A reported attempt by a covert Chinese lab to reverse-engineer an EUV lithography scanner underscores that, despite access to scattered components, replicating ASML's EUV tools is effectively impossible without recreating the company's entire global supply chain, optics ecosystem, and proprietary software built over decades."
  },
  {
    "title": "HP Omen 27qs G2 27-inch QHD 280 Hz gaming monitor review: Reference-level video and color",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/hp-omen-27qs-g2-27-inch-qhd-280-hz-gaming-monitor-review",
    "summary": "HP delivers reference-quality color and speedy gameplay with the Omen 27qs G2. It s a 27-inch QHD IPS panel with 280 Hz, Adaptive-Sync, MPRT, HDR400 and wide gamut color. It also brings superb video processing for super smooth motion."
  },
  {
    "title": "Samsung to delay its planned DDR4 end-of-life due to signing a long-term 'non-cancellable, non-returnable' contract with key customer   agreement will not alleviate consumer shortage, supply earmarked for server clients",
    "link": "https://www.tomshardware.com/pc-components/ddr4/samsung-to-delay-its-planned-ddr4-end-of-life-due-to-signing-a-long-term-non-cancellable-non-returnable-contract-with-key-customer-agreement-will-not-alleviate-consumer-shortage-supply-earmarked-for-server-clients",
    "summary": "Samsung has delayed the end of its DDR4 production line due to increased demand, and is expected to earmark output for a client signing an NCNR contract with the company."
  },
  {
    "title": "Lucky Brit scores flagship PC worth almost $5,000 for just ~$2,400 at Costco, even comes armed with $700 worth of DDR5 memory   Marked-down build also has an RTX 5090 and Ryzen 7 9800X3D",
    "link": "https://www.tomshardware.com/desktops/pc-building/lucky-brit-scores-flagship-pc-worth-almost-usd5-000-for-just-usd2-400-at-costco-even-comes-armed-with-usd700-worth-of-ddr5-memory-marked-down-build-also-has-an-rtx-5090-and-ryzen-7-9800x3d",
    "summary": "Someone in the UK has just pulled off a heist only, that it was completely legal and at a Costco. A prebuilt PC worth $4,863 was bought for just $2,431, featuring flagship parts all around like an RTX 5090, a Ryzen 7 9800X3D and 64 GB of DDR5 6000 MT/s RAM that costs at least $700 just on its own."
  },
  {
    "title": "'Twas The Night Before Tom's Christmas 2025",
    "link": "https://www.tomshardware.com/tech-industry/twas-the-night-before-toms-christmas-2025",
    "summary": "Enjoy the 2025 holiday poem from the editors of Tom's Hardware."
  },
  {
    "title": "Samsung's CES monitor lineup includes 6K 3D display with eye-tracking   plus a dual-mode QHD panel with a blistering 1080p 1040Hz option",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/samsungs-ces-monitor-lineup-includes-6k-3d-display-with-eye-tracking-plus-a-dual-mode-qhd-panel-with-a-blistering-1080p-1040hz-option",
    "summary": "Samsung announced new 27-inch and 32-inch displays for gamers featuring refresh rates from 165 Hz to 1,040 Hz."
  },
  {
    "title": "Trump administration announces new tariffs on Chinese chips and electronic components   but fresh sanctions won't take effect until 2027, and rates remain unknown",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/trump-administration-announces-new-tariffs-on-chinese-chips-and-electronic-components-but-fresh-sanctions-wont-take-effect-until-2027-and-rates-remain-unknown",
    "summary": "The United States has slapped a fresh set of tariffs on Chinese electronic components, but their implementation has been delayed until 2027."
  },
  {
    "title": "Save $650 on this powerful RTX 5070 Ti gaming PC with 32GB RAM and 2TB SSD   now just $1649, this formidable MSI Aegis Z2 machine is perfect for a 1440p setup",
    "link": "https://www.tomshardware.com/pc-components/save-usd650-on-this-powerful-rtx-5070-ti-gaming-pc-with-32gb-ram-and-2tb-ssd-now-just-usd1649-this-formidable-msi-aegis-z2-machine-is-perfect-for-a-1440p-setup",
    "summary": "A huge $650 saving means this MSI Aegis Z2 gaming PC, with an eight-core AMD Ryzen CPU, Nvidia GeForce RTX 5070 Ti, 32GB of DDR5 RAM, and 2TB SSD, could be yours for just $1,649 right now."
  },
  {
    "title": "52 years later, only known copy of Unix v4 recovered from randomly found tape, now up and running on a system   first OS version with kernel and core utilities written in C",
    "link": "https://www.tomshardware.com/software/linux/unix-v4-recovered-from-randomly-found-tape-at-university-of-utah-only-known-copy-of-first-os-version-with-kernel-and-core-utilities-written-in-c",
    "summary": "The only known complete copy of Unix v4 has been recovered from a tape found at the University of Utah."
  },
  {
    "title": "World s oldest Bitcoin Mining Pool celebrates 15th anniversary, has mined 1,311,339 bitcoins worth $115 billion   group has 255 billion times more hash power than at inception",
    "link": "https://www.tomshardware.com/tech-industry/cryptomining/worlds-oldest-bitcoin-mining-pool-celebrates-15th-anniversary-has-mined-1-311-339-bitcoins-worth-usd115-billion-group-has-255-billion-times-more-hash-power-than-at-inception",
    "summary": "15 years ago, the first Bitcoin mining pool was introduced by coder Slush."
  },
  {
    "title": "M5Stack NanoH2   An ultra-compact ESP32-H2 IoT development kit with Zigbee, Thread, and Matter connectivity",
    "link": "https://www.cnx-software.com/2025/12/26/m5stack-nanoh2-an-ultra-compact-esp32-h2-iot-development-kit-with-zigbee-thread-and-matter-connectivity/",
    "summary": "M5Stack NanoH2 is an ultra-compact, standalone IoT development kit powered by an Espressif Systems ESP32-H2 wireless SoC with support for Zigbee, Thread, and Matter, and designed for smart home and low-power wireless applications. It also features a built-in LED, an RGB LED, an infrared transmitter, a Grove port for expansion, a user button, and a USB-C port for power and programming. On the surface, it looks very similar to the Unit Gateway H2 introduced last March, with an ESP32-H2 SoC and a Grove connector. But while the earlier model is designed as an add-on board to other M5Stack products, the NanoH2 is a standalone development kit that you can use directly without another board from M5Stack. M5Stack NanoH2 specifications: SoC Espressif Systems ESP32-H2FH4S CPU 32-bit RISC-V SoC clocked at up to 96 MHz Memory 320 KB SRAM, 4 KB LP memory Storage 128 KB ROM, 4MB [...] The post M5Stack NanoH2 An ultra-compact ESP32-H2 IoT development kit with Zigbee, Thread, and Matter connectivity appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "OpenMediaVault 8 (OMV8)   Synchrony  released for 64-bit x86 (AMD64) and Arm (ARM64) platforms only",
    "link": "https://www.cnx-software.com/2025/12/26/openmediavault-8-omv8-synchrony-released-for-64-bit-x86-amd64-and-arm-arm64-platforms-only/",
    "summary": "OpenMediaVault 8, or OMV8 for shorts, codenamed Synchrony has been released, now supporting only 64-bit architectures (AMD64 and ARM64), and dropping 32-bit systems based on the i386, armel, and armhf architectures. OpenMediaVault is a popular, open-source network-attached storage (NAS) solution based on Debian Linux that s been around for many years. I had my first experience with it in 2017 when I reviewed FriendlyELEC NanoPi NEO NAS Kit based on a NanoPi NEO2 SBC with an Allwinner H5 64-bit Cortex A53 SoC, but sadly not recommended for OMV8 (more on that below). The main reason for killing 32-bit support is that the Salt Project only supports 64-bit builds. OpenMediaVault 8 highlights: Upgrade to Debian 13 (Trixie). Replace cpufrequtils with linux-cpupower Improve several user and group-related RPCs. Developers should note that the RPCs UserMgmt::enumerateSystemUsers, UserMgmt::enumerateUsers, UserMgmt::enumerateAllUsers and UserMgmt::getUserList now return only basic user information. Set the parameter detail to full to get [...] The post OpenMediaVault 8 (OMV8) Synchrony released for 64-bit x86 (AMD64) and Arm (ARM64) platforms only appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Cerelog ESP-EEG   A low-cost ESP32-based EEG acquisition board for brain computer interface (BCI) experiments",
    "link": "https://www.cnx-software.com/2025/12/26/cerelog-esp-eeg-a-low-cost-esp32-based-eeg-acquisition-board-for-brain-computer-interface-bci-experiments/",
    "summary": "The Cerelog ESP-EEG is an 8-channel, low-cost brain computer interface (BCI) circuit board built around the ESP32 MCU and designed for EEG data acquisition. The board supports 8-channel, 24-bit EEG data collection and connects to a host system over USB-C for both power and data. The board has an active noise-removal bias pin which reduces mains interference, along with onboard status LEDs, including a dedicated indicator for active data capture. It works with third-party or DIY EEG headsets using adapter boards, and STL files are provided for 3D printed mounts. Cerelog also offers various software tools and sample code to enable real-time EEG visualization, BCI experiments, neurofeedback, and custom brain-controlled applications. Cerelog ESP-EEG specifications: Wireless Module ESP32-WROOM-32 SoC ESP32 CPU Dual-core processor @ 160 MHz Memory 520 KB SRAM Wireless WiFi 802.11 b/g/n, Bluetooth 4.2 Storage 4 MB flash PCB antenna Analog Front-End (via TI s [...] The post Cerelog ESP-EEG A low-cost ESP32-based EEG acquisition board for brain computer interface (BCI) experiments appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Jetway B903DMTX Intel N97 fanless industrial box PC features 10 USB ports, four DB9 serial interfaces",
    "link": "https://www.cnx-software.com/2025/12/26/jetway-b903dmtx-intel-n97-fanless-industrial-box-pc-features-10-usb-ports-four-db9-serial-interfaces/",
    "summary": "Jetway B903DMTX is a fanless industrial box PC built around the Intel N97 quad-core Alder Lake-N CPU and designed for industrial applications with up to ten USB Type-A ports, four DB9 serial ports, dual GbE, and support for M.2 wireless modules. It supports up to 32GB of DDR5-4800 SO-DIMM memory, SATA III and M.2 SSD storage, along with WiFi and Bluetooth through an M.2 E-Key slot. The system also features 4Kp60-capable HDMI and DisplayPort video outputs. The embedded box PC runs on a 12 19V DC input, supports AT/ATX power modes, and includes features such as a watchdog timer, Intel PTT (fTPM), and a wide -10 C to 60 C operating temperature. These features make it suitable for factory automation, kiosks, digital signage, industrial gateways, and edge computing systems. Jetway B903DMTX specifications: SoC Intel Processor N97 quad-core Alder Lake N-series processor up to 3.6 GHz with 6MB cache, 24EU Intel UHD Graphics Gen 12 @ 1.2 [...] The post Jetway B903DMTX Intel N97 fanless industrial box PC features 10 USB ports, four DB9 serial interfaces appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Firefly CAM-3576 series   Tiny Rockchip RK3576 SBCs for commercial, industrial, and automotive applications",
    "link": "https://www.cnx-software.com/2025/12/24/firefly-cam-3576-series-tiny-rockchip-rk3576-sbcs-for-commercial-industrial-and-automotive-applications/",
    "summary": "Firefly Technology has introduced the CAM-3576 series of tiny (38 38 mm) SBCs based on the Rockchip RK3576 processor with a 6 TOPS NPU for AIoT, edge AI, smart vision, industrial, and automotive applications. It comes in three variants, which include the CAM-3576Q38 (commercial), the CAM-3576JQ38 (industrial), and the CAM-3576MQ38 (automotive) modules designed for smart cameras, intelligent security systems, dash cams, and private on-device AI model deployment. The CAM-3576 series supports up to 16GB of LPDDR5 RAM, up to 256GB eMMC flash, and also includes a microSD card for expansion. Additionally, the boards feature a MIPI CSI input for up to 16MP camera sensors with HDR support, Fast Ethernet, Wi-Fi 6, USB 2.0, USB-C (device), RS-485, UART, I C, ADC, GPIOs, audio input/output, and RTC support. Firefly CAM-3576Q38 specifications: SoM ICORE-3576Q38 SoC Rockchip RK3576 (Q38 Commercial) or Rockchip RK3576J (JQ38 Industrial) or Rockchip RK3576M (MQ38 Automotive) [...] The post Firefly CAM-3576 series Tiny Rockchip RK3576 SBCs for commercial, industrial, and automotive applications appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "CrowPi 3 AI Learning Kit is powered by a Raspberry Pi 5 SBC, works with Arduino Nano, BBC Micro:bit, and Raspberry Pi Pico boards",
    "link": "https://www.cnx-software.com/2025/12/24/crowpi-3-ai-learning-kit-is-powered-by-a-raspberry-pi-5-sbc-works-with-arduino-nano-bbc-microbit-and-raspberry-pi-pico-boards/",
    "summary": "Elecrow CrowPi 3 is the latest CrowPi learning and development kit featuring 41 built-in modules and over 150 lessons, and offering compatibility with Raspberry Pi 5, Arduino Nano, BBC Micro:bit, and Raspberry Pi Pico single board computers and development boards. It follows the CrowPi portable learning kit (Raspberry Pi 3B+/Zero), CrowPi 2 Raspberry Pi 4 electronics learning laptop, and CrowPi L laptop (Raspberry Pi 4 models), but the CrowPi 3 is the first to focus on Artificial Intelligence (AI) learning with a Raspberry Pi 5 and support for LLMs like DeepSeek, Google Gemini, and OpenAI chat besides courses about electronics and computer vision. CrowPi 3 specifications: Compatible boards Raspberry Pi 5 (required) Broadcom BCM2712 quad-core Arm Cortex-A76, up to 2.4GHz, 4GB or 8GB RAM. OS: Raspberry Pi OS (Debian Linux) or others Optional via headers or slots Arduino Nano Raspberry Pi Pico 1/1 W/2/2 W BBC micro:bit Display [...] The post CrowPi 3 AI Learning Kit is powered by a Raspberry Pi 5 SBC, works with Arduino Nano, BBC Micro:bit, and Raspberry Pi Pico boards appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Lattice Semi MachXO4 FPGA family offers up to 9400 LUTs, 448 kb user flash, improved  hot socketing ",
    "link": "https://www.cnx-software.com/2025/12/24/lattice-semi-machxo4-fpga-family-offers-up-to-9400-luts-448-kb-user-flash-improved-hot-socketing/",
    "summary": "Lattice Semiconductor has recently launched the MachXO4 low-power FPGA family featuring 896 to 9400 LUTs, fabric performance of up to 150 MHz, and improved hot socketing with a low leakage current of 350 A. Other features include up to 432 kb embedded RAM, 73 kb distributed RAM, 448 kb User Flash Memory (UFM), up to 382 I/Os, hardened SPI and I2C interfaces, a wide range of packages from 2.5 2.5mm to 20 x 20 mm, and three temperature grades (consumer, industrial, and automotive). Lattice Semi MachXO4 key features and specifications: FPGA Fabric 896 to 9400 LUTs 1,100 to 11,300 logic cells Up to 150 MHz operation Memory Embedded RAM 64 kb to 432 kb Distributed RAM 10 kb to 73 kb Storage 64 to 448 kb User Flash Memory (UFM) I/O and peripherals Up to 382 I/O pins 1x Phased Lock Loop (PLL) Hardened functions: SPI, 2x I2C, [...] The post Lattice Semi MachXO4 FPGA family offers up to 9400 LUTs, 448 kb user flash, improved hot socketing appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "4-inch round HDMI display offers USB touchscreen for Raspberry Pi, AIDA64, Smart Home, Art projects",
    "link": "https://www.cnx-software.com/2025/12/23/4-inch-round-hdmi-display-offers-usb-touchscreen-for-raspberry-pi-aida64-smart-home-art-projects/",
    "summary": "VIEWE has launched a 4-inch round HDMI display with 720 720 resolution, and a USB touchscreen function suitable for SBCs like the Raspberry Pi, PCs running AIDA64, Smart Home applications, and Art projects. It looks to build upon the company s 4-inch square HDMI display using the same control board with a MIPI DSI display interface, HDMI 1.4 input, and a USB Type-C port for power and touch input. VIEWE 4-inch HDMI round display specifications: Display 4-inch round HDMI IPS display with 720 720 resolution ST7703 display driver Brightness 300 cd/ Active area 101.52mm Touchscreen 5-point capacitive touch screen via USB-C port; FT6336U touch IC Video Input HDMI 1.4 Display Interfaces via Lontium LT6911C HDMI to MIPI DSI/LVDS chip Single/Dual-Port MIPI DSI/CSI transmitter Single/Dual-Port LVDS transmitter (connector present but not used with the provided 4-inch MIPI display) USB USB-C port for power and touchscreen Dimensions 109.62 [...] The post 4-inch round HDMI display offers USB touchscreen for Raspberry Pi, AIDA64, Smart Home, Art projects appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Auvidea X242   An NVIDIA Jetson Thor T5000 industrial carrier board with dual 10GbE, PCIe x16, CSI-2 camera support",
    "link": "https://www.cnx-software.com/2025/12/23/auvidea-x242-an-nvidia-jetson-thor-t5000-industrial-carrier-board-with-dual-10gbe-pcie-x16-csi-2-camera-support/",
    "summary": "Auvidea X242 is an industrial carrier board for NVIDIA s Jetson Thor T5000 module, targeting edge AI, robotics, vision, and high-bandwidth embedded systems, mainly in industrial and high-performance commercial applications. The board supports dual 10GbE, PCIe x16 expansion, NVMe storage, 4G LTE/5G M.2, up to four displays through HDMI and DisplayPort Alt Mode over USB-C (rev 3), and multiple cameras through a 16-lane CSI-2 camera connector. The carrier board supports a wide 24 48 V power input with power modes up to 120 W. Industrial features include hot-swap control, reverse and over-voltage protection, and backward compatibility with earlier Auvidea Jetson platforms. Auvidea X242 Specifications: Supported system-on-module NVIDIA Jetson Thor T5000 Storage M.2 Key M 2280 socket (PCIe x2 Gen 5) for NVMe SSD Video Output HDMI port Up to 3x USB-C with DisplayPort Alt Mode Up to 4x displays supported simultaneously Camera 16-lane CSI-2 camera connector, compatible with NVIDIA [...] The post Auvidea X242 An NVIDIA Jetson Thor T5000 industrial carrier board with dual 10GbE, PCIe x16, CSI-2 camera support appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "HackyPi 2.0 hacking tool gets ESP32-S3 for Wi-Fi and Bluetooth connectivity (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/23/hackypi-2-0-hacking-tool-esp32-s3-for-wi-fi-and-bluetooth-connectivity/",
    "summary": "HackyPi 2.0 is an ESP32-S3-based USB hacking and automation tool designed for both coders and non-coders. It features AI-assisted control, HID keystroke injection, BadUSB, and a no-code interface for learning, automation, ethical hacking, and overall system interaction. Compared to the original Raspberry Pi RP2040-based HackyPi, the HackyPi 2.0 adds Wi-Fi and Bluetooth connectivity, remote access, AI integration, and automatic OS detection, making it far more flexible. It keeps support for BadUSB and HID keystroke injection and also adds features such as mouse jiggler mode, child-safety website blocking, RGB status lighting, and LVGL-based UI support. Everything can be controlled through a beginner-friendly, no-code visual interface, while there is also an option to run commands, scripts, and automated workflows when deeper control is needed. HackyPi 2.0 specifications: Main SoC ESP32-S3 CPU Dual-core LX7 microprocessor @ up to 240 MHz with Vector extension for machine learning Wireless WiFi 4 and [...] The post HackyPi 2.0 hacking tool gets ESP32-S3 for Wi-Fi and Bluetooth connectivity (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "CrowPanel Advanced 7inch Review   Part 1: ESP32-P4 HMI AI display hands-on with LVGL factory firmware",
    "link": "https://www.cnx-software.com/2025/12/23/crowpanel-advanced-7inch-review-part-1-esp32-p4-hmi-ai-display-hands-on-with-lvgl-factory-firmware/",
    "summary": "Elecrow has sent us a sample of the CrowPanel Advanced 7inch ESP32-P4 HMI display for review. It is designed for high-performance AI and IoT (AIoT) applications with a 2MP camera module, an ESP32-C6-MINI-1 module for Wi-Fi 6, Bluetooth 5.3, and 802.15.4 (Zigbee, Thread, Matter) connectivity. Our kit also shipped with three wireless modules, namely an ESP32-H2 wireless module for an additional Thread, Zigbee, and Matter radio, an SX1262 module for LoRa low-power long-range connectivity, and an nRF2401 2.4 GHz wireless module. In the first part of the review, we will take you through an unboxing of the CrowPanel Advanced 7-inch, checking out the ESP32-P4 HMI AI Display s hardware before testing it with the preinstalled firmware using LVGL and AI features. You can check the detailed specifications in our previous article: CrowPanel Advance 7-inch ESP32-P4 HMI display supports Zigbee, LoRa, and 2.4GHz radio modules. Note that the company calls it Advance [...] The post CrowPanel Advanced 7inch Review Part 1: ESP32-P4 HMI AI display hands-on with LVGL factory firmware appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP-Scope is a web-based oscilloscope built using the ESP-IDF framework and Gemini 3 LLM",
    "link": "https://www.cnx-software.com/2025/12/22/esp-scope-is-a-web-based-oscilloscope-built-using-the-esp-idf-framework-and-gemini-3-llm/",
    "summary": "ESP-Scope is an open-source firmware transforming any ESP32 board into an oscilloscope using one of the ADC pins up to 83,333 Hz sample rate (on the ESP32-C6) and visualizing the results over Wi-Fi in a web browser, be it Google Chrome, Mozilla Firefox, or others. It s not the first ESP32 oscilloscope project we ve seen, as last year, we covered Bojan Jurca s Esp32_oscilloscope Arduino sketch doing something very similar. The ESP-Scope is a little different, since it s based on the ESP-IDF framework, and was used to test AI code generators, specifically Google Antigravity using Gemini 3, with refinements, hints and tips and overall design specified by a human . It just took a few hours to build. ESP-Score firmware features: Real-time signal visualization on a web browser. Adjustable sample rate (1-83333 Hz) and attenuation. Crosshair functionality for precise measurements Adjustable trigger level Test signal generation Reset functionality to clear settings and reload [...] The post ESP-Scope is a web-based oscilloscope built using the ESP-IDF framework and Gemini 3 LLM appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "GigaDevice GD32VW553-UNIFI   A $2+ WiFi 6 and Bluetooth 5.2 LE wireless IoT module",
    "link": "https://www.cnx-software.com/2025/12/22/gigadevice-gd32vw553-unifi-a-2-wifi-6-and-bluetooth-5-2-le-wireless-iot-module/",
    "summary": "GD32VW553-UNIFI is an inexpensive wireless IoT module based on GigaDevice GD32VW553 RISC-V microcontroller featuring 2.4 GHz WiFi 6 and Bluetooth 5.2 LE connectivity, and offered with a PCB antenna or IPEX antenna connector. The GD32VW553 MCU integrates 320KB SRAM and 4096KB on-chip flash, and supports link rates of up to 114.7 Mbps over WiFi and 2 Mbps over Bluetooth LE. The UNIFI module exposes 18 GPIOs from the microcontroller and is available in two different temperature ranges: -40 to +85 C or -40 to +105 C. GD32VW553-UNIFI specifications: SoC GigaDevice GD32VW553 CPU 32-bit RISC-V processor up to 160 MHz with RV32I/M/A/F/D/C/P/B instruction extensions Memory 320KB (288 KB + 32KB shared) SRAM Storage 4096 KB flash Wireless WiFi 802.11b/g/n/ax compatible 802.11i (WPA, WPA2, WPA3). Open, shared key, and pair-wise key authentication services Single antenna 1 1 stream in 20MHz channels upport of 802.11ax MCS up to MCS9 with a Max [...] The post GigaDevice GD32VW553-UNIFI A $2+ WiFi 6 and Bluetooth 5.2 LE wireless IoT module appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP32-S3 AIoT Basic   A learning and prototyping kit with camera, audio, LCD, and sensors",
    "link": "https://www.cnx-software.com/2025/12/22/esp32-s3-aiot-basic-a-learning-and-prototyping-kit-with-camera-audio-lcd-and-sensors/",
    "summary": "The ESP32-S3 AIoT Basic is a low-cost, learning, and prototyping kit for the ESP32-S3. The board integrates common AIoT peripherals directly onto a single PCB, making the design part easy for beginners, classrooms, and rapid prototyping. Built around an ESP32-S3 board, the development platform integrates nine commonly used modules directly on the PCB, including a button, buzzer, LED indicator, light sensor, LCD, digital microphone, SD card slot, audio amplifier, and a camera. Most AI and IoT demos can be run without breadboards or jumper wires, while expansion is supported through standard pin headers and Grove connectors. The board supports 5V power via USB-C, and 6 12 V power input via Vin for driving additional devices. With various tutorials and sample projects, it is suitable for AIoT learning, STEM education, voice and vision demos, sensor-based projects, and quick proof-of-concept development. ESP32-S3 AIoT Basic Specifications: Main board ESP32-S3 Core Board SoC [...] The post ESP32-S3 AIoT Basic A learning and prototyping kit with camera, audio, LCD, and sensors appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Forlinx FCU3011   An NVIDIA Jetson Orin Nano fanless industrial computer with 4x GbE, optional 4G/5G and Wi-Fi connectivity",
    "link": "https://www.cnx-software.com/2025/12/22/forlinx-fcu3011-an-nvidia-jetson-orin-nano-fanless-industrial-computer-with-4x-gbe-optional-4g-5g-and-wi-fi-connectivity/",
    "summary": "Forlinx Embedded has recently released the FCU3011, a compact, fanless industrial AI edge computer built around the NVIDIA Jetson Orin Nano, designed for 24/7 operations in manufacturing, smart cities, robotics, and machine vision systems, where real-time processing is needed. The fanless system supports NVIDIA Jetson Orin Nano 4GB (34 TOPS) or 8GB (up to 67 TOPS) configurations, with 4GB/8GB LPDDR5 memory and a 128GB PCIe x4 NVMe SSD. Connectivity options include up to four Gigabit Ethernet ports, USB 3.0/2.0, HDMI 2.0 (4K), an SD card slot, optional 4G/5G and dual-band Wi-Fi via M.2 modules, along with industrial interfaces such as isolated RS-485, CAN, opto-isolated inputs, relay outputs, and an RTC. The system takes a wide 9 24V DC power input, features ESD-protected interfaces, and can be used for AGVs, visual inspection, smart factories, intelligent traffic analysis, medical devices, and small commercial robots. Forlinx FCU3011 specifications: SoM options NVIDIA Jetson Orin Nano [...] The post Forlinx FCU3011 An NVIDIA Jetson Orin Nano fanless industrial computer with 4x GbE, optional 4G/5G and Wi-Fi connectivity appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "XIAO Soil Moisture Sensor review with Home Assistant",
    "link": "https://www.cnx-software.com/2025/12/21/xiao-soil-moisture-sensor-review-with-home-assistant/",
    "summary": "Seeed Studio sent us a review sample of the XIAO Soil Moisture Sensor powered by the XIAO ESP32C6 wireless module and running on a single AA battery. Designed for ultra-low power consumption, it s supposed to offer long-lasting operation with dynamic adjustment of monitoring intervals. It s preloaded with ESPHome firmware and is fully compatible with Home Assistant. It s ideal for indoor plants monitoring, but it can t be used outdoors since the 3D printed enclosure is not weatherproof. In this review, we ll start with an unboxing, do a quick teardown, and test it with Home Assistant to receive a notification on our smartphone when the soil is dry. XIAO Soil Moisture Sensor specifications Wireless module XIAO ESP32C6 Wireless MCU Espressif Systems ESP32-C6 CPU 32-bit RISC-V core up to 160 MHz Low-power RISC-V core up to 20 MHz Memory 512 KB SRAM, 16KB low-power SRAM Storage 320 KB ROM, 4MB [...] The post XIAO Soil Moisture Sensor review with Home Assistant appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Do you need 14 USB ports on your Raspberry Pi 5?",
    "link": "https://www.cnx-software.com/2025/12/20/do-you-need-14-usb-ports-on-your-raspberry-pi-5/",
    "summary": "If you do, then you re in luck, thanks to the Suptronics X1013 expansion board for the Raspberry Pi 5, which adds ten USB ports for a total of fourteen USB ports! The board connects to the 16-pin FFC PCIe connector of the Raspberry Pi 5 and adds four USB 3.0 ports and four USB 2.0 ports on the right of the Ethernet+USB side of the Pi 5, plus two extra USB 2.0 ports on the opposite side. This is what it looks like once installed. Suptronics X1013 specifications: Compatible with Raspberry Pi 5 PCIe to USB chipset Via Lab s VL805 PCIe Gen2 x1 to 4x USB 3.0 control chip USB Hub Terminus FE 2.1 7-port USB 2.0 hub PCIe 16-pin FFC PCIe connector; 37mm cable provided USB ports 4x USB3.2 Gen1 (5 Gbps) ports 6x USB 2.0 ports (480 Mbps) Misc On-board push button for bottom (same [...] The post Do you need 14 USB ports on your Raspberry Pi 5? appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Fanless Box PC features Intel Core Ultra 5/7/9  Arrow Lake  CPU with up to 36 TOPS for Edge AI applications",
    "link": "https://www.cnx-software.com/2025/12/19/fanless-box-pc-features-intel-core-ultra-5-7-9-arrow-lake-cpu-with-up-to-36-tops-for-edge-ai-applications/",
    "summary": "AAEON BOXER-6648-ARS is a powerful, yet fanless embedded Box PC equipped with the latest generation Intel Core Ultra 5/7/9 Arrow Lake CPU with up to 24 cores clocked at up to 5.6 GHz, 36 TOPS of AI performance, and 35W or 65W TDP. The embedded computer is offered with either an Intel H810 or Intel Q870 chipset, with the latter enabling Intel Active Management Technology (AMT) and 10 Gbps USB 3.2 Gen2 ports. Other features include up to 96GB RAM, NVMe and SATA storage, dual HDMI video output, dual 2.5GbE, a Gigabit Ethernet port, optional WiFi and Bluetooth, a 10-pin terminal block, and up to six RS232/RS422/RS485 COM ports. AAEON BOXER-6648-ARS specifications: Arrow Lake SoC (one or the other) Intel Core Ultra 5 245 10-core (6P + 4E) processor up to 3.3 GHz / 4.9 GHz (Turbo), 20MB cache, 2x Xe core graphics; TDP: 65W; AI: 23 TOPS Intel [...] The post Fanless Box PC features Intel Core Ultra 5/7/9 Arrow Lake CPU with up to 36 TOPS for Edge AI applications appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP32-P4 learning and prototyping kit features 7-inch touchscreen, comes with 16 modules and AI lessons",
    "link": "https://www.cnx-software.com/2025/12/19/esp32-p4-learning-and-prototyping-kit-features-7-inch-touchscreen-comes-with-16-modules-and-ai-lessons/",
    "summary": "Elecrow s All-in-One Starter Kit for ESP32-P4 is an open-source learning and prototyping platform based on the ESP32-P4 processor, offering AI, multimedia, and embedded features in a single, self-contained kit designed for students, educational institutions, and developers for rapid prototyping. The open hardware kit integrates a 7-inch touchscreen display, a 2MP camera, and sixteen built-in electronic modules, supported by over 20 structured lessons that progressively cover I/Os, audio, LVGL GUI development, and basic AI use cases. Development is done in C using Espressif s ESP-IDF framework, ready-to-build examples, and modular BSP drivers, making the kit suitable for learning embedded systems, IoT device control, human-machine interfaces, smart home concepts, and entry-level Edge AI applications. All-in-one Starter Kit for ESP32-P4 kit specifications: Wireless MCU ESP32-P4NRW32 MCU Dual-core RISC-V microcontroller @ 400 MHz with AI instructions extension and single-precision FPU Single-RISC-V LP (Low-power) MCU core @ up to 40 MHz GPU 2D Pixel [...] The post ESP32-P4 learning and prototyping kit features 7-inch touchscreen, comes with 16 modules and AI lessons appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Raspberry Pi RP2350 devkit features 1.85-inch round touch display, microphone, optional speaker and battery box",
    "link": "https://www.cnx-software.com/2025/12/19/raspberry-pi-rp2350-devkit-features-1-85-inch-round-touch-display-microphone-optional-speaker-and-battery-box/",
    "summary": "Waveshare RP2350-Touch-LCD-1.85C is a Raspberry Pi RP2350 devkit with a 1.85-inch round touchscreen display with 360 360 resolution, a built-in microphone, a 28-pin GPIO header, and a USB-C port. The RP2350-Touch-LCD-1.85C-BOX model builds on the platform to add a box with a speaker and a 3.7V battery. Both models also come with 16MB SPI flash, a microSD card slot, a 6-axis IMU, a few buttons and LEDs, and UART and I2C expansion connectors. They can be used for HMI solutions using touch, button, and voice recognition inputs, as well as display and audio outputs. RP2350-Touch-LCD-1.85C specifications: Microcontroller Raspberry Pi RP2350A MCU CPU 2x Arm Cortex-M33 cores @ 150 MHz 2x Hazard3 RISC-V cores @ 150 MHz Up to two cores can be used at any time (configured at boot) Memory 520KB SRAM Storage 8KB OTP Package QFN-60; 7 7 mm Storage 16MB SPI NOR flash, microSD card slot Display [...] The post Raspberry Pi RP2350 devkit features 1.85-inch round touch display, microphone, optional speaker and battery box appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "LILYGO T-Echo Plus off-grid LoRa communicator features a climbing hook for hiking, cycling, and remote communication",
    "link": "https://www.cnx-software.com/2025/12/19/lilygo-t-echo-plus-off-grid-lora-communicator-features-a-climbing-hook-for-hiking-cycling-and-remote-communication/",
    "summary": "The LILYGO T-Echo Plus is another off-grid LoRa communicator, similar to Blackout Comms, ThinkNode M2, and Wio Tracker L1 Pro, but it features a metal attachment loop (designed like a climbing hook) for use in hiking, cycling, and off-grid environments. Built around a Nordic Semi nRF52840 MCU, it supports Bluetooth 5, Thread, Zigbee, and 802.15.4. It also adds an SX1262 LoRa transceiver, a 1.54-inch 200 200 SPI E-Paper display, and an L76K GNSS module. Other features include a 6-axis IMU (BHI260AP), a vibration motor, a buzzer, and a larger 2400mAh battery, along with a 1/4-inch mount and a climbing finger loop for gear attachment. Additional features include an optional BME280 sensor, Grove expansion, all in a rugged and compact enclosure with a long external antenna for extended LoRa range. LILYGO T-Echo Plus Specifications: SoC Nordic Semiconductor nRF52840 CPU 32-bit Arm Cortex-M4F microcontroller @ 64 MHz Memory/Storage 2 MB Flash, [...] The post LILYGO T-Echo Plus off-grid LoRa communicator features a climbing hook for hiking, cycling, and remote communication appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "REETLE SmartInk I   An AI-powered E-Ink phone case with voice recording (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/18/reetle-smartink-i-an-ai-powered-e-ink-phone-case-with-voice-recording/",
    "summary": "The REETLE SmartInk I is a phone case with a touch-enabled E-Ink display and built-in AI features. It features a secondary screen on the back for reading text, viewing notes, recording voice, and displaying to-do items, allowing basic tasks to be completed without using the phone s main display. In the back, you have a 3.97-inch E-Ink touchscreen with one-press voice recording, AI-based transcription, summarization, and smart to-do display, all synced to a companion mobile app via Bluetooth 5.0. It supports iPhone 13 17 series and a wide range of Android phones, features a 300 mAh battery with 10W MagSafe wireless charging, and delivers up to 10 hours of reading, 8 hours of recording, and over 2 weeks of standby time. Weighing around 55 grams with a total thickness under 4 mm, it includes military-grade drop protection, tempered glass, widget switching (QR codes, notes, schedules), a thin design, and a 10 C to [...] The post REETLE SmartInk I An AI-powered E-Ink phone case with voice recording (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "NASP NeuroVoice VAD chip enables always-on voice activity detection at microwatt-level power consumption",
    "link": "https://www.cnx-software.com/2025/12/18/nasp-neurovoice-vad-chip-enables-always-on-voice-activity-detection-at-microwatt-level-power-consumption/",
    "summary": "POLYN Technology s Neuromorphic Analog Signal Processor (NASP) NeuroVoice VAD is an always-on, ultra-low-power chip that detects voice in any noisy background, at microwatt-level power consumption and microsecond-scale latency. Everything happens on the chip, so no Internet is needed. Potential applications include smart remote controls, earbuds, wearables, voice access, IoT, Industry 4.0, robotics, Smart Home/Factory, mobility, and more. NASP NeuroVoice VAD chip (NV-VAD 100) specifications: Features Voice detection at ultra-low power consumption Voice passthrough Passes voice and mutes background sounds Background signal bypass Wake Word Detection (WWD) command to activate transparent voice bypass Speech/command intelligibility in noisy spaces Increases voice command intelligibility for WWD/KWS (Keyword Spotting) functionality in noisy environments for Smart Home, Smart Factory, Wearables, etc. Audio Interfaces PDM/I2S Voice delay detection 25 ms Host interfaces SPI/I2C used for initial configuration and status readout, VAD pin Debugging Boundary Scan and Debug unit access [...] The post NASP NeuroVoice VAD chip enables always-on voice activity detection at microwatt-level power consumption appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Radxa Dragon Q6A Arm SBC gets official Windows 11 preview",
    "link": "https://www.cnx-software.com/2025/12/18/radxa-dragon-q6a-arm-sbc-get-official-windows-11-preview/",
    "summary": "While most people use Linux on Arm SBCs, it s typically possible to run Windows 11 on Arm boards with UEFI support, but with caveats such as the GPU and VPU not working and other issues. One solution is to avoid the Arm architecture altogether and go with an x86 SBC like the Radxa X4, ODROID-H4+, or LattePanda IOTA, among others. But things may change for the better now that Qualcomm SBCs are becoming a thing, and Radxa has just announced official Windows support for the Radxa Dragon Q6A. Note that it is only a preview image for now. Nevertheless, here s what is working without installing additional drivers on Windows 11: HDMI output (inherited from UEFI GOP) PCIe Note: NVMe available; system does not include network card drivers eMMC flash UFS USB 2.0 USB 3.0, but devices must be connected before booting into the system But once you install drivers, [...] The post Radxa Dragon Q6A Arm SBC gets official Windows 11 preview appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Toradex Luna SL1680   A  Pro Consumer  Raspberry Pi lookalike based on Synaptics SL1680 Edge AI SoC",
    "link": "https://www.cnx-software.com/2025/12/18/toradex-luna-sl1680-a-pro-consumer-raspberry-pi-lookalike-based-on-synaptics-sl1680-edge-ai-soc/",
    "summary": "Toradex Luna SL1680 is a credit card-sized single board computer heavily inspired by the Raspberry Pi 5 design, but powered by a Synaptics SL1680 quad-core Cortex-A73 SoC suitable for Edge AI applications thanks to a built-in 7.9 TOPS NPU. Designed for pro consumer and light industrial Edge AI applications, the Luna SL1680 ships with up to 4GB RAM and 256GB eMMC flash, and offers many of the same ports as the Pi 5, including a Gigabit Ethernet RJ45 port with optional PoE support, four USB 3.0 ports, two micro HDMI ports (but one Tx, one Rx), MIPI DSI and CSI connectors, and a 40-pin GPIO header. The 16-pin PCIe FFC connector is gone, making way for an M.2 Key-E socket, mostly useful for adding wireless connectivity. Toradex Luna SL1680 specifications: SoC Synaptics SL1680 CPU Quad-core Arm Cortex-A73 processor @ 2.1 GHz GPU Imagination PowerVR Series9XE GE9920 GPU [...] The post Toradex Luna SL1680 A Pro Consumer Raspberry Pi lookalike based on Synaptics SL1680 Edge AI SoC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Fusion HAT+ Raspberry Pi expansion board targets motor and servo control with AI and LLMs",
    "link": "https://www.cnx-software.com/2025/12/17/fusion-hat-raspberry-pi-expansion-board-targets-motor-and-servo-control-with-ai-and-llms/",
    "summary": "SunFounder Fusion HAT+ for Raspberry Pi 5/4/3B+ and Zero single board computers is a motor control and GPIO expansion board designed to work with LLMs such as ChatGPT or Gemini using the board s built-in speaker and microphone for voice interaction. It features four DC motor drivers, twelve PWM servo channels, four ADC inputs, I2C, SPI, and UART interface for sensors, and ships with two 18650 rechargeable batteries with smart power management & safe shutdown. It can be used in smart cars, humanoid robots, robotic arms, multi-legged spiders, and smart home systems. Fusion HAT+ specifications: MCU Gigadevices GD32E203C8T6 Arm Cortex-M23 microcontroller @ 72MHz with 64KB flash, 8KB SRAM. Motor control 4x motor ports Audio 2030 audio chamber speaker connected to an I2S audio port MEMS microphone Expansion 4-channel digital pins 4-pin I2C interface compatible with Qwiic/STEMMA Qt 7-pin SPI interface 4-pin UART interface 12-channel PWM pins for servos 4-channel [...] The post Fusion HAT+ Raspberry Pi expansion board targets motor and servo control with AI and LLMs appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Compact development board features a single ESP32-P4 + ESP32-C5 dual-band Wi-Fi 6 module, MIPI display and camera interfaces",
    "link": "https://www.cnx-software.com/2025/12/17/compact-development-board-features-a-single-esp32-p4-esp32-c5-dual-band-wi-fi-6-module-mipi-display-and-camera-interfaces/",
    "summary": "Just a few months back, Wireless-Tag released the WT99P4C5-S1, which combines the ESP32-P4 with an ESP32-C5 dual-band WiFi 6 module, instead of the more commonly used ESP32-C6 wireless module found on most ESP32-P4 development boards we ve covered. The company has now released the WTDKP4C5-S1, a more compact development board built around the WT01P4C5-S1 ESP32-P4 and ESP32-C5 core module. The board supports MIPI-CSI and MIPI-DSI through the ESP32-P4, while the SDIO-connected ESP32-C5 provides dual-band Wi-Fi 6 (2.4/5 GHz) connectivity along with BLE 5, Zigbee, Thread, and Matter. Other features include a USB 2.0 Type-C OTG port, two UART debug interfaces, two 40-pin GPIO breakouts from both chips, and various power options via USB-C, a 12V DC input, or headers. The board is suitable for LVGL-based HMIs, data acquisition, industrial control, and Edge AI applications such as IPCs and smart displays. Wireless Tag WTDKP4C5-S1 specifications: Core module Wireless Tag WT01P4C5-S1 Main [...] The post Compact development board features a single ESP32-P4 + ESP32-C5 dual-band Wi-Fi 6 module, MIPI display and camera interfaces appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Maxell PSB2032 35 mAh all-solid-state coin cell battery targets industrial IoT devices",
    "link": "https://www.cnx-software.com/2025/12/17/maxell-psb2032-35-mah-all-solid-state-coin-cell-battery-targets-industrial-iot-devices/",
    "summary": "Maxell PSB2032 is a rechargeable all-solid-state coin cell battery for industrial IoT devices, which more than quadruples the capacity of the earlier PSB401010H ceramic-packaged solid-state battery, increasing it from 8mAh to 35mAh. As its name implies, it measures 20 mm in diameter and 3.2 mm in height, and delivers key benefits of solid-state batteries such as a wide discharge temperature range, high reliability, and high safety. It s also easier to install than ceramic-packaged batteries requiring reflow soldering, since it comes pre-equipped with two connection terminals suitable for mounting into small-sized devices. The company shared a comparison table between its two solid-state batteries. For reference, the capacity of a typical CR2032 battery is 220 240 mAh, so the PSB2032 has a much lower capacity. However, it can be recharged and works in demanding environments with a wide temperature range and high safety requirements. The last time we wrote about solid-state batteries was [...] The post Maxell PSB2032 35 mAh all-solid-state coin cell battery targets industrial IoT devices appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "MicroPython v1.27 adds support for ESP32-C5, ESP32-P4, and STM32U5 microcontrollers",
    "link": "https://www.cnx-software.com/2025/12/16/micropython-v1-27-adds-support-for-esp32-c5-esp32-p4-and-stm32u5-microcontrollers/",
    "summary": "MicroPython is one of the most popular firmware for microcontrollers due to its ease of use. The MicroPython v1.27 release adds support for some interesting microcontrollers, namely Espressif Systems ESP32-C5 and ESP32-P4, thanks to an update to the ESP-IDF v5.5.1 framework, as well as STMicroelectronics STM32U5, and features a range of other changes. These include improvements to the test suite to cater to the increasing number of supported hardware platforms, the introduction of tier levels for different hardware platforms, various optimizations and bug fixes, updated libraries, new ESP32 and STM32 boards, and more. The last time we reported on a MicroPython release was for v1.24, which added support for Raspberry Pi RP2350 and ESP32-C6 microcontrollers. Other MicroPython v1.27 highlights: Test suite improvements Auto-detecting if the target has Unicode support Automatically including float tests when possible Always including stress tests Improving the skipping of tests that use slice and the [...] The post MicroPython v1.27 adds support for ESP32-C5, ESP32-P4, and STM32U5 microcontrollers appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "HealthyPi 6   A portable Wi-Fi 6 biosignal acquisition device with ECG, PPG, respiration, and temperature sensors (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/16/healthypi-6-portable-wi-fi-6-biosignal-acquisition-device-with-ecg-ppg-respiration-and-temperature-sensors/",
    "summary": "Designed by ProtoCentral Electronics in India, the HealthyPi 6 is an open-source, portable, research-grade biosignal acquisition device designed for academic research, education, and prototyping. It targets labs, classrooms, and field studies that need professional-quality physiological measurements without bulky desktop systems or proprietary lock-in. Building on the HealthyPi 5 (2023) and HealthyPi 4 (2019), the HealthyPi 6 is a standalone device with 3-channel/5-lead ECG, dual-wavelength PPG for heart rate and SpO , respiration via impedance pneumography, skin temperature sensing, and a 9-axis IMU for motion and artifact detection. Built around the STM32H757 real-time microcontroller and an ESP32-C6 handling Wi-Fi 6 and BLE connectivity, the device features a USB-C port, onboard flash and microSD storage, and 48+ hours of operation on a charge. Modular HealthyLink ports allow for EEG, EMG, GSR, additional analog inputs, triggers, and co-processors expansion. These features make it suitable for cardiovascular and sleep research, rehabilitation studies, wearable prototyping, biosignal [...] The post HealthyPi 6 A portable Wi-Fi 6 biosignal acquisition device with ECG, PPG, respiration, and temperature sensors (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "VEGA AS2161  DHRUV64    A 1GHz dual-core 64-bit RISC-V microprocessor designed in India",
    "link": "https://www.cnx-software.com/2025/12/16/vega-as2161-dhruv64-a-1ghz-dual-core-64-bit-risc-v-microprocessor-designed-in-india/",
    "summary": "The Government of India has been investing to spur up its semiconductor design and manufacturing industry at least since 2018/2019 with the SHAKTI and AJIT microprocessors. In 2022, they decided to focus on the RISC-V architecture with the VEGA processor family, starting with the THEJAS32 (VEGA ET1031) and THEJAS64 (VEGA AS1061) microprocessors, and the former was eventually found in the ARIES v3.0 Arduino UNO-inspired development board. Things continue to progress nicely, albeit slowly, and the government has now announced the launch of the DHRUV64 (VEGA AS2161) dual-core 64-bit RISC-V MPU clocked at 1 GHz and supporting Linux, which it describes as a fully indigenous microprocessor developed by the Centre for Development of Advanced Computing (C-DAC) under the Microprocessor Development Programme (MDP) . VEGA AS2161 (DHRUV64) specifications highlights: Architecture RISC-V 64G (RV64IMAFD) Instruction Set 13-16 stage out-of-order pipeline implementation. Advanced branch predictor BTB, BHT, RAS. Harvard architecture, separate Instruction and [...] The post VEGA AS2161 DHRUV64 A 1GHz dual-core 64-bit RISC-V microprocessor designed in India appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Luckfox Aura   A Raspberry Pi-like Linux SBC powered by Rockchip RV1126B SoC with 3 TOPS NPU",
    "link": "https://www.cnx-software.com/2025/12/16/luckfox-aura-a-raspberry-pi-like-linux-sbc-powered-by-rockchip-rv1126b-soc-with-3-tops-npu/",
    "summary": "The Luckfox Aura is a compact, high-performance Linux SBC built around Rockchip s RV1126B quad-core Arm Cortex-A53 processor with a 3 TOPS NPU and designed for AI vision, multimedia processing, and edge computing Applications. Aura board supports up to 4 GB LPDDR4X memory and up to 64 GB of optional eMMC storage. Camera and display options include two 4-lane MIPI CSI camera inputs, a 4-lane MIPI DSI display interface up to 1080p60, and an AI-enhanced ISP with HDR, noise reduction, dehazing, and image correction features. The board also features Gigabit Ethernet with PoE support, onboard dual-band Wi-Fi 6 and Bluetooth 5.4/BLE, USB 3.0 OTG, four USB 2.0 host ports, a 40-pin GPIO header compatible with some Raspberry Pi HATs, audio I/O, an RTC, and a microSD card slot. Luckfox Aura specifications: SoC Rockchip RV1126B quad-core Cortex-A53 SoC CPU Quad-core Arm Cortex-A53 up to 1.6 GHz with 32KB L1 I-Cache and [...] The post Luckfox Aura A Raspberry Pi-like Linux SBC powered by Rockchip RV1126B SoC with 3 TOPS NPU appeared first on CNX Software - Embedded Systems News ."
  }
]