[
  {
    "title": "3DPrintopia 2025: filament, folding printers, and fun at the East Coast's largest 3D printing event",
    "link": "https://www.tomshardware.com/3d-printing/3dprintopia-2025-filament-folding-printers-and-fun-at-the-east-coasts-largest-3d-printing-event",
    "summary": "The weeklong festival showcased 3D printers, both old and new, plus new filaments."
  },
  {
    "title": "ASRock Challenger RX 9070 16GB drops to $549   get more VRAM than an RTX 5070 for the same amount of green",
    "link": "https://www.tomshardware.com/pc-components/asrock-challenger-rx-9070-16gb-drops-to-usd549-get-more-vram-than-an-rtx-5070-for-the-same-amount-of-green",
    "summary": "ASRock's RX 9070 XT Challenger 16GB is on a 8% discount, making it just as cheap as the cheapest RTX 5070's on the market while delivering more VRAM."
  },
  {
    "title": "Three Steam Deck-ready 2230 SSD upgrades are at record low prices   Crucial P310 2TB at lowest-ever 49% off, WD and Kingston 1TB models dip as low as $65",
    "link": "https://www.tomshardware.com/pc-components/ssds/three-steam-deck-ready-2230-ssd-upgrades-are-at-record-low-prices-crucial-p310-2tb-at-lowest-ever-49-percent-off-wd-and-kingston-1tb-models-dip-as-low-as-usd65",
    "summary": "Three gaming handheld-friendly M.2-2230 SSD upgrades are on sale, some for their lowest-ever prices, with the Crucial P310 2TB sitting at $121.99 for the first time ever."
  },
  {
    "title": "MSI gaming bundle lets you snag AMD's Ryzen 7 9800X3D for $400 when paired with an MSI X870 Tomahawk WiFi motherboard for Prime Day   $639 for the pair, or $738 with a 2TB SSD",
    "link": "https://www.tomshardware.com/pc-components/msi-gaming-bundle-lets-you-snag-amds-ryzen-7-9800x3d-for-usd400-when-paired-with-with-an-msi-x870-tomahawk-wifi-motherboard-usd639-for-the-pair-or-usd738-with-a-2tb-ssd",
    "summary": "Amazing value on some of the best components from MSI for a powerful PC gaming rig."
  },
  {
    "title": "Nintendo asks for $4.5 million default judgment against ex-Reddit mod accused of pirating thousands of games    \"Archbox\" allegedly asked for donations for faster access to his stolen library",
    "link": "https://www.tomshardware.com/video-games/nintendo/nintendo-asks-for-usd4-5-million-default-judgment-against-ex-reddit-mod-accused-of-pirating-thousands-of-games-archbox-allegedly-asked-for-donations-for-faster-access-to-his-stolen-library",
    "summary": "Nintendo is suing a Reddit mod for $4.5 million over Switch piracy, arguing that he sold \"thousands, if not hundreds of thousands\" of illegally-acquired games online. James \"Archbox\" Williams never responded to Nintendo's cease-and-desist last year, which has now spiralled into a default judgment."
  },
  {
    "title": "Amazon Prime Big Deals Day has exceptional soldering iron deals",
    "link": "https://www.tomshardware.com/maker-stem/soldering-irons/best-soldering-irons-amazon-prime-day-2025",
    "summary": "I've scoured Amazon for the best soldering deals, and I've found all the kit you need, while saving you $$$"
  },
  {
    "title": "Grab vital 3D printer maintenance tools for less this Amazon Prime Day   up to 37% off HOTO, Creality, Wera",
    "link": "https://www.tomshardware.com/3d-printing/best-3d-printer-tools-amazon-prime-day-2025",
    "summary": "3D printers need maintenance and with these great tools you ll be producing great prints all day long."
  },
  {
    "title": "These are the tools we use to build and maintain our precious tech, and they're on sale for Amazon Prime Day",
    "link": "https://www.tomshardware.com/desktops/pc-building/best-pc-tools-amazon-prime-day-2025",
    "summary": "You really do need all of these tools to keep your electronics in good order, and luckily they are all on offer for Amazon Prime Day."
  },
  {
    "title": "Microsoft says Xbox hardware isn't going anywhere   company reaffirms commitment to AMD-powered next-gen console",
    "link": "https://www.tomshardware.com/video-games/xbox/microsoft-says-xbox-hardware-isnt-going-anywhere-company-reaffirms-commitment-to-amd-powered-next-gen-console",
    "summary": "Xbox Game Pass' painful price hikes aren't tied to a desire by Microsoft to softly exit the gaming hardware market."
  },
  {
    "title": "One of the best 8TB SSDs is now also the cheapest at just 6 cents per GB   save up to 14% on the 8TB WD Black SN850X and solve your storage needs for good",
    "link": "https://www.tomshardware.com/pc-components/ssds/one-of-the-best-8tb-ssds-is-now-also-the-cheapest-at-just-6-cents-per-gb-save-up-to-14-percent-on-the-8tb-wd-black-sn850x-and-solve-your-storage-needs-for-good",
    "summary": "The WD_Black SN850X 8TB is now available for $539.99, down from $599.99; however, we've found a way to further reduce the price to $515.98."
  },
  {
    "title": "Best Prime Day Hard Drive deals 2025   HDD deals from WD, Seagate, and Toshiba",
    "link": "https://www.tomshardware.com/pc-components/hdds/best-hard-drive-hdd-deals-amazon-prime-day-2025",
    "summary": "These are the best HDD deals, guaranteed to expand your PC's storage without emptying your wallet."
  },
  {
    "title": "Intel's upcoming Panther Lake family will reportedly feature new \"Core Ultra X\" branding for fully-spec'd iGPU configs   Core Ultra 7 and 9 processors tipped to feature 12 Xe3 GPU cores",
    "link": "https://www.tomshardware.com/pc-components/cpus/intels-upcoming-panther-lake-family-will-reportedly-feature-new-core-ultra-x-branding-for-fully-specd-igpu-configs-core-ultra-7-and-9-processors-tipped-to-feature-12-xe3-gpu-cores",
    "summary": "The Panther Lake lineup of mobile CPUs is reportedly set to debut Intel's Xe3 graphics IP, with the top-end SKUs featuring up to 12 Xe3 GPU cores, being dubbed \"Core Ultra X,\" according to the latest leaks. Initially, only Core Ultra 7 and 9 were thought to feature the \"X\" branding, but Core Ultra 5, with its 10 Xe3 cores, is also rumored to be part of this exclusive club now."
  },
  {
    "title": "Intel's flagship Core Ultra 9 285K is down to its lowest price ever, at just $489   score the 24-core processor for $110 off this Prime Day",
    "link": "https://www.tomshardware.com/pc-components/intels-flagship-core-ultra-9-285k-is-down-to-its-lowest-price-ever-at-just-usd489-score-the-24-core-processor-for-usd110-off-this-prime-day",
    "summary": "Intel's Core Ultra 9 285K is often overlooked when it comes to a flagship CPU purchase because of its poor value proposition, but you can now get it for much cheaper than its closest competition, the Ryzen 9 9950X. This 24-core CPU performs neck-in-neck across the board, while consuming less power in idle states."
  },
  {
    "title": "Acer chief says Nvidia s Intel investment will complicate PC supply chains   says Lutnick's 50/50 proposal could take 50 years to realize",
    "link": "https://www.tomshardware.com/tech-industry/acer-chief-says-nvidias-intel-investment-will-complicate-pc-supply-chains-says-lutnicks-50-50-proposal-could-take-50-years-to-realize",
    "summary": "Acer CEO Jason Chen says that the Nvidia-Intel partnership could potentially complicate product planning and placement for PC makers."
  },
  {
    "title": "Developer recreates classic shoot 'em up Zaxxon as a UEFI firmware   isometric arcade game coded in x86 assembly for no-OS represents 'total freedom from big tech'",
    "link": "https://www.tomshardware.com/software/programming/developer-recreates-classic-shoot-em-up-zaxxon-as-a-uefi-firmware-isometric-arcade-game-coded-in-x86-assembly-for-no-os-represents-total-freedom-from-big-tech",
    "summary": "A Zaxxon remake, coded in x86-64 Assembly language, is now available as a UEFI application."
  },
  {
    "title": "Logitech s new MX Master 4 is already $30 off on Best Buy and cheaper than its predecessor   Prime Day alternative yields unexpected discount just 7 days after launch",
    "link": "https://www.tomshardware.com/pc-components/logitechs-new-mx-master-4-is-already-usd30-off-on-best-buy-and-cheaper-than-its-predecessor-prime-day-alternative-yields-unexpected-discount-just-7-days-after-launch",
    "summary": "Logitech s latest productivity mouse has barely hit store shelves, but Best Buy is already offering a $30 discount."
  },
  {
    "title": "Grab a 4TB SSD for 5 cents per gigabyte during Prime Day sales   8TB models start as low as 7 cents per GB",
    "link": "https://www.tomshardware.com/pc-components/ssds/best-4tb-8tb-ssd-deals-2025",
    "summary": "Roomy 4TB SSDs have dropped precipitously in price in recent years, and even some 8TB models are inching closer to affordability."
  },
  {
    "title": "Cyberattacks hit 91% of universities and 43% of businesses in last 12 months in the UK   survey suggests more than 600,000 businesses, 61,000 charities affected",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/cyberattacks-hit-91-percent-of-universities-and-43-percent-of-businesses-in-last-12-months-in-the-uk-survey-suggests-more-than-600-000-businesses-61-000-charities-affected",
    "summary": "UK businesses, universities, and secondary schools have come under unprecedented hacking attacks over the past year, with 9/10 of polled universities claiming to have suffered at least one breach attempt in the past 12 months."
  },
  {
    "title": "Swiss lab where researchers are working to create computers powered by mini human brains revealed in new report   mini brain organoids revealed, developers say 'we shouldn't be scared of them'",
    "link": "https://www.tomshardware.com/pc-components/cpus/swiss-lab-where-researchers-are-working-to-create-computers-powered-by-mini-human-brains-revealed-in-new-report-mini-brain-organoids-revealed-developers-say-we-shouldnt-be-scared-of-them",
    "summary": "A new report details a tour of a Swiss lab, where researchers are working to develop computers powered by mini human brains."
  },
  {
    "title": "Best Amazon Prime Day Tech Deals Live Blog   The Best Tech & PC Hardware Deals on GPUs, CPUs, SSDs, and more",
    "link": "https://www.tomshardware.com/news/live/best-amazon-prime-day-deals-live-the-best-tech-and-pc-hardware-deals-on-gpus-cpus-ssds-and-more",
    "summary": "Here is live coverage of the best Amazon Prime Big Deals Day deals across tech, PC hardware, laptops, SSDs, peripherals, accessories, and more."
  },
  {
    "title": "The best cheap tech you can grab this Amazon Prime Day   13 bargains under $13 to improve your tech life",
    "link": "https://www.tomshardware.com/peripherals/best-cheap-tech-amazon-prime-day-13-under-13-dollars",
    "summary": "We've scoured Amazon Prime Day sales pages and found these 13 products that won't hurt your wallet too much"
  },
  {
    "title": "OpenAI and AMD announce multibillion-dollar partnership   AMD to supply 6 gigawatts in chips, OpenAI could get up to 10% of AMD shares in return",
    "link": "https://www.tomshardware.com/tech-industry/openai-and-amd-announce-multibillion-dollar-partnership-amd-to-supply-6-gigawatts-in-chips-openai-could-get-up-to-10-percent-of-amd-shares-in-return",
    "summary": "AMD and OpenAI have announced a multibillion-dollar partnership to collaborate on AI data centers powered by AMD chips."
  },
  {
    "title": "Incessant gamer reaches fabled edge of Minecraft map after more than 14 years   has been walking towards mythical 'Far Lands' at the edge of the map since 2011, covering 12,500km in-game",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/incessant-gamer-reaches-fabled-edge-of-minecraft-map-after-more-than-14-years-has-been-walking-towards-mythical-far-lands-at-the-edge-of-the-map-since-2011-covering-12-500km-in-game",
    "summary": "A YouTuber and Twitch streamer finally reached Far Lands, the mythical 'edge' of early builds of Minecraft, after more than 14 years of in-game walking."
  },
  {
    "title": "Japanese tech giant deploys laser drones to protect chickens   drones are hoped to prevent the spread of avian flu",
    "link": "https://www.tomshardware.com/tech-industry/japanese-tech-giant-deploys-laser-drones-to-protect-chickens-drones-are-hoped-to-prevent-the-spread-of-avian-flu",
    "summary": "NTT has designed a laser drone system to protect poultry farms from potential spreaders of avian flu."
  },
  {
    "title": "Save over $1,200 on a RTX 4060 gaming laptop during Prime Day   pay less than half the normal price for the MSI Raider GE68HX",
    "link": "https://www.tomshardware.com/pc-components/save-over-usd1-200-on-a-rtx-4060-gaming-laptop-during-prime-day-pay-less-than-half-the-normal-price-for-the-msi-raider-ge68hx",
    "summary": "Last year s MSI Raider GE68HX combines solid performance and premium features, and at this price, it s a steal."
  },
  {
    "title": "Ukraine s rotating barbed wire drone barriers discovered by Russians   motorized barriers tear and slice the fiber-optic lines that jam-proof drones leave in their trail",
    "link": "https://www.tomshardware.com/tech-industry/ukraines-rotating-barbed-wire-drone-barriers-discovered-by-russians-motorized-barriers-tear-and-slice-the-fiber-optic-lines-that-jam-proof-drones-leave-in-their-trail",
    "summary": "Remote controlled fiber optic-tethered drones may have met their match with a new Ukrainian innovation."
  },
  {
    "title": "Nintendo Switch 2 supports two different types of Nvidia DLSS   A second, 'light' version for upscaling beyond 1080p, along with the standard, PC-like CNN model",
    "link": "https://www.tomshardware.com/video-games/nintendo/nintendo-switch-2-supports-two-different-types-of-nvidia-dlss-a-second-light-version-for-upscaling-beyond-1080p-along-with-the-standard-pc-like-cnn-model",
    "summary": "Nintendo apparently includes two different versions of DLSS on the Switch 2, corroborating long-standing rumors of a custom DLSS present on the console. Digital Foundry's latest testing reveals that the second, 'light' version of DLSS can upscale beyond 1080p at the cost of an inferior image while in motion."
  },
  {
    "title": "Bitcoin rockets to all-time high of over $125,000   rise fueled by increase in U.S. equities and interest in Bitcoin ETFs",
    "link": "https://www.tomshardware.com/tech-industry/cryptocurrency/bitcoin-rockets-to-all-time-high-of-over-usd125-000-rise-fueled-by-increase-in-u-s-equities-and-interest-in-bitcoin-etfs",
    "summary": "Bitcoin just hit an all-time high of $125,000 due to a combination of investors seeking alternative assets and MegaWhales moving holdings to long-term storage."
  },
  {
    "title": "Intel s Core Ultra 5 225F is at an all-time low $170, making Arrow Lake more affordable ahead of Amazon's Prime Day sale",
    "link": "https://www.tomshardware.com/pc-components/intels-core-ultra-5-225f-is-at-an-all-time-low-usd170-making-arrow-lake-more-affordable-ahead-of-amazons-prime-day-sale",
    "summary": "Intel s entry-level Core Ultra 5 225F processor is now available for under $170, offering 10-core performance, PCIe 5.0 support, and an onboard NPU at a wallet-friendly price."
  },
  {
    "title": "The transistor was patented 75 years ago today   the age of silicon and software began with a three-electrode circuit element using semiconductor materials",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/the-age-of-silicon-and-software-began-75-years-ago-with-the-patenting-of-the-transistor",
    "summary": "75 years ago, the three Bell Labs scientists behind the invention of the transistor would, at last, have the U.S. Patent in their hands."
  },
  {
    "title": "OCuLink outpaces Thunderbolt 5 in Nvidia RTX 5070 Ti tests   latter up to 14% slower on average in gaming benchmarks",
    "link": "https://www.tomshardware.com/pc-components/gpus/oculink-outpaces-thunderbolt-5-in-nvidia-rtx-5070-ti-tests-latter-up-to-14-percent-slower-on-average-in-gaming-benchmarks",
    "summary": "Independent tests confirm that while Thunderbolt 5 improves eGPU performance over Thunderbolt 4, OCuLink's direct PCIe connection delivers superior gaming and bandwidth results, although it remains impractical for most users."
  },
  {
    "title": "Award-winning gaming keyboard reaches a historic low of $17 just before Prime Day   get 66% off on the Apex 3 TKL for a limited time",
    "link": "https://www.tomshardware.com/peripherals/gaming-keyboards/award-winning-gaming-keyboard-reaches-a-historic-low-of-usd17-just-before-prime-day-get-66-percent-off-on-the-apex-3-tkl-for-a-limited-time",
    "summary": "The SteelSeries Apex 3 TKL gaming keyboard is on sale for just $16.99 a 66% discount from its $49.99 original price."
  },
  {
    "title": "Microsoft reportedly mulls ad-infested free Xbox Cloud Gaming plan   Game Pass Ultimate subscriber allegedly catches ad during game loading",
    "link": "https://www.tomshardware.com/video-games/cloud-gaming/microsoft-reportedly-mulls-ad-infested-free-xbox-cloud-gaming-plan-game-pass-ultimate-subscriber-allegedly-catches-ad-during-game-loading",
    "summary": "Microsoft is reportedly preparing to launch a new, ad-supported free tier of Xbox Cloud Gaming very soon. You'll have to watch two-minute ads before each session, which will be limited to one hour in duration. You get a total of five hours each month, and only a limited number of games will be available in this tier."
  },
  {
    "title": "Hyper 212 Pro CPU air cooler drops to an all-time low of $18 just before Prime Day   save big with a 49% discount",
    "link": "https://www.tomshardware.com/pc-components/air-cooling/hyper-212-pro-cpu-air-cooler-drops-to-an-all-time-low-of-usd18-just-before-prime-day-save-big-with-a-49-percent-discount",
    "summary": "Cooler Master's Hyper 212 Pro aRGB air cooler is on sale for half off, just before Amazon's Prime Big Deals Day, making it one of the most affordable tower-style CPU coolers available right now."
  },
  {
    "title": "UK cops busted for faking productivity while working from home by holding down keys on keyboard   26 officers and staff reportedly caught trying to trick keylogging software",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/uk-cops-busted-for-faking-productivity-while-working-from-home-by-holding-down-keys-on-keyboard-26-officers-and-staff-reportedly-caught-trying-to-trick-keylogging-software",
    "summary": "Officers and staff are finding creative ways to trick the system."
  },
  {
    "title": "One of the fastest 2TB PCIe 5.0 SSDs is down to its lowest price ever, 8 cents per gigabyte this Prime Day   Enjoy blazing-fast PCIe 5.0 storage for only $159",
    "link": "https://www.tomshardware.com/pc-components/ssds/one-of-the-fastest-2tb-pcie-5-0-ssds-is-down-to-its-lowest-price-ever-8-cents-per-gigabyte-this-prime-day-enjoy-blazing-fast-pcie-5-0-storage-for-only-usd159",
    "summary": "Crucial is offering its flagship 2TB T705 PCIe 5.0 SSD for just $160, this Prime Day. Utilizing Phison's E26 controller and 232-layer Micron TLC, the T705 achieves read and write speeds of 14.5 GB/s and 12.7 GB/s, respectively, backed by 1,200 TBW of endurance. It earned the Editor's Choice award in our review."
  },
  {
    "title": "Discord data hacked in latest customer service breach to expose user information   hackers gained access via third-party support systems but didn't steal passwords",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/discord-data-hacked-in-latest-customer-service-breach-to-expose-user-information-hackers-gained-access-via-third-party-support-systems-but-didnt-steal-passwords",
    "summary": "Discord's support systems were recently compromised in a data breach, where hackers gained access to some user information via third-party service providers. The hackers intended to extort money from Discord by holding the data, but the company has already begun an investigation and severed the affected provider's access to its ticketing system."
  },
  {
    "title": "Samsung s QD-OLED 4K 240 Hz gaming monitors are now at their lowest-ever price for Prime Day   $879 for the 27-inch, $999 for the 32-inch",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/samsungs-qd-oled-4k-240-hz-gaming-monitors-are-now-at-their-lowest-ever-price-for-prime-day-usd879-for-the-27-inch-usd999-for-the-32-inch",
    "summary": "The new Odyssey G8 QD-OLEDs from Samsung bring flagship-grade visuals, 240 Hz smoothness, and advanced burn-in protection."
  },
  {
    "title": "Ultra-rare unreleased Pentium 4 with 4.0 GHz clock speed discovered   CPU-Z confirms it is an Intel Pentium Extreme Edition 980",
    "link": "https://www.tomshardware.com/pc-components/cpus/ultra-rare-unreleased-pentium-4-with-4-0-ghz-clock-speed-discovered-cpu-z-confirms-it-is-an-intel-pentium-extreme-edition-980",
    "summary": "A rare Intel engineering sample from the twilight of the Pentium 4 era has surfaced on social media."
  },
  {
    "title": "AOL's dial-up internet service killed with a final modem screech after 34 years   America Online goes offline this week, but other dial-up services still exist",
    "link": "https://www.tomshardware.com/service-providers/network-providers/aols-dial-up-internet-service-killed-with-a-final-modem-screech-this-week-after-34-years-america-online-goes-offline-but-other-dual-up-services-still-exist",
    "summary": "AOL's 34-year established dial-up service was finally shuttered this week."
  },
  {
    "title": "Classic Snake game now playable in your browser URL address bar   JavaScript remake uses Unicode Braille characters to render the game",
    "link": "https://www.tomshardware.com/video-games/classic-snake-game-now-playable-in-your-browser-url-address-bar-javascript-remake-uses-unicode-braille-characters-to-render-the-game",
    "summary": "A new version of Snake, coded to run in your browser s URL address bar, makes playing it on your old Nokia brick feel luxuriously high-res and futuristic."
  },
  {
    "title": "Best MicroSD Express Cards for Nintendo Switch 2 in 2025   the best cards on the market, benchmarked and ranked",
    "link": "https://www.tomshardware.com/pc-components/microsd-cards/best-microsd-express-cards-for-nintendo-switch-2",
    "summary": "We ve carefully chosen the best microSD Express cards to meet the needs and budgets of all Switch 2 owners, based on our detailed lab testing."
  },
  {
    "title": "Crazy Google Japan keyboard design switches keys for dials   the Gboard Dial Edition shows why the software team isn't allowed to design hardware",
    "link": "https://www.tomshardware.com/peripherals/keyboards/crazy-google-japan-keyboard-design-switches-keys-for-dials-the-gboard-dial-edition-shows-why-the-software-team-isnt-allowed-to-design-hardware",
    "summary": "Google Japan s Gboard team have designed and open-sourced a revolutionary new physical keyboard that boldly eschews keys in favor of dials."
  },
  {
    "title": "Jeff Bezos envisions space-based data centers in 10 to 20 years   could allow for natural cooling and more effective solar power",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/jeff-bezos-envisions-space-based-data-centers-in-10-to-20-years-could-allow-for-natural-cooling-and-more-effective-solar-power",
    "summary": "Jeff Bezos envisions gigawatt-scale orbital data centers within 10 20 years, powered by continuous solar energy and space-based cooling, but the concept remains commercially unviable today due to the immense cost and complexity of deploying thousands of tons of hardware, solar panels, and radiators into orbit."
  },
  {
    "title": "China to launch commercial underwater data center   facility expected to consume 90% less power for cooling",
    "link": "https://www.tomshardware.com/desktops/servers/china-to-launch-commercial-underwater-data-center-facility-expected-to-consume-90-percent-less-power-for-cooling",
    "summary": "Chinese company Highlander will be the first to run a commercial underwater data center, serving state-owned companies off the coast of Shanghai."
  },
  {
    "title": "Crucial's 20Gb/s X10 Pro 2TB external SSD is only $149 in this early Amazon Prime Day deal   rugged and portable USB-C storage for tech lovers",
    "link": "https://www.tomshardware.com/pc-components/external-ssds/crucials-20gb-s-x10-pro-2tb-external-ssd-is-only-usd149-in-this-early-amazon-prime-day-deal-rugged-and-portable-usb-c-storage-for-tech-lovers",
    "summary": "Crucial's X10 Pro 2TB puts large-capacity storage in the palm of your hand. Save $59 in this early Prime Day deal."
  },
  {
    "title": "AI data centers are swallowing the world's memory and storage supply, setting the stage for a pricing apocalypse that could last a decade",
    "link": "https://www.tomshardware.com/pc-components/storage/perfect-storm-of-demand-and-supply-driving-up-storage-costs",
    "summary": "As flash demand climbs and legacy DRAM supply lags, memory prices are rising across the board. Meanwhile, nearline HDD shortages are forcing hyperscalers to accelerate the adoption of QLC SSDs for roles once gated by cost, tightening both ends of the storage market."
  },
  {
    "title": "BlackRock subsidiary buys up 78 data centers totaling 5 gigawatts in $40 billion deal   AI vendor Aligned added to company's portfolio",
    "link": "https://www.tomshardware.com/tech-industry/blackrock-subsidiary-buys-up-78-data-centers-totaling-5-gigawatts-in-usd40-billion-deal-ai-vendor-aligned-added-to-companys-portfolio",
    "summary": "BlackRock subsidiary Global Infrastructure Partners set to buy out Aligned Data Centers for $40 billion."
  },
  {
    "title": "Nvidia details efficiency of the NVFP4 format for LLM training   new paper reveals how NVFP4 offers benefits over FP8 and BF16",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/nvidia-details-efficiency-of-the-nvfp4-format-for-llm-training-new-paper-reveals-how-nvfp4-offers-benefits-over-fp8-and-bf16",
    "summary": "Nvidia has demonstrated that its NVFP4 4-bit floating point format originally intended for inference can be used for stable, large-scale training of LLMs with minimal accuracy loss, offering significant gains in compute and memory efficiency over both FP8 and BF16."
  },
  {
    "title": "Samsung's 49-inch OLED gaming monitor drops to lowest-ever price   max out your GPU, not your credit card, for just $879",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/samsungs-49-inch-oled-gaming-monitor-drops-to-lowest-ever-price-max-out-your-gpu-not-your-credit-card-for-just-usd879",
    "summary": "Amazon is offering the Samsung Odyssey G9 G93SC at a price of $879.99, representing a new all-time low. The gaming monitor typically retails for $1,599.99."
  },
  {
    "title": "wafer.space lets you design your custom silicon just for $7 per die (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/10/07/wafer-space-lets-you-design-your-custom-silicon-just-for-7-per-die/",
    "summary": "wafer.space has launched its first pooled silicon fabrication run on Crowd Supply, called the GF180MCU Run 1, which enables designers, engineers, and companies to create 1,000 custom ASICs using GlobalFoundries 180 nm mixed-signal process. Each slot provides a fixed 3.88 5.07 mm (19.67 mm ) die area replicated 1,000 times, meaning you will receive 1000 chips, with options for bare dies or chip-on-board packaging. The GF180MCU process supports 5 metal layers, MIM capacitors (~2.0 fF/ m ), poly and high-res poly resistors, and standard-Vt MOS devices. Users can handle their own pad ring, ESD, and I/O layout while wafer.space manages fabrication, dicing, and shipping from Singapore. Designs can be open or closed source, and full wafers are also available for advanced testing or collection. Designs are submitted to wafer.space as GDSII files (the standard file format for chip layouts). Wafer.space automatically checks these files to make sure they can be manufactured correctly. [...] The post wafer.space lets you design your custom silicon just for $7 per die (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "The latest Raspberry Pi OS images are now based on Debian 13  Trixie ",
    "link": "https://www.cnx-software.com/2025/10/06/raspberry-pi-os-debian-13-trixie/",
    "summary": "Since Debian 13 Trixie was released last August, it was just a matter of time until Raspberry Pi OS followed. Raspberry Pi announced the update from Bookworm to Trixie a few days ago. The new Raspberry Pi OS images get the new and updated packages from Debian 13, and features like 64-bit time support to solve the Y2K38 bug. However, as Simon Long, UX engineer at Raspberry Pi, points out, there have been fewer changes in newer versions of Debian, and most changes in the new version of Pi OS are cosmetic, although there are some interesting under-the-hood changes as well. The most obvious change from the user s perspective is the new theme featuring a completely new set of icons, a new font (Nunito Sans Light), new desktop backgrounds (the new default is a photo of the sun rising over the Drakensberg mountains in Lesotho), and some other small tweaks. [...] The post The latest Raspberry Pi OS images are now based on Debian 13 Trixie appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "1GHz Renesas RA8T2 Cortex-M85 MCUs feature MRAM and EtherCAT for industrial motor control",
    "link": "https://www.cnx-software.com/2025/10/06/1ghz-renesas-ra8t2-cortex-m85-mcus-feature-mram-and-ethercat-for-industrial-motor-control/",
    "summary": "Renesas has recently introduced the new RA8T2, an AI-powered motor control Cortex-M85 MCU that can be considered a direct upgrade to the RA8T1, which launched last year. The RA8T2 offers higher performance along with networking options for industrial, robotics, and other motor control systems. The RA8T2 features a 1GHz Arm Cortex-M85 core, an optional 250MHz Cortex-M33 core, up to 1MB MRAM and 2MB SRAM, a 300MHz PWM timer, dual 16-bit ADCs with simultaneous sampling, high-speed comparators, fast PWM shutdown, and more. Connectivity options include dual Gigabit Ethernet, EtherCAT slave, USB, CAN FD, I3C, and SPI, while security features include TrustZone and a cryptographic engine. Renesas RA8T2 key features and specifications: MCU core Arm Cortex-M85 up to 1 GHz (Armv8.1-M, TrustZone, FPU, MVE, ETM) Arm Cortex-M33 up to 250 MHz (Armv8-M, DSP, TrustZone, ETM) Memory & Storage Up to 1 MB MRAM 2 MB SRAM (with ECC) 256 KB TCM for [...] The post 1GHz Renesas RA8T2 Cortex-M85 MCUs feature MRAM and EtherCAT for industrial motor control appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Easily add 80+ Mbps Ethernet to microcontrollers with WIZ630io QSPI RJ45 module",
    "link": "https://www.cnx-software.com/2025/10/05/easily-add-80-mbps-ethernet-to-microcontrollers-with-wiz630io-qspi-rj45-module/",
    "summary": "WIZnet WIZ630io is a small module featuring an RJ45 jack and a W6300 controller supporting up to 80+ Mbps Ethernet over QSPI @ 150 MHz. As a reminder, the W6300 features 64KB of SRAM for 8 sockets, each with a 4KB TX/RX buffer by default. It is notably found in the WIZnet W6300-EVB-Pico2 development board powered by a Raspberry Pi RP2350 MCU. The WIZ630io allows you to easily add Ethernet to any RP2350 board or other microcontroller with a SPI or QSPI interface. WIZnet WIZ630io specifications: W6300 QSPI Ethernet controller Host Interface High-speed QSPI (MODE 0/3), system bus with 2 address signals & 8-bit data Internal 32KB SRAM for Tx/ Rx buffers (64KB in total) 8x independent sockets with 64KB Memory 10BaseT / 10BaseTe / 100BaseTX Ethernet PHY Integrated Auto negotiation (Full and half-duplex, 10 and 100-based) Auto-MDIX only on Auto-Negotiation Mode IP Fragmentation not supported Hardwired TCP/IP protocols [...] The post Easily add 80+ Mbps Ethernet to microcontrollers with WIZ630io QSPI RJ45 module appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "kv4p HT   Turn an Android smartphone into a ham radio transceiver",
    "link": "https://www.cnx-software.com/2025/10/04/kv4p-ht-turn-an-android-smartphone-into-an-ham-radio-transceiver/",
    "summary": "kv4p HT is an open-source hardware VHF or UHF radio designed to plug into the USB-C port of an Android smartphone and turn it into a handheld ham radio transceiver. It s based on an ESP32 wireless module and an SA818 radio module. This accessory makes your phone capable of off-grid voice and text communication with a Technician-class amateur radio license. It s small enough to fit into a pocket, partially because it does not need a battery, relying on the built-in battery of your phone. kv4p HT V2.0 specifications: Wireless module ESP32-WROOM-32E-N4 SoC ESP32 dual-core Tensilica LX6 microcontroller @ up to 240 MHz with 520KB SRAM Storage 4MB flash Wireless 2.4 GHz WiFi 4 and Bluetooth 4.2 BR/LE connectivity, built-in PCB antenna VHF Radio SA818-V radio module or DRA818V (134 174MHz) VHF low-pass filter SMA antenna connector Tx Power Up to 1 Watt for several [...] The post kv4p HT Turn an Android smartphone into a ham radio transceiver appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Linux-based Vega OS replaces Android-based Fire OS  in Amazon Fire TV Stick 4K Select",
    "link": "https://www.cnx-software.com/2025/10/03/linux-based-vega-os-replaces-android-based-fire-os-in-amazon-fire-tv-stick-4k-select/",
    "summary": "Amazon has recently introduced the Fire TV Stick 4K Select media streamer with a MediaTek MT8698 quad-core Cortex-A55 processor, 1GB RAM, 8GB eMMC flash, HDMI 2.1 video output, and WiFi 5 and Bluetooth 5.0 connectivity. However, the most interesting part of the announcement is the software, as Amazon has dropped the Android-based Fire OS used in its previous devices and instead relies on the new Linux-based Vega OS for the Fire TV Stick 4K Select. Amazon Fire TV Stick 4K Select (AFTCA002) specifications: SoC MediaTek MT8698 MCM CPU Quad-core Arm Cortex-A55 clocked up to 1.7 GHz GPU Mali G310v2 up to 500 MHz with OpenGL ES 3.1 support VPU (hardware video decoder) AV1 up to 3840x2160p (4K) @ 60 fps, 100 Mbps, 8-bit and 10-bit input with HDR10, HDR10+, and HLG H.265 (HEVC) up to 3840x2160p (4K) @ 60 fps, 35 Mbps, 8-bit and 10-bit input with [...] The post Linux-based Vega OS replaces Android-based Fire OS in Amazon Fire TV Stick 4K Select appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "M5Stack LLM-8850 card   An M.2 M-Key AI accelerator module based on Axera AX8850 24 TOPS SoC",
    "link": "https://www.cnx-software.com/2025/10/03/m5stack-llm-8850-card-an-m-2-m-key-ai-accelerator-module-based-on-axera-ax8850-24-tops-soc/",
    "summary": "M5Stack LLM 8850 card is an M.2 M-Key 2242 AI acceleration module powered by an Axera AX8850 SoC delivering 24 TOPS ( INT8) of performance, and suitable for host devices such as Raspberry Pi 5, Rockchip RK3588 SBCs, and even x86 PCs like mini PCs with a spare M.2 Key-M socket. The card ships with 8GB RAM, a 32Mbit SPI NOR flash, and also supports H.265/H.264 8Kp30 video encoding and 8Kp60 video decoding, with up to 16 channels for 1080p videos. It is also equipped with an active cooling system to maintain stable temperatures and prevent thermal degradation inside enclosures. M5Stack LLM 8850 card specifications: SoC Axera AX8850 CPU Octa-core Cortex A55 processor at 1.7 GHz NPU 24 TOPS @ INT8 VPU Video Encoder 8K @ 30 fps H.264/H.265 encoding, supports scaling / cropping Video Decoder 8K @ 60 fps H.264/H.265 decoding, supports 16 channels 1080p parallel decoding, supports scaling / cropping Memory 8GB 64 bit LPDDR4x @ 4266 Mbps Storage 32Mbit QSPI NOR [...] The post M5Stack LLM-8850 card An M.2 M-Key AI accelerator module based on Axera AX8850 24 TOPS SoC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Snapdragon X2 Elite Extreme and X2 Elite processors target high-end Windows PCs",
    "link": "https://www.cnx-software.com/2025/10/02/snapdragon-x2-elite-extreme-and-x2-elite-processors-target-high-end-windows-pcs/",
    "summary": "Qualcomm has recently announced the Snapdragon X2 Elite Extreme (X2E-96-100) and Snapdragon X2 Elite (X2E-88-100 and X2E-80-100) processors for Windows PCs, which the company claims are the Fastest and Most Efficient for laptops. All three 3nm parts are equipped with six Performance cores clocked at up to 3.6 GHz, six or twelve Premium cores clocked at up to 5 GHz (single core) or 4.4 GHz (multi-core), an Adreno X2-85 or X2-90 GPU, an 80 TOPS Hexagon NPU for Copilot+, and an LPDDR5x memory interface for up to 128+ GB memory with up to 228GB/s bandwidth. Other highlights include the Snapdragon X75 5G modem, FastConnect 7800 WiFi 7 and Bluetooth 5.4 chipset, 4K video resolution for built-in and external displays, USB4, PCIe Gen5 interfaces, and more. Let s check the full specifications and differences between the three Snapdragon X2 Elite devices in the table below. Qualcomm claims the Snapdragon X2 Elite Extreme [...] The post Snapdragon X2 Elite Extreme and X2 Elite processors target high-end Windows PCs appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "DDR4 supply/demand stress leads to Raspberry Pi CM4/CM5 price increases",
    "link": "https://www.cnx-software.com/2025/10/02/ddr4-supply-demand-stress-leads-to-raspberry-pi-cm4-cm5-price-increases/",
    "summary": "The price of DDR4 memory has increased dramatically in recent months due to limited supply and increased demand for AI workloads. The Raspberry Pi Compute Module 4 and 5 (CM4/CM5) are based on LPDDR4 memory, and Raspberry Pi reports that memory costs are roughly 120% higher than they were just a year ago. So they have no choice but to increase the price by $5 to $10 for the CM4 and CM5, as well as the Raspberry Pi 500 keyboard PC. I assume the $200 price tag for the Raspberry Pi 500+ mechanical keyboard PC released last week already includes this new reality. Product affected: 4GB Compute Module 4 and Compute Module 5 variants increase by $5 8GB Compute Module 4 and Compute Module 5 variants increase by $10 Raspberry Pi 500 unit-only increases by $10 to $100 Raspberry Pi Development Kit for Compute Module 5 increases by $5 to [...] The post DDR4 supply/demand stress leads to Raspberry Pi CM4/CM5 price increases appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "AAEON GENE-ARH6   A 3.5-inch subcompact industrial SBC with Intel Core Ultra 200H/U SoC",
    "link": "https://www.cnx-software.com/2025/10/01/aaeon-gene-arh6-a-3-5-inch-subcompact-industrial-sbc-with-intel-core-ultra-200h-u-soc/",
    "summary": "AAEON s GENE-ARH6 is a 3.5-inch subcompact industrial SBC built around the Intel Core Ultra 200H/U Arrow Lake processors, which delivers up to 96 TOPS AI power when equipped with an Intel Core Ultra 7 255H SoC. The board supports up to 96GB DDR5 memory, and multiple display outputs through HDMI 2.1, DP 2.0, LVDS, and eDP interfaces. Connectivity includes three Ethernet ports, four COM headers, GPIO, SMBus or I2C, and multiple USB ports. Expansion options include M.2 slots for 5G, Wi-Fi 6E CNVi, PCIe Gen4 storage with RAID 0 or 1, and an FPC2 connector for additional PCIe lanes. Other features include TPM 2.0 security, a watchdog timer, a 9V to 36V DC input, and a wide temperature range. Applications include robotics, inference-based safety monitoring, automation, and rugged industrial deployments with wide power input and connectivity options. AAEON GENE-ARH6 specifications: Arrow Lake SoC (one of the other) Intel Core Ultra 5 [...] The post AAEON GENE-ARH6 A 3.5-inch subcompact industrial SBC with Intel Core Ultra 200H/U SoC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ARIES MSRZG3E OSM-compliant SiP with Renesas RZ/G3E MPU targets industrial HMI and Edge AI",
    "link": "https://www.cnx-software.com/2025/10/01/aries-msrzg3e-osm-compliant-sip-with-renesas-rz-g3e-mpu-targets-industrial-hmi-and-edge-ai/",
    "summary": "ARIES Embedded MSRZG3E is an OSM-compliant system-in-package (SiP) built around the Renesas RZ/G3E MPU, designed for HMI, industrial, medical, and edge AI applications. The Renesas RZ/G3E SoC integrates a quad-core Arm Cortex-A55 CPU, a Cortex-M33 real-time core, and an Ethos-U55 NPU delivering up to 512 GOPS for AI power. Other features include PCIe Gen3, USB 3.2, dual Gigabit LAN, plus CAN FD, UART, I2C, SPI, and ADC. Multimedia support includes dual displays, MIPI-CSI camera input, and H.264/H.265 video codec. The SiP ships with 512 MB to 8 GB LPDDR4 RAM and 4 GB to 64 GB eMMC flash, with commercial and industrial-grade temperature support. MSRZG3E MSRZG3E SiP specifications: SoC Renesas RZ/G3E dual or quad Arm Cortex-A55, Arm Cortex-M33 core MCU Memory 512 MB to 8 GB LPDDR4 RAM Storage 4 GB to 64 GB eMMC NAND flash 2 Mbit to 512 Mbit SPI NOR flash 476-pad land grid [...] The post ARIES MSRZG3E OSM-compliant SiP with Renesas RZ/G3E MPU targets industrial HMI and Edge AI appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Fogwise AIRbox Q900   $599 Qualcomm IQ-9075 AI Box delivers up to 200 TOPS of AI performance",
    "link": "https://www.cnx-software.com/2025/09/30/fogwise-airbox-q900-599-qualcomm-iq-9075-ai-box-delivers-up-to-200-tops-of-ai-performance/",
    "summary": "Fogwise AIRBox Q900 AI box is an upgrade to the Fogwise Airbox powered by a Qualcomm IQ-9075 SoC with up to 200 TOPS (sparse) of AI performance, 36GB RAM, and 128GB UFS storage. Radxa says its new AI micro-server competes directly against the NVIDIA Jetson Orin NX 16GB, offering cheaper overall system cost, similar performance, and higher efficiency. Other benefits include Cortex-R52 real-time cores, 2.5GbE networking, and separate GPU, NPU, and DSP. Fogwise AIRBox Q900 specifications: SoC Qualcomm DragonWing IQ-9075 CPU Octa-core Kryo Gen 6 (Cortex-A78C-based) application cores @ up to 2.36 GHz Quad-ore Cortex-R52 real-time cores @ up to 1.85GHz GPU Adreno 663 GPU delivering up to 1.2 TFLOPS FP32 with secure GPU compute; supports Vulkan 1.2, OpenGL ES 3.2, OpenCL 2.0 FP, Adreno NN Direct VPU Adreno VPU 765 Video Decode AV1 / HEVC / H.265 / H.264 / VP9 / MPEG-2 1x 8Kp60 / [...] The post Fogwise AIRbox Q900 $599 Qualcomm IQ-9075 AI Box delivers up to 200 TOPS of AI performance appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Orange Pi AI Studio Pro   A Huawei Ascend 310 AI box with up to 352 TOPS, 192GB RAM",
    "link": "https://www.cnx-software.com/2025/09/30/orange-pi-ai-studio-pro-huawei-ascend-310-ai-mini-pc-with-up-to-352-tops-192gb-ram/",
    "summary": "Orange Pi AI Studio is a USB4 box designed for artificial intelligence applications, equipped with up to two Huawei Ascend 310 AI octa-core ARM 64-bit processors, delivering up to 176 TOPS per chip, as well as up to 192GB RAM. This follows the Orange Pi AIPro introduced last year, with an unnamed Huawei Ascend SoC delivering up to 20 TOPS NPU. The basic version of AI Studio has up to 96GB of LPDDR4X memory and 32MB of SPI Flash. The interface of the device is very simple, featuring a 12V 10A DC power interface, a USB 4.0 Type-C port, a power switch, and an indicator light. The only disadvantage is the limited number of ports provided, even do not include an HDMI port or an Ethernet port. Orange Pi AI Studio and AI Studio Pro specifications: SoC AI Studio Huawei Ascend 310 octa-core 64-bit processor delivering up to 176 TOPS AI [...] The post Orange Pi AI Studio Pro A Huawei Ascend 310 AI box with up to 352 TOPS, 192GB RAM appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Intel N97 mini-ITX motherboard targets industrial automation, digital signage, networking appliances",
    "link": "https://www.cnx-software.com/2025/09/30/intel-n97-mini-itx-motherboard-targets-industrial-automation-digital-signage-networking-appliances/",
    "summary": "The Jetway DMTX-ADN1 is a mini-ITX industrial motherboard built around the Intel N97 Alder Lake-N SoC with support for DDR5 memory, multiple displays, and a wide temperature range. It targets applications in industrial automation, kiosks, digital signage, and networking appliances. The motherboard supports up to 32GB DDR5 4800MHz memory, triple display setups via HDMI 2.0b, DP 1.4, and a 24-bit dual-channel LVDS/eDP interface, and offers a SATA III port and two M.2 M-Key sockets for NVMe or SATA drives. It also features an M.2 E-Key 2230 socket for wireless expansion with CNVi support, two Gigabit Ethernet ports, and a range of I/Os, including six COM ports, two USB 3.2, eight USB 2.0, 8-bit GPIO, SMBus, watchdog timer, and more. Jetway DMTX-ADN1 Specifications: SoC Intel Processor N97 quad-core Alder Lake N-series processor up to 3.4 GHz with Intel UHD graphics; 12W TDP System Memory DDR5 4800MHz via single Channel SO-DIMM, up to 32GB (up [...] The post Intel N97 mini-ITX motherboard targets industrial automation, digital signage, networking appliances appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Linux 6.17 release   Main changes, Arm, RISC-V, and MIPS architectures",
    "link": "https://www.cnx-software.com/2025/09/29/linux-6-17-release-main-changes-arm-risc-v-and-mips-architectures/",
    "summary": "Linux 6.17 has just been released on LKML: No huge surprises this past week, so here we are, with kernel 6.17 pushed out and ready to go. Below is the shortlog for just the last week not the full 6.17 release as usual. It s not exciting, which is all good. I think the biggest patch in there is some locking fixes for some bluetooth races that could cause use-after-free situations. Whee that s about as exciting as it gets. Other than that, there the usual driver fixlets (GPU and networking dominate as usual, but dominate is still pretty small), there s some minor random other driver updates, some filesystem noise, and core kernel and mm. And some selftest updates. This obviously means that the merge window for 6.18 will open tomorrow, and I already have four dozen pull requests pending. Thanks to the proactive people you know who [...] The post Linux 6.17 release Main changes, Arm, RISC-V, and MIPS architectures appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Olimex RP2350-PICO2 open hardware boards expose all 48 GPIOs for breadboard prototyping",
    "link": "https://www.cnx-software.com/2025/09/29/olimex-rp2350-pico2-open-hardware-boards-expose-all-48-gpios-for-breadboard-prototyping/",
    "summary": "Olimex RP2350-PICO2-BB48 and RP2350-PICO2-BB48R open hardware development boards are built around the Raspberry Pi RP2350B MCU, and expose all 48 GPIOs in a 0.6-inch dual-inline PCB layout. Compared to the earlier PICO2-XL and PICO2-XXL boards, this new board features a breadboard-friendly design with options for PSRAM and microSD on the BB48R version. Other features include USB-C power/data, BOOT and RESET buttons, a 2A 3.3V regulator, UEXT and Qwiic/Stemma connectors, status LED, and debug pads. With pre-soldered headers, it can be plugged directly into a breadboard, making it ideal for DIY projects, IoT, retro computing, and hardware prototyping. Olimex RP2350-PICO2-BB48 and RP2350-PICO2-BB48R specifications: MCU Microcontroller Raspberry Pi RP2350B CPU Dual-core Arm Cortex-M33 @ 150 MHz with Arm Trustzone, Secure boot OR Dual-core RISC-V Hazard3 @ 150 MHz Either two cores can be used. Memory 520 KB on-chip SRAM Package QFN-80 Memory 8 MB external QSPI PSRAM (only [...] The post Olimex RP2350-PICO2 open hardware boards expose all 48 GPIOs for breadboard prototyping appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "LUNYEE 4040 PRO CNC router review with Candle software",
    "link": "https://www.cnx-software.com/2025/09/28/lunyee-4040-pro-cnc-router-review-with-candle-software/",
    "summary": "LUNYEE has sent us a review sample of the 4040 PRO CNC router, featuring a larger work volume than the LUNYEE 3018 Pro Ultra model we reviewed a few months ago. It is designed for milling and engraving tasks that demand high precision and features a robust structure to support continuous operation. It works with wood, plastic, and acrylic. Its standout feature is the complete set of accessories, such as the Probe system for Z-axis setup and a workpiece clamping kit, allowing users to get started right away. This makes it an ideal CNC Router for beginners in engraving work. We ve previously reviewed the smaller 3018 Pro Ultra with Easel, but we ll instead use Candle software on the 4040 PRO machine. LUNYEE 4040 PRO CNC router specifications Controller 4-axis GRBL 1.1f-compatible controller based on GigaDevice GD32F303CCT6 Arm Cortex-M4 MCU @ 120MHz with 256KB flash, 48KB SRAM. Control Software [...] The post LUNYEE 4040 PRO CNC router review with Candle software appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Fing Agent Raspberry Pi Kit   An all-in-one Raspberry Pi 4-based network monitoring solution",
    "link": "https://www.cnx-software.com/2025/09/27/fing-agent-raspberry-pi-kit-an-all-in-one-raspberry-pi-4-based-network-monitoring-solution/",
    "summary": "Fing has recently introduced the Fing Agent Raspberry Pi Kit , also called Fing Agent plug-and-play Raspberry Pi 4 kit , for its Fing Agent network monitoring system, which can be considered a follow-up to the earlier Fingbox hardware released in 2017. While Fingbox was a custom appliance based on Ubuntu Core, the new kit uses a Raspberry Pi, making it easier to set up and use in a home or small office network. The kit includes a Raspberry Pi 4 Model B (2GB) in an aluminium case, a 32GB microSD card with Fing Agent preinstalled, a USB-C power supply with adapters, and a Cat 5e Ethernet cable. Once connected to the router, it works with the Fing app, desktop, or web to monitor devices, track uptime and speed, detect intrusions, and send alerts about unusual activity. It also supports device blocking, presence detection, and diagnostics, such as port scans and vulnerability checks. Making it [...] The post Fing Agent Raspberry Pi Kit An all-in-one Raspberry Pi 4-based network monitoring solution appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Nordic nRF54LM20A Cortex-M33 wireless MCU doubles the SRAM to 512 KB, increases flash capacity",
    "link": "https://www.cnx-software.com/2025/09/26/nordic-nrf54lm20a-cortex-m33-wireless-mcu-doubles-the-sram-to-512-kb-increases-flash-capacity/",
    "summary": "Nordic Semi s nRF54LM20A is a new Cortex-M33-based high-memory wireless MCU part of the nRF54L Series with double the SRAM and higher flash capacity compared ot the nRF54L15. It targets consumer, industrial, healthcare, and smart home applications, and is especially suitable for HID peripherals and gaming devices. The SoC integrates a 128 MHz Arm Cortex-M33 core with a RISC-V coprocessor, 2 MB NVM, and 512 KB RAM, alongside up to 66 GPIOs, high-speed USB, and Nordic s fourth-generation ultra-low-power 2.4 GHz radio supporting Bluetooth LE, Thread, Zigbee, Channel Sounding, and Matter. It offers twice the processing power, three times the efficiency, and up to 50% lower power consumption than the nRF52 Series. nRF54LM20A key specifications and comparison with other nRF54 Series SoCs: The nRF54LM20A comes in two packages: a CSP98 (3.9 x 3.7 mm) package for compact designs with 66 GPIOs, and a QFN52 (6 x 6 mm) package with 35 GPIO [...] The post Nordic nRF54LM20A Cortex-M33 wireless MCU doubles the SRAM to 512 KB, increases flash capacity appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Arduino cloud adds Bluetooth based provisioning, starting with UNO R4 WiFi",
    "link": "https://www.cnx-software.com/2025/09/26/arduino-cloud-adds-bluetooth-based-provisioning-starting-with-uno-r4-wifi/",
    "summary": "Arduino has recently introduced a new Bluetooth-based provisioning flow on the Arduino Cloud, starting with the UNO R4 WiFi board. This feature simplifies the initial setup process, making it faster and cable-free, and is aimed at improving ease of use for connected projects. With the Arduino IoT Cloud Remote app, users can power the board, detect it automatically, connect to Wi-Fi, and complete setup with visual feedback in just a few steps. Once provisioned, the board can be managed on Arduino Cloud with features like remote monitoring, OTA updates, real-time dashboards, AI Assistant support, and third-party integrations. The new flow is currently exclusive to the latest UNO R4 WiFi board, which also come with 3 months of free Arduino Cloud Maker Plan access. More boards will adopt the feature in future updates. Arduino Cloud features Compatible boards Initially available on Arduino UNO R4 WiFi (new stock only), more boards [...] The post Arduino cloud adds Bluetooth based provisioning, starting with UNO R4 WiFi appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "A Catalyst for Open Source: NextPCB Launches KiCad Projects Platform to Fuel the Future of KiCad (Sponsored)",
    "link": "https://www.cnx-software.com/2025/09/26/a-catalyst-for-open-source-nextpcb-launches-kicad-projects-platform-to-fuel-the-future-of-kicad/",
    "summary": "NextPCB, a global leader in PCB manufacturing and assembly solutions, proudly announces the launch of kicadprojects.com, a dynamic open-source community dedicated to supporting open-source hardware and enriching KiCad, the renowned open-source EDA tool for schematic capture and PCB layout. This initiative unites engineers, students, and innovators worldwide to share projects, collaborate, and support the KiCad community and core KiCad development. A Hub for Collaboration and Innovation Developed and maintained by NextPCB, a platinum KiCad sponsor, kicadprojects.com is more than a platform it s a thriving hub where the global KiCad community can: Share & Showcase Projects Upload and explore innovative PCB designs, schematics, and tutorials. Streamline Collaboration Download project files, generate automated BOMs, and visualize designs straight from your browser with NextPCB s KiCad EDA viewer. Open Source, Open Impact In a bold commitment to open-source stewardship, NextPCB will donate $10 (USD) towards the KiCad Project for every approved project uploaded [...] The post A Catalyst for Open Source: NextPCB Launches KiCad Projects Platform to Fuel the Future of KiCad (Sponsored) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Espressif s EchoEar ESP32-S3 voice-controlled AI chatbot runs esp-brookesia firmware",
    "link": "https://www.cnx-software.com/2025/09/26/espressif-echoear-esp32-s3-voice-controlled-ai-chatbot-with-circular-touchscreen-and-mic-array/",
    "summary": "Espressif Systems EchoEar is a compact ESP32-S3 AI chatbot designed for voice interaction and edge AI applications, for smart toys, voice-enabled speakers, and control systems. It features a 1.85-inch circular touch display, a dual microphone array with local wake-word detection, and support for large AI models from OpenAI, Xiaozhi AI, and Gemini. The kit is built around the ESP32-S3-WROOM-1 Wi-Fi 4 and Bluetooth 5 module, and also integrates a 3W speaker for audio interaction, and a microSD card slot for data storage. Other hardware features include a BMI270 IMU, a green LED, a USB-C port, a magnetic connector, and a battery management chip. Espressif EchoEar Specifications Wireless Module ESP32-S3-WROOM-1 SoC Espressif Systems ESP32-S3R8 CPU Dual-core Tensilica LX7 up to 240 MHz with vector extension for AI/ML workloads RAM 512KB SRAM, 8MB PSRAM ROM 284KB Wireless WiFi 4 and Bluetooth LE 5 Storage 16MB [...] The post Espressif s EchoEar ESP32-S3 voice-controlled AI chatbot runs esp-brookesia firmware appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Raspberry Pi 500+ mechanical keyboard PC gets 256 GB NVMe SSD, 16GB RAM, RGB LED lighting",
    "link": "https://www.cnx-software.com/2025/09/25/raspberry-pi-500-mechanical-keyboard-pc-gets-256-gb-nvme-ssd-16gb-ram-rgb-led-lighting/",
    "summary": "The Raspberry Pi 500+ is an upgrade to the Raspberry Pi 500 keyboard PC, getting a mechanical keyboard with RGB LED lighting, a 256GB NVMe SSD, and 16GB LPDDR4x memory. Apart from that, the rest of the ports and features are exactly the same for the new Plus model: two 4K-capable micro HDMI ports, Gigabit Ethernet, WiFi 5 and Bluetooth 5.0, three USB ports, a microSD card slot, and a 40-pin GPIO header. Raspberry Pi 500+ specifications: SoC Broadcom BCM2712 CPU Quad-core 64-bit Arm Cortex-A76 processor @ 2.4GHz GPU VideoCore VII GPU with support for OpenGL ES 3.1 graphics, Vulkan 1.2 VPU 4Kp60 HEVC decoder System Memory 16GB LPDDR4X-4267 SDRAM Storage 256 GB NVMe SSD preloaded with Raspberry Pi OS; connected to M.2 PCIe 2280 socket MicroSD card slot Video Output 2x micro HDMI ports up to 4Kp60 Networking Gigabit Ethernet RJ45 port Dual-band [...] The post Raspberry Pi 500+ mechanical keyboard PC gets 256 GB NVMe SSD, 16GB RAM, RGB LED lighting appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "5 Ways Embedded AI Processors are Revolutionizing Device Performance (Sponsored)",
    "link": "https://www.cnx-software.com/2025/09/25/5-ways-embedded-ai-processors-are-revolutionizing-device-performance/",
    "summary": "Artificial intelligence (AI) is moving from cloud-first architectures to edge-first designs, so more processing now runs on phones, cameras, and embedded controllers. Running inference on-device cuts latency and keeps sensitive data local. This momentum is reshaping product roadmaps, all due to different revolutions driven by edge AI. The Core Revolutions Driven by Edge AI Instead of routing every model and signal to the cloud, devices are processing more data locally to act faster and protect sensitive information. Because edge AI is changing where intelligence runs, IDC estimates global spending on edge computing reached about $261 billion in 2025. This rapid enterprise investment is due to several reasons. 1. Enabling Real-Time, On-Device Decisions Eliminating the cloud round-trip lets devices turn sensor input into action in milliseconds. This capability is essential for industrial automation and control loops because embedded AI processors run optimized models on-device, so decisions happen continuously. 2. Strengthening Privacy [...] The post 5 Ways Embedded AI Processors are Revolutionizing Device Performance (Sponsored) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "BIOSTAR MU-N150   A Twin Lake fanless Industrial PC with 2.5GbE, triple 4K video output",
    "link": "https://www.cnx-software.com/2025/09/25/biostar-mu-n150-a-twin-lake-fanless-industrial-pc-with-2-5gbe-triple-4k-video-output/",
    "summary": "BIOSTAR has launched the EdgeComp MU-N150, a compact 0.6L fanless industrial PC built around the Intel Processor N150 Twin Lake SoC for edge computing, automation, HMI, POS/kiosk, and more. Some other N150 systems, like the HUNSN RJ42/RJ43 and Protectli VP2430, are for networking with four 2.5GbE ports, while the MU-N150 uses dual LAN but adds industrial-grade durability. The PC supports up to 16GB DDR5 4800MHz memory, triple 4K video output, and dual 2.5GbE. Expansion option includes M.2 Key-M slot for NVMe storage and an M.2 Key-E slot for Wi-Fi/BT modules. Other features include 2x USB 3.2, 2x USB 2.0, an RS232 COM port, an audio jack, and an input voltage range of 12 19V DC. It s fanless, ventless, and compatible with various operating systems for industrial and commercial applications. BIOSTAR EdgeComp MU-N150 specifications: SoC Intel Processor N150 quad-core Twin Lake processor @ up to 3.6 GHz (Turbo) with 6MB cache, [...] The post BIOSTAR MU-N150 A Twin Lake fanless Industrial PC with 2.5GbE, triple 4K video output appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Particle Tachyon Review   A Qualcomm QCM6490 Edge AI and 5G cellular SBC tested with Ubuntu",
    "link": "https://www.cnx-software.com/2025/09/24/particle-tachyon-review-a-qualcomm-qcm6490-edge-ai-and-5g-cellular-sbc-tested-with-ubuntu/",
    "summary": "Hello, today I m going to review the Particle Tachyon SBC designed for high-performance edge AI, IoT, and connectivity applications. Powered by the Qualcomm QCM6490 platform with an octa-core Kryo CPU, an Adreno GPU, and a Hexagon DSP. The board also integrates robust wireless options, including 5G, Wi-Fi 6E, and Bluetooth 5.2. The Particle Tachyon adopts the Raspberry Pi form factor and provides various I/O interfaces, such as a 40-pin GPIO header compatible with Raspberry Pi HATs, along with expansion options for sensors and peripherals. It also includes a Qwiic connector for SparkFun and Adafruit integrations, as well as MIPI-CSI/DSI connectors for cameras and displays. Particle Tachyon Unboxing The parcel was shipped from Hong Kong and arrived with all the expected components. Inside the package, I found a single-cell 3.7 V LiPo battery with a 3-pin JST-PH connector, the main Tachyon board, a small welcome card, and an additional microphone audio [...] The post Particle Tachyon Review A Qualcomm QCM6490 Edge AI and 5G cellular SBC tested with Ubuntu appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Renesas RA0L1 low-cost Cortex-M23 MCUs adds capacitive, EMI-resistant touch",
    "link": "https://www.cnx-software.com/2025/09/24/renesas-ra0l1-low-cost-cortex-m23-mcus-adds-capacitive-emi-resistant-touch/",
    "summary": "Renesas has expanded its low-cost RA0 series of low-cost, low-power Cortex-M23 MCUs with the new RA0L1, the first in the lineup to feature integrated capacitive touch. Designed for low-cost battery-powered applications with responsive touch control, ultra-low current consumption, and fast wake-up. The RA0L1 combines up to 64KB flash, 16KB SRAM, and a 1.6V 5.5V operating range with peripherals such as a 12-bit ADC, temperature sensor, multiple UART/I2C/SPI interfaces, timers, RTC, and a random number generator. It supports up to 24 capacitive touch channels using Renesas self-capacitance technology, a high-accuracy 1% on-chip oscillator, safety functions, and security features including TRNG and unique ID. Renesas RA0L1 MCU specifications: MCU Core Arm Cortex-M23 Armv8-M Core up to 32MHz Memory and Storage 16KB SRAM with parity Code Flash Up to 64KB Data Flash 1KB(1M program/erase cycles) Flash read protection (FRP) 128-bit unique ID Human-Machine Interface Capacitive Touch Sensing Unit up to [...] The post Renesas RA0L1 low-cost Cortex-M23 MCUs adds capacitive, EMI-resistant touch appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Raspberry Pi CM0 castellated module features Raspberry Pi RP3A0 System-in-Package",
    "link": "https://www.cnx-software.com/2025/09/23/raspberry-pi-cm0-castellated-module-features-raspberry-pi-rp3a0-system-in-package/",
    "summary": "Raspberry Pi CM0 is a yet-to-be-officially-announced castellated Compute Module based on the Raspberry Pi RP3A0 SiP (System-in-Package) found in the Raspberry Pi Zero 2 W and Raspberry Pi Compute Module 3E (CM3E). Since most Raspberry Pi products are announced under a strict embargo, I m always surprised when I find new Raspberry Pi hardware that was never formally introduced. But it seems to happen from time to time for products targeting business customers specifically. The CM3E Compute Module was one example, and the CM0 appears to be another. Raspberry Pi CM0 specifications: SiP Raspberry Pi RP3A0 SoC Broadcom BCM2710A1 CPU Quad-core Cortex-A53 processor @ 1.0 GHz GPU VideoCore IV GPU supporting OpenGL ES 1.1, 2.0 graphics VPU H.264/MPEG-4 1080p30 video decoding, H.264 1080p30 video encoding System Memory 512MB LPDDR2 RAM Storage 0GB (Raspberry Pi CM0 Lite), 8GB, or 16GB eMMC flash Wireless Optional [...] The post Raspberry Pi CM0 castellated module features Raspberry Pi RP3A0 System-in-Package appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "DuckyPad Pro 20-key ESP32-S3 macropad supports up to 3700+ macros using duckyScript language",
    "link": "https://www.cnx-software.com/2025/09/23/duckypad-pro-20-key-esp32-s3-macropad-supports-up-to-3700-macros-using-duckyscript-language/",
    "summary": "The duckyPad Pro is an ESP32-S3-based open-source macropad with 20 mechanical keys, rotary encoders, and powered by the duckyScript engine, for macro scripting and automation beyond QMK/VIA. This allows task automation, application control, and input scripting for productivity, creative workflows, and hacking experiments. The device features hot-swappable switches, rotary encoders, RGB lighting, USB-C, Bluetooth 5.0, and a 1.5-inch OLED display. Powered by a custom duckyScript, it supports variables, loops, conditions, and functions for complex macros up to 64 profiles and 3,712 macros total. It offers automatic profile switching based on the active window, microSD storage for quick setup and backup, and optional expansion modules for pedals or external switches. It supports various scripts and (OLED text, RGB changes, button reads) and is compatible with multiple operating systems, making this suitable for streamers, developers, office workers, and security researchers alike. DuckyPad Pro specifications: Wireless MCU Espressif Systems ESP32-S3 CPU Dual-core [...] The post DuckyPad Pro 20-key ESP32-S3 macropad supports up to 3700+ macros using duckyScript language appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Luckfox PicoKVM   A low-cost IP-KVM with 1080p HDMI capture, Wake-on-LAN, virtual storage emulation",
    "link": "https://www.cnx-software.com/2025/09/23/luckfox-picokvm-low-cost-ip-kvm-with-1080p-hdmi-capture-wake-on-lan-virtual-storage-emulation/",
    "summary": "Luckfox PicoKVM is a compact and low-cost IP-KVM tool designed for the remote management of PCs, servers, and development boards. Like other KVM solutions, this allows users to control a computer or board remotely, even when it s turned off or when accessing the BIOS. Built around the Rockchip RV1106 Cortex-A7 processor with 256MB DDR3 and 8GB eMMC storage, the PicoKVM supports 1080p60 video capture with H.264 encoding and 80 200 ms latency. The device integrates HDMI input, a 100 Mbps Ethernet port, and USB-C for HID and USB storage emulation, while the full version adds a 1.54-inch touchscreen display for status monitoring. Additional features include Wake-on-LAN, MicroSD card storage expansion, GPIO-based power control, web and serial terminals, and support for custom scripting. Luckfox PicoKVM specifications: SoC Rockchip RV1106G3 CPU Arm Cortex A7 @ 1.2GHz with an integrated RISC-V co-processor. NPU 1 TOPS 4th-gen Rockchip NPU with hybrid quantization (int4, int8, int16) [...] The post Luckfox PicoKVM A low-cost IP-KVM with 1080p HDMI capture, Wake-on-LAN, virtual storage emulation appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Using an overpowered vape as a secondary display",
    "link": "https://www.cnx-software.com/2025/09/22/using-an-overpowered-vape-as-a-secondary-display/",
    "summary": "Last week, we noted that it was possible to run a web server on a disposable vape through its USB-C port, and now I ve been shown DOOM on an even more overpowered vape acting as a secondary display, which is a bit larger in size than the WeAct Display FS 0.96-inch USB display we just covered. Perhaps I should add a vaporware category on CNX Software The new hack was done by Aaron Christophel (ACT1441) using an Aspire PIXO Vape with a Cortex-M4F MCU, a small color LCD, a USB-C port, Bluetooth LE connectivity, and a battery. Aspire PIXO vape hardware specifications: MCU Puxa PY32F403XC Arm Cortex-M4F microcontroller @ 144 MHz with 64KB RAM, 256KB Flash Storage External 16MB SPI Flash Display 323 x 173 LCD Wireless WS8000 BLE chip USB 1x USB Type-C port Misc Heating Coil Vape microphone (designed to detect airflow from [...] The post Using an overpowered vape as a secondary display appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Compex  JustWiFi  driverless, Ethernet-connected Wi-Fi 7 module delivers up to 10 Gbps throughput (Sponsored)",
    "link": "https://www.cnx-software.com/2025/09/22/compex-justwifi7-driverless-ethernet-connected-wi-fi-7-module-delivers-up-to-10-gbps-throughput/",
    "summary": "Compex Systems (Compex) is redefining how wireless is integrated into modern embedded and industrial systems with the launch of JustWiFi , a one-of-a-kind, driverless, tri-band concurrent Wi-Fi 7 module that connects through Ethernet protocols. Designed to eliminate the complexity of traditional wireless integration, JustWiFi makes high-performance Wi-Fi deployment faster, simpler, and smarter. Rethinking Wi-Fi Integration: No Drivers. No Hassle. JustWiFi Most of the Wi-Fi modules today rely on PCIe, SDIO, or USB interfaces and are controlled through drivers. Developers will need to deal with the drivers compatibility with the host platform, particularly its OS and kernel version. The drivers for Wi-Fi 7 are particularly complex due to the standard s advanced features. Many open-sourced drivers and sometimes the host CPU are not able to deliver the full capabilities of the Wi-Fi 7 chipset. These complications often unnecessarily slow down and add to the development time and effort. Engineered for speed, simplicity, and [...] The post Compex JustWiFi driverless, Ethernet-connected Wi-Fi 7 module delivers up to 10 Gbps throughput (Sponsored) appeared first on CNX Software - Embedded Systems News ."
  }
]