[
  {
    "title": "Save $80 off this humongous, enterprise-class hard drive   WD Gold 14TB HDD on clearance sale, just 1.7 cents per gigabyte",
    "link": "https://www.tomshardware.com/pc-components/hdds/save-usd80-off-this-humongous-enterprise-class-hard-drive-wd-gold-14tb-hdd-can-be-yours-for-usd240-thats-just-1-7-cents-per-gigabyte",
    "summary": "Western Digital is a reliable name in the storage market, known for solid performance at decent prices. The WD Gold 14TB HDD, therefore, is no different, and it's on clearance right now for just $240. Get your hands on enterprise-grade mass storage thanks to this discount code."
  },
  {
    "title": "Cambridge University launches project to rescue data trapped on old floppy disks",
    "link": "https://www.tomshardware.com/pc-components/storage/cambridge-university-rescues-data-from-old-floppy-disks",
    "summary": "On October 9, Cambridge University Library opened its doors to anyone with an old floppy disk and a question: What s on here?"
  },
  {
    "title": "Nintendo allegedly hacked by Crimson Collective hacking group    screenshot shows leaked folders, production assets, developer files, and backups",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/nintendo-allegedly-hacked-by-crimson-collective-hacking-group-screenshot-shows-leaked-folders-production-assets-developer-files-and-backups",
    "summary": "The Crimson Collective hacking group claims to have breached Nintendo's security and stolen files from the gaming company."
  },
  {
    "title": "Battlefield 6 has an epic launch bug where it fails to recognize that the game is already installed   EA boss suggests one affected user to  refund and buy on Steam ",
    "link": "https://www.tomshardware.com/video-games/battlefield-6-has-an-epic-launch-bug-where-it-fails-to-recognize-that-the-game-is-already-installed-ea-boss-suggests-one-affected-user-to-refund-and-buy-on-steam",
    "summary": "Battlefield 6 encountered issues on its launch day, and it took EA six hours to resolve the problem."
  },
  {
    "title": "New 7-Zip high-severity vulnerabilities expose systems to remote attackers   users should update to version 25 ASAP",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/7-zip-flaws-open-door-to-remote-code-execution",
    "summary": "Two newly disclosed vulnerabilities in 7-Zip could allow attackers to execute arbitrary code by tricking users into opening a malicious ZIP archive."
  },
  {
    "title": "UPS reportedly destroying packages due to customs confusion   thousands of parcels per day are seemingly affected by delays due to documentation issues",
    "link": "https://www.tomshardware.com/tech-industry/ups-reportedly-destroying-packages-due-to-customs-confusion-thousands-of-parcels-per-day-are-seemingly-affected-by-delays-due-to-documentation-issues",
    "summary": "UPS is experiencing issues with thousands of parcels due to incomplete information, resulting in customs delays and, in some cases, item destruction."
  },
  {
    "title": "AmeraLabs introduces elastic 3D printing resin with long-lasting squish   a full bottle is priced at $140",
    "link": "https://www.tomshardware.com/3d-printing/ameralabs-introduces-elastic-3d-printing-resin-with-long-lasting-squish-a-full-bottle-is-priced-at-usd140",
    "summary": "FLX-300 features an exceptionally low compression set, enabling printed parts to spring back to their original shape after repeated deformation reliably."
  },
  {
    "title": "Trump strikes back at China with a 100% tariff and critical software ban   major escalation retaliates for China's rare earth restrictions",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/trump-strikes-back-at-china-with-a-100-percent-tariff-and-critical-software-ban-major-escalation-retaliates-for-chinas-rare-earth-restrictions",
    "summary": "President Trump imposed a 100% tariff on Chinese goods and announced export controls on undefined 'critical software,' a move that could cripple China s tech and manufacturing sectors more than tariffs themselves."
  },
  {
    "title": "I was  forced  to update to Windows 11, and it wasn t as bad as I thought   How to upgrade from Windows 10 to Windows 11 without tearing your hair out",
    "link": "https://www.tomshardware.com/software/windows/i-was-forced-to-update-to-windows-11-and-it-wasnt-as-bad-as-i-thought-how-to-upgrade-from-windows-10-to-windows-11-without-tearing-your-hair-out",
    "summary": "I prefer using Linux, but upgrading from Windows 10 to Windows 11 was a smooth process. If you are being nagged to upgrade before October 14, then this how to will show just how easy it is."
  },
  {
    "title": "Bride surprises new husband with an RTX 5090 on wedding day   Chinese number slang reveals surprise gift",
    "link": "https://www.tomshardware.com/pc-components/gpus/bride-surprises-new-husband-with-an-rtx-5090-on-wedding-day-chinese-number-slang-reveals-surprise-gift",
    "summary": "A wedding video on social media shows a young couple exchanging gifts, with the groom receiving a GeForce RTX 5090 graphics card."
  },
  {
    "title": "Oklahoma man charged with supplying over one hundred 3D-printed machine gun conversion kits to a person he thought was an al-Qaida operative   suspect allegedly shipped a range of firearms parts intended for terrorist attacks",
    "link": "https://www.tomshardware.com/3d-printing/oklahoma-man-charged-with-supplying-over-one-hundred-3d-printed-machine-gun-conversion-kits-to-a-person-he-thought-was-an-al-qaida-operative-suspect-allegedly-shipped-a-range-of-firearms-parts-intended-for-terrorist-attacks",
    "summary": "A resident of Tulsa, Oklahoma is facing a potential 20 years in prison, for supplying another individual hundreds of 3D printed gun components."
  },
  {
    "title": "Secretlab Titan Evo NanoGen Review: The Next Generation",
    "link": "https://www.tomshardware.com/peripherals/gaming-chairs/secretlab-titan-evo-nanogen-review-the-next-generation",
    "summary": "The next generation of Titan Evo range sees a new leatherette fabric and supportive padding to keep you gaming and working in relative comfort."
  },
  {
    "title": "Converted school bus turned into mobile retro computing museum   historic array includes Sinclair (Timex) ZX Spectrum 48K and Commodore 64",
    "link": "https://www.tomshardware.com/video-games/retro-gaming/converted-school-bus-turned-into-mobile-retro-computing-museum-historic-array-includes-sinclair-timex-zx-spectrum-48k-and-commodore-64",
    "summary": "A father and son duo have converted an old school bus into a computer gaming museum."
  },
  {
    "title": "Battlefield 6 peaks at 747,000 concurrent players   newly launched game ranks among the top three most-played on Steam today",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/battlefield-6-peaks-at-747-000-concurrent-players-newly-launched-game-ranks-among-the-top-three-most-played-on-steam-today",
    "summary": "Hours after the Battlefield 6 launch, concurrent player counts have reached upwards of 747,000 on Steam, making the game the third most-played game on the platform."
  },
  {
    "title": "InferenceMax AI benchmark tests software stacks, efficiency, and TCO   vendor-neutral suite runs nightly and tracks performance changes over time",
    "link": "https://www.tomshardware.com/tech-industry/inferencemax-ai-benchmark-tests-software-stacks-efficiency-and-tco-vendor-neutral-suite-runs-nightly-and-tracks-performance-changes-over-time",
    "summary": "InferenceMax AI benchmark measures software stacks, efficiency, and TCO"
  },
  {
    "title": "President Trump warns of massively increased tariffs in wake of China's rare earth mineral 'monopoly position'   Xi Jinping meeting cancelled as Trump promises retaliation for Beijing's expanded export controls",
    "link": "https://www.tomshardware.com/tech-industry/president-trump-warns-of-massively-increased-tariffs-in-wake-of-chinas-rare-earth-mineral-monopoly-position-xi-jinping-meeting-cancelled-as-trump-promises-retaliation-for-beijings-expanded-export-controls",
    "summary": "President Trump, in a fiery Truth Social post, has just warned China about potential new tarriffs as a response to Beijing's expanded export controls surrounding rare earth minerals. Trump says for every element China monopolizes, America has two, and that other moves are also being considered in retaliation."
  },
  {
    "title": "Intel's 18A production starts before TSMC s competing N2 tech   here's how the two process nodes compare",
    "link": "https://www.tomshardware.com/pc-components/cpus/intels-18a-production-starts-before-tsmcs-competing-n2-tech-heres-how-the-two-process-nodes-compare",
    "summary": "Intel has begun mass production of its Core Ultra 3 'Panther Lake' processors built on 18A node at Fab 52 in Arizona, marking the first large-scale deployment of this advanced process ahead of TSMC s N2."
  },
  {
    "title": "U.S. Senate passes bill that forces AI chipmakers to prioritize sales to American companies   House now set to amend or pass legislation",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/u-s-senate-passes-bill-that-forces-ai-chipmakers-to-prioritize-sales-to-american-companies-house-now-set-to-amend-or-pass-legislation",
    "summary": "The Senate just passed the bill forcing Nvidia and AMD to prioritize US orders over exports."
  },
  {
    "title": "SoftBank is seeking $5 billion loan to invest in OpenAI, plans to use Arm shares as collateral   rapid AI expansion continues, investment could top $30 billion",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/softbank-is-seeking-usd5-billion-loan-to-invest-in-openai-plans-to-use-arm-shares-as-collateral-rapid-ai-expansion-continues-investment-could-top-usd30-billion",
    "summary": "SoftBank is securing a $5 billion loan backed by Arm shares to expand its OpenAI and AI infrastructure investments, raising total Arm-collateralized debt to $18.5 billion and further highlighting its leveraged AI expansion strategy."
  },
  {
    "title": "Microsoft cancels Wisconsin data center after community pushback   244-acre Caledonia site on hold, but Redmond says it remains committed to the region",
    "link": "https://www.tomshardware.com/desktops/servers/microsoft-cancels-wisconsin-data-center-after-community-pushback-244-acre-caledonia-site-on-hold-but-redmond-says-it-remains-committed-to-the-region",
    "summary": "Microsoft is canceling its plans to build a data center near the Oak Creek Power Plant after the community rallied against its plans."
  },
  {
    "title": "Back to its all-time low price, Alienware's AW3225QF4K QD-OLED gaming monitor is reduced by $350 in Dell's post-Prime Day deal",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/back-to-its-all-time-low-price-alienwares-aw3225qf4k-qd-oled-gaming-monitor-is-reduced-by-usd350-in-dells-post-prime-day-deal",
    "summary": "Save $350 off the price of Alienware's gorgeous 4K QD-OLED curved gaming monitor."
  },
  {
    "title": "China s new rare-earth curbs target chipmaking industry in retaliation to US restrictions   rare earth curbs reach back to older 14nm process tech and 256-layer memory",
    "link": "https://www.tomshardware.com/chinas-new-rare-earth-curbs-hit-14nm-and-256-layer-chipmaking",
    "summary": "China has quietly extended its rare-earth export controls into the heart of the semiconductor supply chain."
  },
  {
    "title": "China bans research company that helped unearth Huawei's use of TSMC tech despite U.S. bans   TechInsights added to Unreliable Entity List by state authorities",
    "link": "https://www.tomshardware.com/tech-industry/china-bans-research-company-that-helped-unearth-huaweis-use-of-tsmc-tech-despite-u-s-bans-techinsights-added-to-unreliable-entity-list-by-state-authorities",
    "summary": "Beijing has banned TechInsights from doing business with Chinese companies because it has \"defied China's strong objections to engage in activities such as so-called military-technical cooperation with Taiwan, made malicious remarks concerning China, and assisted foreign governments in suppressing Chinese companies.\""
  },
  {
    "title": "Microsoft deploys world's first 'supercomputer-scale' GB300 NVL72 Azure cluster   4,608 GB300 GPUs linked together to form a single, unified accelerator capable of 92.1 exaFLOPS of FP4 inference",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/microsoft-deploys-worlds-first-supercomputer-scale-gb300-nvl72-azure-cluster-4-608-gb300-gpus-linked-together-to-form-a-single-unified-accelerator-capable-of-1-44-pflops-of-inference",
    "summary": "Microsoft has just added a GB300 NVL72 supercluster to Azure, deploying a total of 4,608 GB300 GPUs across 64 racks. Each rack consists of 72x GPUs interconnected via NVLink, allowing for 1.44 PFLOPS of FP4 Tensor Core performance. Each rack is then intra-connected via Quantum-X800 InfiniBand at 800 Gb/s per GPU."
  },
  {
    "title": "China issues port crackdown on all Nvidia AI chip imports, says report   enforcement teams deployed to quash smuggling and investigate data center hardware, targeting H20 and RTX 6000D shipments",
    "link": "https://www.tomshardware.com/pc-components/gpus/china-launches-port-crackdown-on-nvidia-chips",
    "summary": "Chinese customs authorities have launched a sweeping crackdown on unlicensed Nvidia chip shipments, with enforcement teams deploying at major ports to inspect hardware shipments."
  },
  {
    "title": "Singapore company allegedly helped China smuggle $2 billion worth of Nvidia AI processors, report claims   Nvidia denies that the accused has any China ties, but a U.S. investigation is underway",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/singapore-company-alleged-to-have-helped-china-get-usd2-billion-worth-of-nvidia-ai-processors-report-claims-nvidia-denies-that-the-accused-has-any-china-ties-but-a-u-s-investigation-is-underway",
    "summary": "An investigation has uncovered that a Singapore-based firm with Chinese ties bought $2 billion worth of restricted Nvidia GPUs through Inspur's U.S. subsidiary to funnel them to Malaysia and Indonesia, where they were allegedly used by clients from China or resold to customers in the PRC."
  },
  {
    "title": "Spacious 24TB hard drive is a mere 1 cent per GB   Seagate's BarraCuda 24TB HDD is back on sale for $249",
    "link": "https://www.tomshardware.com/pc-components/hdds/spacious-24tb-hard-drive-is-at-an-all-time-low-of-a-mere-1-cent-per-gb-seagates-barracuda-24tb-hdd-is-back-on-sale-for-usd239",
    "summary": "This Seagate BarraCuda 24TB HDD is available at Newegg for $249 one of its best prices to date and an excellent deal for anyone in need of storage."
  },
  {
    "title": "Sony and AMD tease likely PlayStation 6 GPU upgrades  Radiance Cores and a new interconnect for boosting AI rendering performance",
    "link": "https://www.tomshardware.com/video-games/console-gaming/sony-and-amd-tease-likely-playstation-6-gpu-upgrades-radiance-cores-and-a-new-interconnect-for-boosting-ai-rendering-performance",
    "summary": "Sony and AMD teased several new technologies that will be making their way into Sony's next-generation console, dubbed Project Amethyst. Upgrades include new cores for rendering path tracing in real time and a new interconnect that will boost AI-rendering performance."
  },
  {
    "title": "The best 1TB microSD Express card for your Switch 2 is still 28% off   save $62 on the Lexar Play Pro 1TB",
    "link": "https://www.tomshardware.com/pc-components/microsd-cards/the-best-1tb-microsd-express-card-for-your-switch-2-is-still-28-percent-off-save-usd62-on-the-lexar-play-pro-1tb",
    "summary": "Amazon Prime Day is over, but you can still get this awesome Lexar Play Pro 1TB microSD Express card for your Switch 2 for a whopping 28% off."
  },
  {
    "title": "Grab vital 3D printer maintenance tools in these prime Day deals you can still get   up to 37% off HOTO, Creality, Wera",
    "link": "https://www.tomshardware.com/3d-printing/best-3d-printer-tools-amazon-prime-day-2025-you-can-still-get",
    "summary": "3D printers need maintenance and with these great tools you ll be producing great prints all day long."
  },
  {
    "title": "3D Printer Sales Bonanza is still ongoing after Prime Day   these are the best deals we found at all five sales",
    "link": "https://www.tomshardware.com/3d-printing/3d-printer-sale-prime-day-2025-roundup-best-deals-at-five-sales-elegoo-creality-anycubic-matterhackers",
    "summary": "There are some great 3D printer deals happening right now, and we've found the best and put them all into one page for you."
  },
  {
    "title": "Concerns grow after spate of social media posts showing SpaceX Starlink satellites burning in the sky   we are currently seeing a  couple of satellite re-entries a day,  says respected astrophysicist",
    "link": "https://www.tomshardware.com/networking/concerns-grow-after-spate-of-social-media-posts-showing-spacex-starlink-satellites-burning-in-the-sky-we-are-currently-seeing-a-couple-of-satellite-re-entries-a-day-says-respected-astrophysicist",
    "summary": "An astrophysicist interview underlines the growing risk of satellites, from the increasingly crowded skies, falling to Earth."
  },
  {
    "title": "South Korean government learns the importance of backups the hard way after catastrophic fire   858 terabytes of data goes up in magic smoke",
    "link": "https://www.tomshardware.com/pc-components/storage/south-korean-government-learns-the-importance-of-backups-the-hard-way-after-catastrophic-fire-858-terabytes-of-data-goes-up-in-magic-smoke",
    "summary": "858 TB of South Korean government data goes up in smoke, with no backups"
  },
  {
    "title": "AMD will beat Nvidia to launching AI GPUs on the cutting-edge 2nm node   Instinct MI450 is officially the first AMD GPU to launch with TSMC's finest tech",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/amd-could-beat-nvidia-to-launching-ai-gpus-on-the-cutting-edge-2nm-node-instinct-mi450-is-officially-the-first-amd-gpu-to-launch-with-tsmcs-finest-tech",
    "summary": "AMD is set to use TSMC's leading-edge N2 fabrication process for its next-generation CDNA 5-based Instinct MI450 accelerators, but Nvidia's Rubin may have an edge over these GPUs when it comes to brute force compute performance."
  },
  {
    "title": "Intel's Xe3 graphics architecture breaks cover   Panther Lake's 12 Xe Core iGPU promises 50+% better performance than Lunar Lake",
    "link": "https://www.tomshardware.com/pc-components/gpus/intels-xe3-graphics-architecture-breaks-cover-panther-lakes-12-xe-core-igpu-promises-50-percent-better-performance-than-lunar-lake",
    "summary": "Intel's Xe3 graphics architecture arrives on Panther Lake CPUs, and Intel has used it to build its largest, highest-performance integrated GPU yet."
  },
  {
    "title": "Intel takes the wraps off Panther Lake   first 18A client processor brings the best of Lunar Lake and Arrow Lake together in one package",
    "link": "https://www.tomshardware.com/pc-components/cpus/intel-takes-the-wraps-off-panther-lake-first-18a-client-processor-brings-the-best-of-lunar-lake-and-arrow-lake-together-in-one-package",
    "summary": "Today, Intel is giving the world its first look at Panther Lake, its first family of laptop SoCs to incorporate cutting-edge 18A silicon. With Cougar Cove P-cores, Darkmont E-cores, and up to 12 Xe3 graphics cores, Panther Lake is poised to bring the efficiency of Lunar Lake and the scalability of Arrow Lake-H together in one family of chips."
  },
  {
    "title": "Best Amazon Prime Day Tech Deals You Can Still Get Live Blog   Best Tech & PC Hardware Deals on GPUs, CPUs, SSDs, and more",
    "link": "https://www.tomshardware.com/news/live/best-amazon-prime-day-deals-you-can-still-get-live-best-tech-and-pc-hardware-deals-gpus-cpus-ssds-and-more-2025",
    "summary": "Here is live coverage of the best Amazon Prime Big Deals Day deals across tech, PC hardware, laptops, SSDs, peripherals, accessories, and more."
  },
  {
    "title": "China expands rare-earth export controls, creating risks for PC component supply   Beijing tightens grip on materials for HDDs and more to protect national security",
    "link": "https://www.tomshardware.com/tech-industry/china-expands-rare-earth-export-controls",
    "summary": "China has expanded its export controls on rare-earth elements, adding new items to a growing list of restricted materials and processing technologies."
  },
  {
    "title": "Washington's ambition for a 50/50 semiconductor deal with Taiwan is missing a key component   lack of a mature homegrown supply chain could be the missing link",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/washingtons-ambition-for-a-50-50-semiconductor-deal-with-taiwan-is-missing-a-key-component-lack-of-a-mature-homegrown-supply-chain-could-be-the-missing-link",
    "summary": "U.S. Commerce Secretary Howard Lutnick's plan to split leading-edge chip production equally between America and Taiwan seeks greater self-sufficiency and security but lacks clarity, overlooks U.S. industry realities, and remains largely symbolic given global dependencies on Japan, Europe, and Korea for materials, tools, and memory."
  },
  {
    "title": "Valve's next-gen 'Deckard' VR headset reportedly enters mass production, company allegedly plans to ship up to 600K units annually   upcoming 'Steam Frame' could launch before the end of the year",
    "link": "https://www.tomshardware.com/virtual-reality/valves-next-gen-deckard-vr-headset-reportedly-enters-mass-production-company-allegedly-plans-to-ship-up-to-600k-units-annually-upcoming-steam-frame-could-launch-before-the-end-of-the-year",
    "summary": "Steam's upcoming \"Deckard\" next-gen VR headset is said to have entered production, with 400,000-600,000 units planned to be shipped every year. Deckard, which may be officially named the Steam Frame, is poised to cost up to $1,200, and be released before the end of the year."
  },
  {
    "title": "Legendary Microsoft developer reveals the true story behind the most famous product activation key of all time   infamous Windows XP 'FCKGW' licensing key was actually 'a disastrous leak'",
    "link": "https://www.tomshardware.com/software/windows/legendary-microsoft-developer-reveals-the-true-story-behind-the-most-famous-product-activation-key-of-all-time-infamous-windows-xp-fckgw-licensing-key-was-actually-a-disastrous-leak",
    "summary": "Legendary Windows dev confirms the infamous XP-era 'FCKGW' volume licensing key was just a leak, not a hack."
  },
  {
    "title": "Bank of England, IMF, warn AI bubble risk has shades of 2000 dotcom crash   Goldman Sachs cautions we're not there 'yet'",
    "link": "https://www.tomshardware.com/tech-industry/bank-of-england-imf-warn-ai-bubble-risk-has-shades-of-2000-dotcom-crash-goldman-sachs-cautions-were-not-there-yet",
    "summary": "Major banking institutions are starting to warn of an impending market correction for AI companies and their stock prices. Although not all agree when it'll happen, most suggest it is coming as the major industry players continue to invest in each other, driving up investments and share prices in turn."
  },
  {
    "title": "U.S. finally grants Nvidia license to ship AI GPUs to UAE: 500,000 Blackwell GPUs coming to the Gulf region",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/u-s-finally-grants-nvidia-license-to-ship-ai-gpus-to-uae-500-000-blackwell-gpus-coming-to-the-gulf-region",
    "summary": "The U.S. has approved tens of billions worth of Nvidia AI hardware exports to the UAE under a new bilateral agreement linking up to 500,000 GPU shipments per year with $1.4 trillion in Emirati investment, in the U.S."
  },
  {
    "title": "Discord says only 70,000 government ID photos exposed in third-party service breach, denies 2.1 million figure   says it won't pay $3.5 million ransom and has cut communications with hackers, who are threatening to go public",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/discord-says-only-70-000-government-id-photos-exposed-in-third-party-service-breach-denies-2-1-million-figure-says-it-wont-pay-usd3-5-million-ransom-and-has-cut-communications-with-hackers-who-are-threatening-to-go-public",
    "summary": "Discord has hit back at claims its recent breach via a third-party service revealed government ID photos of over two million users. Instead, it claims only 70,000 were affected, but it's been clear that it will not be paying any blackmail demands, regardless."
  },
  {
    "title": "AI adoption far outpaces that of the early Internet   report sheds light on worldwide AI penetration and usage patterns",
    "link": "https://www.tomshardware.com/tech-industry/ai-adoption-far-outpaces-that-of-the-early-internet-report-sheds-light-on-worldwide-ai-penetration-and-usage-patterns",
    "summary": "A Financial Times report sheds light on worldwide AI penetration and usage patterns"
  },
  {
    "title": "Lucky PC builder snipes RTX 5090 for just $1,119   humbles proud shopper who scored one for $1,399 just two days earlier",
    "link": "https://www.tomshardware.com/pc-components/gpus/lucky-pc-builder-snipes-rtx-5090-for-just-usd1-119-humbles-proud-shopper-who-scored-one-for-usd1-399-just-two-days-earlier",
    "summary": "Two Redditors compete online to see who bought the cheapest GeForce RTX 5090 graphics card."
  },
  {
    "title": "RISC-V set to announce 25% market penetration   open-standard ISA is ahead of schedule, securing fast-growing silicon footprint",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/risc-v-set-to-announce-25-percent-market-penetration-open-standard-isa-is-ahead-of-schedule-securing-fast-growing-silicon-footprint",
    "summary": "RISC-V International will announce that silicon on the ISA has reached 25% market penetration later this month. This outpaces projections set just last year by other research groups like Omdia."
  },
  {
    "title": "Anker s 25,000 mAh Laptop Power Bank is $89 for Prime Day   this discounted portable charger includes two integrated USB-C cables and 165W max output",
    "link": "https://www.tomshardware.com/peripherals/ankers-25-000-mah-laptop-power-bank-is-usd89-for-prime-day-this-discounted-portable-charger-includes-two-integrated-usb-c-cables-and-165w-max-output",
    "summary": "At $89.99, the Anker Laptop Power Bank is TSA-approved and ready to power all of your portable devices"
  },
  {
    "title": "These are the best CPU cooler deals we found this Prime Day, up to 37% off   deals from Cooler Master, Thermalright, MSI, Corsair, and Thermaltake for every budget",
    "link": "https://www.tomshardware.com/pc-components/these-are-the-best-cpu-cooler-deals-we-found-this-prime-day-up-to-37-percent-off-deals-from-cooler-master-thermalright-msi-corsair-and-thermaltake-for-every-budget",
    "summary": "As Amazon's Prime Big Deals Day comes to a close, there's still a chance to snag some awesome deals on CPU coolers. We have singled out options from across the board, highlighting the best offers at each price point. Thermalright's Grand Vision 360 is the stand-out deal at the moment, but you can't go wrong with any other option either."
  },
  {
    "title": "Samsung's speedy 24-inch 180Hz gaming monitor hits historical all-time $109 low   nearly half-price Odyssey G3 G30D is $90 off on stellar sale for Prime Day",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/samsung-24-inch-180hz-gaming-monitor-prime-day-2025",
    "summary": "The Samsung Odyssey G3 G30D gaming monitor has lowered to $139 at Amazon its lowest price to date."
  },
  {
    "title": "ESP32-based dual-port WLED controller features Ethernet port, 24V DC input",
    "link": "https://www.cnx-software.com/2025/10/11/esp32-based-dual-port-wled-controller-features-ethernet-port-24v-dc-input/",
    "summary": "When it comes to ESP32-based WLED controllers, some of the best options are boards like the Adafruit Sparkle Motion, Mini Sparkle Motion, and Sparkle Motion Stick, but most of the time, they are out of stock. Thankfully, there are similar alternatives like the xChroma WLED Type-C and HACK Lab HackLED Pro, with similar features and wider availability. Now adding to that list is the 2-Port ESP32 ETH0 WLED Controller, which not only adds Ethernet connectivity but also supports dual outputs and 5V 24V LEDs, making it an excellent alternative to the Adafruit ones. The board supports both Ethernet and Wi-Fi connectivity and includes an onboard DC-DC converter that delivers a stable 5V supply to the ESP32 and logic circuits. Each output channel is fused with a 6A resettable polyfuse and a status LED that lights up during fault conditions. For added safety, the main power input is protected against reverse polarity, [...] The post ESP32-based dual-port WLED controller features Ethernet port, 24V DC input appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "FoBE IDEA Mesh Tracker C1   An nRF52840-based LoRa GPS tracker with sensors, OLED, knob, and more",
    "link": "https://www.cnx-software.com/2025/10/10/fobe-idea-mesh-tracker-c1-an-nrf52840-based-lora-gps-tracker-with-sensors-oled-knob-and-more/",
    "summary": "Designed by FoBE Studio in China, the FoBE IDEA Mesh Tracker C1 is a LoRa-powered off-grid communication device designed for outdoor GPS tracking, sensor data exchange, and mesh networking in remote environments. Built around the Nordic nRF52840 MCU, it integrates LoRa, GPS, BLE, and motion sensors, making it suitable for location tracking, environmental monitoring, and off-grid communication projects. The device integrates a GPS module, LoRa transceiver, 0.96-inch OLED display, buzzer, a 3-axis accelerometer, and a 3-axis gyroscope. Other ports include a USB-C port, reserved SWDIO/SWCLK headers, an 8-pin GPIO expansion header, and dual IPEX connectors for LoRa and GPS antennas. There is also a rotary encoder and two user buttons, and two indicator LEDs for controls and status feedback. Power input is provided via a 2-pin MX1.25 battery interface for portable, battery-powered outdoor IoT applications. FoBE IDEA Mesh Tracker C1 specifications: SoC Nordic Semiconductor nRF52840 CPU 32-bit Arm Cortex-M4F [...] The post FoBE IDEA Mesh Tracker C1 An nRF52840-based LoRa GPS tracker with sensors, OLED, knob, and more appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Avalue EPC-ASL Intel N97 fanless industrial mini PC is designed for 24/7 operation",
    "link": "https://www.cnx-software.com/2025/10/10/avalue-epc-asl-intel-n97-fanless-industrial-mini-pc-is-designed-for-24-7-operation/",
    "summary": "Avalue Technology s EPC-ASL is a rugged fanless industrial mini PC built around the Intel Processor N97. Designed for 24/7 operation and edge computing, the mini PC is suitable for industrial environments, such as smart manufacturing, retail, logistics, and surveillance. The PC supports up to 16GB DDR5 memory, dual 2.5GbE, and various I/O options, including six USB ports, dual RS-232, HDMI 2.0, and DisplayPort 1.4a for multi-display setups. Storage and expansion are supported by M.2 Key-B/E slots, which accommodate Wi-Fi 6E, LTE, 5G, or SSD modules for enhanced connectivity and storage. The system also includes TPM 2.0 security, +12V/24V DC input, and wall-mount support. Avalue EPC-ASL specifications: SoC Intel Processor N97 quad-core processor up to 3.6 GHz with 6MB cache, 24EU Intel UHD Graphics Gen 12 @ 1.2 GHz; TDP: 12W System Memory Up to 16GB DDR5 4800MHz via 1x SO-DIMM socket (Up to 64GB DDR5 is likely supported, but Avalue [...] The post Avalue EPC-ASL Intel N97 fanless industrial mini PC is designed for 24/7 operation appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Weffort Outdoor Smart Shade Review with Home Assistant over Matter/Thread",
    "link": "https://www.cnx-software.com/2025/10/09/weffort-outdoor-smart-shade-review-with-home-assistant-over-matter-thread/",
    "summary": "We re going to do a quick review of smart outdoor motorised shades from Weffort another brand that makes smart shades compatible with popular Smart Home platforms, including Home Assistant, SmartThings, Google Home, Apple HomeKit, and Amazon Alexa. The cool thing about Weffort s shades is that everything s fully customisable and made-to-order from the fabric and motors to casing styles, size, and the Smart Home platform you want to use with. With various options, it might sound complicated at first (usually people just let a pro handle it), but it s actually way easier than you think. Plus, the shades are lightweight, so you can totally install them by yourself. Custom-made shades Before we got the test unit from Weffort, they let us locate a good spot for installation and testing so that we could take measurements following the guide on their website, which also has tips on choosing materials, installation, measurements, [...] The post Weffort Outdoor Smart Shade Review with Home Assistant over Matter/Thread appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "upyOS modular MicroPython-based OS for microcontrollers works with ESP32, RP2040, etc ",
    "link": "https://www.cnx-software.com/2025/10/09/upyos-modular-micropython-based-os-for-microcontrollers-esp32-rp2040/",
    "summary": "upyOS is a modular, lightweight MicroPython-based operating system (OS) that provides a Unix-like experience on low-resource microcontrollers such as Espressif Systems ESP32/ESP32-C3/ESP32-S3, Raspberry Pi RP2040, and others. Inspired by smolOS, upyOS offers remote development tools, OTA updates, and a built-in web server. Its modular architecture separates system functions into reusable components, instead of large, monolithic programs. Key Features: Modular architecture: Commands and system functionality are broken down into small, independent modules to reduce memory usage. Built-in shell environment: Execute commands and scripts directly, providing a Unix-like CLI experience. Startup and shutdown scripting: Configure boot and shutdown behaviors using /etc/init.sh and /etc/end.sh. Recovery mode: A built-in failsafe mechanism lets users recover the system when booting fails. Background execution: Supports threads and asyncio for background tasks, along with & sufix, hold, resume, kill and killall commands for process control. Remote development support: Telnet and FTP servers allow file transfer and terminal access over [...] The post upyOS modular MicroPython-based OS for microcontrollers works with ESP32, RP2040, etc appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Ampetronic Auri is a Bluetooth Auracast audio system for public spaces",
    "link": "https://www.cnx-software.com/2025/10/08/ampetronic-auri-bluetooth-auracast-audio-system-for-public-spaces/",
    "summary": "Ampetronic, in partnership with Listen Technologies, has introduced Auri, a Bluetooth Auracast-powered audio system/assistive listening solution designed for public spaces. It is designed to deliver clear, wireless audio to any Auracast-enabled device or dedicated Auri receiver without the need for pairing. The Auri system consists of the TX2N transmitter, RX1 receiver, and D4/D16 docking stations, managed through Auri Manager software. The TX2N features a 100 m coverage with balanced mic/line inputs, PoE, Audio over IP, and optional Dante support. The RX1 receiver features dual 3.5 mm jacks, an OLED display, and low-latency audio output for earbuds, headphones, or hearing aids. Docking stations become useful for charging, configuration, and network-based management for multiple receivers. These features make this system suitable for corporate, education, entertainment, government, healthcare, transport, and hospitality environments. Auri Auracast system specifications: Auri RX1 audio receiver Audio Output 2x 3.5mm TRRS jacks for wired headphones or inductive neck loops [...] The post Ampetronic Auri is a Bluetooth Auracast audio system for public spaces appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Qualcomm acquires Arduino, introduces Arduino UNO Q  dual-brain  SBC",
    "link": "https://www.cnx-software.com/2025/10/07/qualcomm-acquires-arduino-introduces-arduino-uno-q-dual-brain-sbc/",
    "summary": "Qualcomm has just signed an agreement to acquire Arduino, and the goal of the purchase is to combine Qualcomm s leading-edge products and technologies with Arduino s vast ecosystem and community to empower businesses, students, entrepreneurs, tech professionals, educators, and enthusiasts to quickly and easily bring ideas to life. They also took the opportunity to launch the Arduino UNO Q dual-brain SBC powered by a Qualcomm DragonWing QRB2210 SoC running Linux and an STMicro STM32U585 MCU for real-time control, as well as the Arduino App Lab integrated development environment to unify the Arduino journey across Real time OS, Linux, Python, and AI flows . Will the acquisition change anything? I suppose we ll see more and more Arduino boards based on Qualcomm processors, but the company also promises to preserve Arduino s open approach and community: Arduino will retain its independent brand, tools, and mission, while continuing to support a wide range of microcontrollers and microprocessors [...] The post Qualcomm acquires Arduino, introduces Arduino UNO Q dual-brain SBC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Sub $7 CH32V317 board offers 10/100Mbps Ethernet, dual USB 2.0 Type-C, DVP interface",
    "link": "https://www.cnx-software.com/2025/10/07/sub-7-ch32v317-board-offers-10-100mbps-ethernet-dual-usb-2-0-type-c-dvp-interface/",
    "summary": "The nanoCH32V317 from MuseLab is a low-cost RISC-V development board designed for prototyping embedded systems and education. Built around the 144MHz WCH CH32V317WCU6 MCU. This development board is suitable for various embedded, IoT, prototyping, and automation projects. Other features of the development board include a USB 2.0 high-speed and full-speed controller, a 10/100Mbps Ethernet MAC with PHY, SDIO, and a DVP interface for digital video input, as well as advanced motor PWM timers for control applications. The board also includes an 8MHz main crystal and a 32.768KHz RTC crystal. For programming, it includes a dual USB Type-C interface, a USB ISP, as well as an SWD port. nanoCH32V317 board specifications: MCU WCH CH32V317WCU6 32-bit RISC-V core up to 144 MHz clock frequency USB 2.0 High-Speed (HS) and Full-Speed (FS) controllers Integrated Ethernet MAC + 10/100M PHY DVP interface, SDIO, and advanced motor PWM timer support Memory Up to [...] The post Sub $7 CH32V317 board offers 10/100Mbps Ethernet, dual USB 2.0 Type-C, DVP interface appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "wafer.space lets you design your custom silicon just for $7 per die (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/10/07/wafer-space-lets-you-design-your-custom-silicon-just-for-7-per-die/",
    "summary": "wafer.space has launched its first pooled silicon fabrication run on Crowd Supply, called the GF180MCU Run 1, which enables designers, engineers, and companies to create 1,000 custom ASICs using GlobalFoundries 180 nm mixed-signal process. Each slot provides a fixed 3.88 5.07 mm (19.67 mm ) die area replicated 1,000 times, meaning you will receive 1000 chips, with options for bare dies or chip-on-board packaging. The GF180MCU process supports 5 metal layers, MIM capacitors (~2.0 fF/ m ), poly and high-res poly resistors, and standard-Vt MOS devices. Users can handle their own pad ring, ESD, and I/O layout while wafer.space manages fabrication, dicing, and shipping from Singapore. Designs can be open or closed source, and full wafers are also available for advanced testing or collection. Designs are submitted to wafer.space as GDSII files (the standard file format for chip layouts). Wafer.space automatically checks these files to make sure they can be manufactured correctly. [...] The post wafer.space lets you design your custom silicon just for $7 per die (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "The latest Raspberry Pi OS images are now based on Debian 13  Trixie ",
    "link": "https://www.cnx-software.com/2025/10/06/raspberry-pi-os-debian-13-trixie/",
    "summary": "Since Debian 13 Trixie was released last August, it was just a matter of time until Raspberry Pi OS followed. Raspberry Pi announced the update from Bookworm to Trixie a few days ago. The new Raspberry Pi OS images get the new and updated packages from Debian 13, and features like 64-bit time support to solve the Y2K38 bug. However, as Simon Long, UX engineer at Raspberry Pi, points out, there have been fewer changes in newer versions of Debian, and most changes in the new version of Pi OS are cosmetic, although there are some interesting under-the-hood changes as well. The most obvious change from the user s perspective is the new theme featuring a completely new set of icons, a new font (Nunito Sans Light), new desktop backgrounds (the new default is a photo of the sun rising over the Drakensberg mountains in Lesotho), and some other small tweaks. [...] The post The latest Raspberry Pi OS images are now based on Debian 13 Trixie appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "1GHz Renesas RA8T2 Cortex-M85 MCUs feature MRAM and EtherCAT for industrial motor control",
    "link": "https://www.cnx-software.com/2025/10/06/1ghz-renesas-ra8t2-cortex-m85-mcus-feature-mram-and-ethercat-for-industrial-motor-control/",
    "summary": "Renesas has recently introduced the new RA8T2, an AI-powered motor control Cortex-M85 MCU that can be considered a direct upgrade to the RA8T1, which launched last year. The RA8T2 offers higher performance along with networking options for industrial, robotics, and other motor control systems. The RA8T2 features a 1GHz Arm Cortex-M85 core, an optional 250MHz Cortex-M33 core, up to 1MB MRAM and 2MB SRAM, a 300MHz PWM timer, dual 16-bit ADCs with simultaneous sampling, high-speed comparators, fast PWM shutdown, and more. Connectivity options include dual Gigabit Ethernet, EtherCAT slave, USB, CAN FD, I3C, and SPI, while security features include TrustZone and a cryptographic engine. Renesas RA8T2 key features and specifications: MCU core Arm Cortex-M85 up to 1 GHz (Armv8.1-M, TrustZone, FPU, MVE, ETM) Arm Cortex-M33 up to 250 MHz (Armv8-M, DSP, TrustZone, ETM) Memory & Storage Up to 1 MB MRAM 2 MB SRAM (with ECC) 256 KB TCM for [...] The post 1GHz Renesas RA8T2 Cortex-M85 MCUs feature MRAM and EtherCAT for industrial motor control appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Easily add 80+ Mbps Ethernet to microcontrollers with WIZ630io QSPI RJ45 module",
    "link": "https://www.cnx-software.com/2025/10/05/easily-add-80-mbps-ethernet-to-microcontrollers-with-wiz630io-qspi-rj45-module/",
    "summary": "WIZnet WIZ630io is a small module featuring an RJ45 jack and a W6300 controller supporting up to 80+ Mbps Ethernet over QSPI @ 150 MHz. As a reminder, the W6300 features 64KB of SRAM for 8 sockets, each with a 4KB TX/RX buffer by default. It is notably found in the WIZnet W6300-EVB-Pico2 development board powered by a Raspberry Pi RP2350 MCU. The WIZ630io allows you to easily add Ethernet to any RP2350 board or other microcontroller with a SPI or QSPI interface. WIZnet WIZ630io specifications: W6300 QSPI Ethernet controller Host Interface High-speed QSPI (MODE 0/3), system bus with 2 address signals & 8-bit data Internal 32KB SRAM for Tx/ Rx buffers (64KB in total) 8x independent sockets with 64KB Memory 10BaseT / 10BaseTe / 100BaseTX Ethernet PHY Integrated Auto negotiation (Full and half-duplex, 10 and 100-based) Auto-MDIX only on Auto-Negotiation Mode IP Fragmentation not supported Hardwired TCP/IP protocols [...] The post Easily add 80+ Mbps Ethernet to microcontrollers with WIZ630io QSPI RJ45 module appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "kv4p HT   Turn an Android smartphone into a ham radio transceiver",
    "link": "https://www.cnx-software.com/2025/10/04/kv4p-ht-turn-an-android-smartphone-into-an-ham-radio-transceiver/",
    "summary": "kv4p HT is an open-source hardware VHF or UHF radio designed to plug into the USB-C port of an Android smartphone and turn it into a handheld ham radio transceiver. It s based on an ESP32 wireless module and an SA818 radio module. This accessory makes your phone capable of off-grid voice and text communication with a Technician-class amateur radio license. It s small enough to fit into a pocket, partially because it does not need a battery, relying on the built-in battery of your phone. kv4p HT V2.0 specifications: Wireless module ESP32-WROOM-32E-N4 SoC ESP32 dual-core Tensilica LX6 microcontroller @ up to 240 MHz with 520KB SRAM Storage 4MB flash Wireless 2.4 GHz WiFi 4 and Bluetooth 4.2 BR/LE connectivity, built-in PCB antenna VHF Radio SA818-V radio module or DRA818V (134 174MHz) VHF low-pass filter SMA antenna connector Tx Power Up to 1 Watt for several [...] The post kv4p HT Turn an Android smartphone into a ham radio transceiver appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Linux-based Vega OS replaces Android-based Fire OS  in Amazon Fire TV Stick 4K Select",
    "link": "https://www.cnx-software.com/2025/10/03/linux-based-vega-os-replaces-android-based-fire-os-in-amazon-fire-tv-stick-4k-select/",
    "summary": "Amazon has recently introduced the Fire TV Stick 4K Select media streamer with a MediaTek MT8698 quad-core Cortex-A55 processor, 1GB RAM, 8GB eMMC flash, HDMI 2.1 video output, and WiFi 5 and Bluetooth 5.0 connectivity. However, the most interesting part of the announcement is the software, as Amazon has dropped the Android-based Fire OS used in its previous devices and instead relies on the new Linux-based Vega OS for the Fire TV Stick 4K Select. Amazon Fire TV Stick 4K Select (AFTCA002) specifications: SoC MediaTek MT8698 MCM CPU Quad-core Arm Cortex-A55 clocked up to 1.7 GHz GPU Mali G310v2 up to 500 MHz with OpenGL ES 3.1 support VPU (hardware video decoder) AV1 up to 3840x2160p (4K) @ 60 fps, 100 Mbps, 8-bit and 10-bit input with HDR10, HDR10+, and HLG H.265 (HEVC) up to 3840x2160p (4K) @ 60 fps, 35 Mbps, 8-bit and 10-bit input with [...] The post Linux-based Vega OS replaces Android-based Fire OS in Amazon Fire TV Stick 4K Select appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "M5Stack LLM-8850 card   An M.2 M-Key AI accelerator module based on Axera AX8850 24 TOPS SoC",
    "link": "https://www.cnx-software.com/2025/10/03/m5stack-llm-8850-card-an-m-2-m-key-ai-accelerator-module-based-on-axera-ax8850-24-tops-soc/",
    "summary": "M5Stack LLM 8850 card is an M.2 M-Key 2242 AI acceleration module powered by an Axera AX8850 SoC delivering 24 TOPS ( INT8) of performance, and suitable for host devices such as Raspberry Pi 5, Rockchip RK3588 SBCs, and even x86 PCs like mini PCs with a spare M.2 Key-M socket. The card ships with 8GB RAM, a 32Mbit SPI NOR flash, and also supports H.265/H.264 8Kp30 video encoding and 8Kp60 video decoding, with up to 16 channels for 1080p videos. It is also equipped with an active cooling system to maintain stable temperatures and prevent thermal degradation inside enclosures. M5Stack LLM 8850 card specifications: SoC Axera AX8850 CPU Octa-core Cortex A55 processor at 1.7 GHz NPU 24 TOPS @ INT8 VPU Video Encoder 8K @ 30 fps H.264/H.265 encoding, supports scaling / cropping Video Decoder 8K @ 60 fps H.264/H.265 decoding, supports 16 channels 1080p parallel decoding, supports scaling / cropping Memory 8GB 64 bit LPDDR4x @ 4266 Mbps Storage 32Mbit QSPI NOR [...] The post M5Stack LLM-8850 card An M.2 M-Key AI accelerator module based on Axera AX8850 24 TOPS SoC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Snapdragon X2 Elite Extreme and X2 Elite processors target high-end Windows PCs",
    "link": "https://www.cnx-software.com/2025/10/02/snapdragon-x2-elite-extreme-and-x2-elite-processors-target-high-end-windows-pcs/",
    "summary": "Qualcomm has recently announced the Snapdragon X2 Elite Extreme (X2E-96-100) and Snapdragon X2 Elite (X2E-88-100 and X2E-80-100) processors for Windows PCs, which the company claims are the Fastest and Most Efficient for laptops. All three 3nm parts are equipped with six Performance cores clocked at up to 3.6 GHz, six or twelve Premium cores clocked at up to 5 GHz (single core) or 4.4 GHz (multi-core), an Adreno X2-85 or X2-90 GPU, an 80 TOPS Hexagon NPU for Copilot+, and an LPDDR5x memory interface for up to 128+ GB memory with up to 228GB/s bandwidth. Other highlights include the Snapdragon X75 5G modem, FastConnect 7800 WiFi 7 and Bluetooth 5.4 chipset, 4K video resolution for built-in and external displays, USB4, PCIe Gen5 interfaces, and more. Let s check the full specifications and differences between the three Snapdragon X2 Elite devices in the table below. Qualcomm claims the Snapdragon X2 Elite Extreme [...] The post Snapdragon X2 Elite Extreme and X2 Elite processors target high-end Windows PCs appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "DDR4 supply/demand stress leads to Raspberry Pi CM4/CM5 price increases",
    "link": "https://www.cnx-software.com/2025/10/02/ddr4-supply-demand-stress-leads-to-raspberry-pi-cm4-cm5-price-increases/",
    "summary": "The price of DDR4 memory has increased dramatically in recent months due to limited supply and increased demand for AI workloads. The Raspberry Pi Compute Module 4 and 5 (CM4/CM5) are based on LPDDR4 memory, and Raspberry Pi reports that memory costs are roughly 120% higher than they were just a year ago. So they have no choice but to increase the price by $5 to $10 for the CM4 and CM5, as well as the Raspberry Pi 500 keyboard PC. I assume the $200 price tag for the Raspberry Pi 500+ mechanical keyboard PC released last week already includes this new reality. Product affected: 4GB Compute Module 4 and Compute Module 5 variants increase by $5 8GB Compute Module 4 and Compute Module 5 variants increase by $10 Raspberry Pi 500 unit-only increases by $10 to $100 Raspberry Pi Development Kit for Compute Module 5 increases by $5 to [...] The post DDR4 supply/demand stress leads to Raspberry Pi CM4/CM5 price increases appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "AAEON GENE-ARH6   A 3.5-inch subcompact industrial SBC with Intel Core Ultra 200H/U SoC",
    "link": "https://www.cnx-software.com/2025/10/01/aaeon-gene-arh6-a-3-5-inch-subcompact-industrial-sbc-with-intel-core-ultra-200h-u-soc/",
    "summary": "AAEON s GENE-ARH6 is a 3.5-inch subcompact industrial SBC built around the Intel Core Ultra 200H/U Arrow Lake processors, which delivers up to 96 TOPS AI power when equipped with an Intel Core Ultra 7 255H SoC. The board supports up to 96GB DDR5 memory, and multiple display outputs through HDMI 2.1, DP 2.0, LVDS, and eDP interfaces. Connectivity includes three Ethernet ports, four COM headers, GPIO, SMBus or I2C, and multiple USB ports. Expansion options include M.2 slots for 5G, Wi-Fi 6E CNVi, PCIe Gen4 storage with RAID 0 or 1, and an FPC2 connector for additional PCIe lanes. Other features include TPM 2.0 security, a watchdog timer, a 9V to 36V DC input, and a wide temperature range. Applications include robotics, inference-based safety monitoring, automation, and rugged industrial deployments with wide power input and connectivity options. AAEON GENE-ARH6 specifications: Arrow Lake SoC (one of the other) Intel Core Ultra 5 [...] The post AAEON GENE-ARH6 A 3.5-inch subcompact industrial SBC with Intel Core Ultra 200H/U SoC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ARIES MSRZG3E OSM-compliant SiP with Renesas RZ/G3E MPU targets industrial HMI and Edge AI",
    "link": "https://www.cnx-software.com/2025/10/01/aries-msrzg3e-osm-compliant-sip-with-renesas-rz-g3e-mpu-targets-industrial-hmi-and-edge-ai/",
    "summary": "ARIES Embedded MSRZG3E is an OSM-compliant system-in-package (SiP) built around the Renesas RZ/G3E MPU, designed for HMI, industrial, medical, and edge AI applications. The Renesas RZ/G3E SoC integrates a quad-core Arm Cortex-A55 CPU, a Cortex-M33 real-time core, and an Ethos-U55 NPU delivering up to 512 GOPS for AI power. Other features include PCIe Gen3, USB 3.2, dual Gigabit LAN, plus CAN FD, UART, I2C, SPI, and ADC. Multimedia support includes dual displays, MIPI-CSI camera input, and H.264/H.265 video codec. The SiP ships with 512 MB to 8 GB LPDDR4 RAM and 4 GB to 64 GB eMMC flash, with commercial and industrial-grade temperature support. MSRZG3E MSRZG3E SiP specifications: SoC Renesas RZ/G3E dual or quad Arm Cortex-A55, Arm Cortex-M33 core MCU Memory 512 MB to 8 GB LPDDR4 RAM Storage 4 GB to 64 GB eMMC NAND flash 2 Mbit to 512 Mbit SPI NOR flash 476-pad land grid [...] The post ARIES MSRZG3E OSM-compliant SiP with Renesas RZ/G3E MPU targets industrial HMI and Edge AI appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Fogwise AIRbox Q900   $599 Qualcomm IQ-9075 AI Box delivers up to 200 TOPS of AI performance",
    "link": "https://www.cnx-software.com/2025/09/30/fogwise-airbox-q900-599-qualcomm-iq-9075-ai-box-delivers-up-to-200-tops-of-ai-performance/",
    "summary": "Fogwise AIRBox Q900 AI box is an upgrade to the Fogwise Airbox powered by a Qualcomm IQ-9075 SoC with up to 200 TOPS (sparse) of AI performance, 36GB RAM, and 128GB UFS storage. Radxa says its new AI micro-server competes directly against the NVIDIA Jetson Orin NX 16GB, offering cheaper overall system cost, similar performance, and higher efficiency. Other benefits include Cortex-R52 real-time cores, 2.5GbE networking, and separate GPU, NPU, and DSP. Fogwise AIRBox Q900 specifications: SoC Qualcomm DragonWing IQ-9075 CPU Octa-core Kryo Gen 6 (Cortex-A78C-based) application cores @ up to 2.36 GHz Quad-ore Cortex-R52 real-time cores @ up to 1.85GHz GPU Adreno 663 GPU delivering up to 1.2 TFLOPS FP32 with secure GPU compute; supports Vulkan 1.2, OpenGL ES 3.2, OpenCL 2.0 FP, Adreno NN Direct VPU Adreno VPU 765 Video Decode AV1 / HEVC / H.265 / H.264 / VP9 / MPEG-2 1x 8Kp60 / [...] The post Fogwise AIRbox Q900 $599 Qualcomm IQ-9075 AI Box delivers up to 200 TOPS of AI performance appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Orange Pi AI Studio Pro   A Huawei Ascend 310 AI box with up to 352 TOPS, 192GB RAM",
    "link": "https://www.cnx-software.com/2025/09/30/orange-pi-ai-studio-pro-huawei-ascend-310-ai-mini-pc-with-up-to-352-tops-192gb-ram/",
    "summary": "Orange Pi AI Studio is a USB4 box designed for artificial intelligence applications, equipped with up to two Huawei Ascend 310 AI octa-core ARM 64-bit processors, delivering up to 176 TOPS per chip, as well as up to 192GB RAM. This follows the Orange Pi AIPro introduced last year, with an unnamed Huawei Ascend SoC delivering up to 20 TOPS NPU. The basic version of AI Studio has up to 96GB of LPDDR4X memory and 32MB of SPI Flash. The interface of the device is very simple, featuring a 12V 10A DC power interface, a USB 4.0 Type-C port, a power switch, and an indicator light. The only disadvantage is the limited number of ports provided, even do not include an HDMI port or an Ethernet port. Orange Pi AI Studio and AI Studio Pro specifications: SoC AI Studio Huawei Ascend 310 octa-core 64-bit processor delivering up to 176 TOPS AI [...] The post Orange Pi AI Studio Pro A Huawei Ascend 310 AI box with up to 352 TOPS, 192GB RAM appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Intel N97 mini-ITX motherboard targets industrial automation, digital signage, networking appliances",
    "link": "https://www.cnx-software.com/2025/09/30/intel-n97-mini-itx-motherboard-targets-industrial-automation-digital-signage-networking-appliances/",
    "summary": "The Jetway DMTX-ADN1 is a mini-ITX industrial motherboard built around the Intel N97 Alder Lake-N SoC with support for DDR5 memory, multiple displays, and a wide temperature range. It targets applications in industrial automation, kiosks, digital signage, and networking appliances. The motherboard supports up to 32GB DDR5 4800MHz memory, triple display setups via HDMI 2.0b, DP 1.4, and a 24-bit dual-channel LVDS/eDP interface, and offers a SATA III port and two M.2 M-Key sockets for NVMe or SATA drives. It also features an M.2 E-Key 2230 socket for wireless expansion with CNVi support, two Gigabit Ethernet ports, and a range of I/Os, including six COM ports, two USB 3.2, eight USB 2.0, 8-bit GPIO, SMBus, watchdog timer, and more. Jetway DMTX-ADN1 Specifications: SoC Intel Processor N97 quad-core Alder Lake N-series processor up to 3.4 GHz with Intel UHD graphics; 12W TDP System Memory DDR5 4800MHz via single Channel SO-DIMM, up to 32GB (up [...] The post Intel N97 mini-ITX motherboard targets industrial automation, digital signage, networking appliances appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Linux 6.17 release   Main changes, Arm, RISC-V, and MIPS architectures",
    "link": "https://www.cnx-software.com/2025/09/29/linux-6-17-release-main-changes-arm-risc-v-and-mips-architectures/",
    "summary": "Linux 6.17 has just been released on LKML: No huge surprises this past week, so here we are, with kernel 6.17 pushed out and ready to go. Below is the shortlog for just the last week not the full 6.17 release as usual. It s not exciting, which is all good. I think the biggest patch in there is some locking fixes for some bluetooth races that could cause use-after-free situations. Whee that s about as exciting as it gets. Other than that, there the usual driver fixlets (GPU and networking dominate as usual, but dominate is still pretty small), there s some minor random other driver updates, some filesystem noise, and core kernel and mm. And some selftest updates. This obviously means that the merge window for 6.18 will open tomorrow, and I already have four dozen pull requests pending. Thanks to the proactive people you know who [...] The post Linux 6.17 release Main changes, Arm, RISC-V, and MIPS architectures appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Olimex RP2350-PICO2 open hardware boards expose all 48 GPIOs for breadboard prototyping",
    "link": "https://www.cnx-software.com/2025/09/29/olimex-rp2350-pico2-open-hardware-boards-expose-all-48-gpios-for-breadboard-prototyping/",
    "summary": "Olimex RP2350-PICO2-BB48 and RP2350-PICO2-BB48R open hardware development boards are built around the Raspberry Pi RP2350B MCU, and expose all 48 GPIOs in a 0.6-inch dual-inline PCB layout. Compared to the earlier PICO2-XL and PICO2-XXL boards, this new board features a breadboard-friendly design with options for PSRAM and microSD on the BB48R version. Other features include USB-C power/data, BOOT and RESET buttons, a 2A 3.3V regulator, UEXT and Qwiic/Stemma connectors, status LED, and debug pads. With pre-soldered headers, it can be plugged directly into a breadboard, making it ideal for DIY projects, IoT, retro computing, and hardware prototyping. Olimex RP2350-PICO2-BB48 and RP2350-PICO2-BB48R specifications: MCU Microcontroller Raspberry Pi RP2350B CPU Dual-core Arm Cortex-M33 @ 150 MHz with Arm Trustzone, Secure boot OR Dual-core RISC-V Hazard3 @ 150 MHz Either two cores can be used. Memory 520 KB on-chip SRAM Package QFN-80 Memory 8 MB external QSPI PSRAM (only [...] The post Olimex RP2350-PICO2 open hardware boards expose all 48 GPIOs for breadboard prototyping appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "LUNYEE 4040 PRO CNC router review with Candle software",
    "link": "https://www.cnx-software.com/2025/09/28/lunyee-4040-pro-cnc-router-review-with-candle-software/",
    "summary": "LUNYEE has sent us a review sample of the 4040 PRO CNC router, featuring a larger work volume than the LUNYEE 3018 Pro Ultra model we reviewed a few months ago. It is designed for milling and engraving tasks that demand high precision and features a robust structure to support continuous operation. It works with wood, plastic, and acrylic. Its standout feature is the complete set of accessories, such as the Probe system for Z-axis setup and a workpiece clamping kit, allowing users to get started right away. This makes it an ideal CNC Router for beginners in engraving work. We ve previously reviewed the smaller 3018 Pro Ultra with Easel, but we ll instead use Candle software on the 4040 PRO machine. LUNYEE 4040 PRO CNC router specifications Controller 4-axis GRBL 1.1f-compatible controller based on GigaDevice GD32F303CCT6 Arm Cortex-M4 MCU @ 120MHz with 256KB flash, 48KB SRAM. Control Software [...] The post LUNYEE 4040 PRO CNC router review with Candle software appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Fing Agent Raspberry Pi Kit   An all-in-one Raspberry Pi 4-based network monitoring solution",
    "link": "https://www.cnx-software.com/2025/09/27/fing-agent-raspberry-pi-kit-an-all-in-one-raspberry-pi-4-based-network-monitoring-solution/",
    "summary": "Fing has recently introduced the Fing Agent Raspberry Pi Kit , also called Fing Agent plug-and-play Raspberry Pi 4 kit , for its Fing Agent network monitoring system, which can be considered a follow-up to the earlier Fingbox hardware released in 2017. While Fingbox was a custom appliance based on Ubuntu Core, the new kit uses a Raspberry Pi, making it easier to set up and use in a home or small office network. The kit includes a Raspberry Pi 4 Model B (2GB) in an aluminium case, a 32GB microSD card with Fing Agent preinstalled, a USB-C power supply with adapters, and a Cat 5e Ethernet cable. Once connected to the router, it works with the Fing app, desktop, or web to monitor devices, track uptime and speed, detect intrusions, and send alerts about unusual activity. It also supports device blocking, presence detection, and diagnostics, such as port scans and vulnerability checks. Making it [...] The post Fing Agent Raspberry Pi Kit An all-in-one Raspberry Pi 4-based network monitoring solution appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Nordic nRF54LM20A Cortex-M33 wireless MCU doubles the SRAM to 512 KB, increases flash capacity",
    "link": "https://www.cnx-software.com/2025/09/26/nordic-nrf54lm20a-cortex-m33-wireless-mcu-doubles-the-sram-to-512-kb-increases-flash-capacity/",
    "summary": "Nordic Semi s nRF54LM20A is a new Cortex-M33-based high-memory wireless MCU part of the nRF54L Series with double the SRAM and higher flash capacity compared ot the nRF54L15. It targets consumer, industrial, healthcare, and smart home applications, and is especially suitable for HID peripherals and gaming devices. The SoC integrates a 128 MHz Arm Cortex-M33 core with a RISC-V coprocessor, 2 MB NVM, and 512 KB RAM, alongside up to 66 GPIOs, high-speed USB, and Nordic s fourth-generation ultra-low-power 2.4 GHz radio supporting Bluetooth LE, Thread, Zigbee, Channel Sounding, and Matter. It offers twice the processing power, three times the efficiency, and up to 50% lower power consumption than the nRF52 Series. nRF54LM20A key specifications and comparison with other nRF54 Series SoCs: The nRF54LM20A comes in two packages: a CSP98 (3.9 x 3.7 mm) package for compact designs with 66 GPIOs, and a QFN52 (6 x 6 mm) package with 35 GPIO [...] The post Nordic nRF54LM20A Cortex-M33 wireless MCU doubles the SRAM to 512 KB, increases flash capacity appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Arduino cloud adds Bluetooth based provisioning, starting with UNO R4 WiFi",
    "link": "https://www.cnx-software.com/2025/09/26/arduino-cloud-adds-bluetooth-based-provisioning-starting-with-uno-r4-wifi/",
    "summary": "Arduino has recently introduced a new Bluetooth-based provisioning flow on the Arduino Cloud, starting with the UNO R4 WiFi board. This feature simplifies the initial setup process, making it faster and cable-free, and is aimed at improving ease of use for connected projects. With the Arduino IoT Cloud Remote app, users can power the board, detect it automatically, connect to Wi-Fi, and complete setup with visual feedback in just a few steps. Once provisioned, the board can be managed on Arduino Cloud with features like remote monitoring, OTA updates, real-time dashboards, AI Assistant support, and third-party integrations. The new flow is currently exclusive to the latest UNO R4 WiFi board, which also come with 3 months of free Arduino Cloud Maker Plan access. More boards will adopt the feature in future updates. Arduino Cloud features Compatible boards Initially available on Arduino UNO R4 WiFi (new stock only), more boards [...] The post Arduino cloud adds Bluetooth based provisioning, starting with UNO R4 WiFi appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "A Catalyst for Open Source: NextPCB Launches KiCad Projects Platform to Fuel the Future of KiCad (Sponsored)",
    "link": "https://www.cnx-software.com/2025/09/26/a-catalyst-for-open-source-nextpcb-launches-kicad-projects-platform-to-fuel-the-future-of-kicad/",
    "summary": "NextPCB, a global leader in PCB manufacturing and assembly solutions, proudly announces the launch of kicadprojects.com, a dynamic open-source community dedicated to supporting open-source hardware and enriching KiCad, the renowned open-source EDA tool for schematic capture and PCB layout. This initiative unites engineers, students, and innovators worldwide to share projects, collaborate, and support the KiCad community and core KiCad development. A Hub for Collaboration and Innovation Developed and maintained by NextPCB, a platinum KiCad sponsor, kicadprojects.com is more than a platform it s a thriving hub where the global KiCad community can: Share & Showcase Projects Upload and explore innovative PCB designs, schematics, and tutorials. Streamline Collaboration Download project files, generate automated BOMs, and visualize designs straight from your browser with NextPCB s KiCad EDA viewer. Open Source, Open Impact In a bold commitment to open-source stewardship, NextPCB will donate $10 (USD) towards the KiCad Project for every approved project uploaded [...] The post A Catalyst for Open Source: NextPCB Launches KiCad Projects Platform to Fuel the Future of KiCad (Sponsored) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Espressif s EchoEar ESP32-S3 voice-controlled AI chatbot runs esp-brookesia firmware",
    "link": "https://www.cnx-software.com/2025/09/26/espressif-echoear-esp32-s3-voice-controlled-ai-chatbot-with-circular-touchscreen-and-mic-array/",
    "summary": "Espressif Systems EchoEar is a compact ESP32-S3 AI chatbot designed for voice interaction and edge AI applications, for smart toys, voice-enabled speakers, and control systems. It features a 1.85-inch circular touch display, a dual microphone array with local wake-word detection, and support for large AI models from OpenAI, Xiaozhi AI, and Gemini. The kit is built around the ESP32-S3-WROOM-1 Wi-Fi 4 and Bluetooth 5 module, and also integrates a 3W speaker for audio interaction, and a microSD card slot for data storage. Other hardware features include a BMI270 IMU, a green LED, a USB-C port, a magnetic connector, and a battery management chip. Espressif EchoEar Specifications Wireless Module ESP32-S3-WROOM-1 SoC Espressif Systems ESP32-S3R8 CPU Dual-core Tensilica LX7 up to 240 MHz with vector extension for AI/ML workloads RAM 512KB SRAM, 8MB PSRAM ROM 284KB Wireless WiFi 4 and Bluetooth LE 5 Storage 16MB [...] The post Espressif s EchoEar ESP32-S3 voice-controlled AI chatbot runs esp-brookesia firmware appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Raspberry Pi 500+ mechanical keyboard PC gets 256 GB NVMe SSD, 16GB RAM, RGB LED lighting",
    "link": "https://www.cnx-software.com/2025/09/25/raspberry-pi-500-mechanical-keyboard-pc-gets-256-gb-nvme-ssd-16gb-ram-rgb-led-lighting/",
    "summary": "The Raspberry Pi 500+ is an upgrade to the Raspberry Pi 500 keyboard PC, getting a mechanical keyboard with RGB LED lighting, a 256GB NVMe SSD, and 16GB LPDDR4x memory. Apart from that, the rest of the ports and features are exactly the same for the new Plus model: two 4K-capable micro HDMI ports, Gigabit Ethernet, WiFi 5 and Bluetooth 5.0, three USB ports, a microSD card slot, and a 40-pin GPIO header. Raspberry Pi 500+ specifications: SoC Broadcom BCM2712 CPU Quad-core 64-bit Arm Cortex-A76 processor @ 2.4GHz GPU VideoCore VII GPU with support for OpenGL ES 3.1 graphics, Vulkan 1.2 VPU 4Kp60 HEVC decoder System Memory 16GB LPDDR4X-4267 SDRAM Storage 256 GB NVMe SSD preloaded with Raspberry Pi OS; connected to M.2 PCIe 2280 socket MicroSD card slot Video Output 2x micro HDMI ports up to 4Kp60 Networking Gigabit Ethernet RJ45 port Dual-band [...] The post Raspberry Pi 500+ mechanical keyboard PC gets 256 GB NVMe SSD, 16GB RAM, RGB LED lighting appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "5 Ways Embedded AI Processors are Revolutionizing Device Performance (Sponsored)",
    "link": "https://www.cnx-software.com/2025/09/25/5-ways-embedded-ai-processors-are-revolutionizing-device-performance/",
    "summary": "Artificial intelligence (AI) is moving from cloud-first architectures to edge-first designs, so more processing now runs on phones, cameras, and embedded controllers. Running inference on-device cuts latency and keeps sensitive data local. This momentum is reshaping product roadmaps, all due to different revolutions driven by edge AI. The Core Revolutions Driven by Edge AI Instead of routing every model and signal to the cloud, devices are processing more data locally to act faster and protect sensitive information. Because edge AI is changing where intelligence runs, IDC estimates global spending on edge computing reached about $261 billion in 2025. This rapid enterprise investment is due to several reasons. 1. Enabling Real-Time, On-Device Decisions Eliminating the cloud round-trip lets devices turn sensor input into action in milliseconds. This capability is essential for industrial automation and control loops because embedded AI processors run optimized models on-device, so decisions happen continuously. 2. Strengthening Privacy [...] The post 5 Ways Embedded AI Processors are Revolutionizing Device Performance (Sponsored) appeared first on CNX Software - Embedded Systems News ."
  }
]