[
  {
    "title": "Grab this $399 Bambu Lab P1S 3D printer, back down to a record-low price for the new year   save $300 on high-speed enclosed printer for beginners and enthusiasts alike",
    "link": "https://www.tomshardware.com/3d-printing/grab-this-usd399-bambu-lab-p1s-3d-printer-back-down-to-a-record-low-price-for-the-new-year-save-usd300-on-high-speed-enclosed-printer-for-beginners-and-enthusiasts-alike",
    "summary": "One of our favorite 3D printers, the Bambu Lab P1S, is back down to an all-time low price, and it can be yours for just $399.99."
  },
  {
    "title": "Intel's upcoming Arc B770 discrete GPU leaks out on GitHub, launch appears imminent   Reportedly featuring the BMG-G31 GPU, 16GB+ VRAM, 32 Xe2 cores, and 300W TDP",
    "link": "https://www.tomshardware.com/pc-components/gpus/intels-upcoming-arc-b770-discrete-gpu-leaks-out-on-github-launch-appears-imminent-reportedly-featuring-the-bmg-g31-gpu-16gb-vram-32-xe2-cores-and-300w-tdp",
    "summary": "Intel's elusive Arc B770 graphics card, the successor to the Arc A770 has been part of the rumor mill for what seems like forever now, but it's finally close to a release. New code on an Intel GitHub repository mentions \"b770\" specifically, suggesting the company has pushed out an update to add support for the GPU ahead of a timely CES launch."
  },
  {
    "title": "Samsung teases AI OLED Cassette and Turntable   display division stretches the feasible use cases for its latest tech at CES 2026",
    "link": "https://www.tomshardware.com/monitors/samsung-teases-ai-oled-cassette-and-turntable-display-division-stretches-the-feasible-use-cases-for-its-latest-tech-at-ces-2026",
    "summary": "Samsung is teasing some intriguing new OLED products, ready to showcase at CES 2026 over the next few days."
  },
  {
    "title": "Speed test pits six generations of Windows against each other   Windows 11 placed dead last across most benchmarks, 8.1 emerges as unexpected winner in this unscientific comparison",
    "link": "https://www.tomshardware.com/software/windows/speed-test-pits-six-generations-of-windows-against-each-other-windows-11-placed-dead-last-across-most-benchmarks-8-1-emerges-as-unexpected-winner-in-this-unscientific-comparison",
    "summary": "If you're a Windows 11 hater, sit back and enjoy your biases being validated in the most satisfying way possible. A new speed test shows Microsoft's latest OS performing terribly against the five previous Windows versions, placing last in most tests across the board."
  },
  {
    "title": "Blu-ray hits 20 years old, and it isn't dead yet   optical disc format was introduced to the public at CES 2006",
    "link": "https://www.tomshardware.com/pc-components/storage/blu-ray-hits-20-optical-disc-format-was-introduced-to-the-public-at-ces-2006",
    "summary": "20 years ago today, the CES in Las Vegas was buzzing with talk of Blu-ray technology, players, and media, and the format isn't dead yet."
  },
  {
    "title": "German retail supplier allegedly rationing RTX 5070 GPUs   more powerful Nvidia graphics cards are completely out of stock",
    "link": "https://www.tomshardware.com/pc-components/gpus/german-retail-supplier-allegedly-rationing-rtx-5070-gpus-more-powerful-nvidia-graphics-cards-are-completely-out-of-stock",
    "summary": "An alleged German retailer shared the email they received from their supplier, saying that RTX 5070 GPU deliveries will be limited to five units per model, while 5070 Ti models and up are totally unavailable."
  },
  {
    "title": "PC Fan Faceoff: Can Arctic's $7 P12 Pro compete with the $40 Noctua NF-A12x25 G2?",
    "link": "https://www.tomshardware.com/pc-components/case-fans/pc-fan-faceoff-can-arctics-usd7-p12-pro-compete-with-the-usd40-noctua-nf-a12x25-g2",
    "summary": "To kick off fan reviews, we're pinning the industry's finest against the industry's cheapest. David vs. Goliath. The most unfair fan head-to-head in history. Except... maybe not?"
  },
  {
    "title": "US Army tests 20,000W vehicle-mounted laser systems for drone defense   updated LOCUST device is now more lethal against drones",
    "link": "https://www.tomshardware.com/tech-industry/us-army-tests-20-000w-vehicle-mounted-laser-systems-for-drone-defense-updated-locust-device-is-now-more-lethal-against-drones",
    "summary": "The U.S. Army is now testing a more lethal 20kW vehicle mounted LOCUST laser weapon system from AeroVironment (AV) Inc."
  },
  {
    "title": "Microsoft silently kills Windows and Office phone activation and forces online activation with a Microsoft account   Windows users are now herded into an online-only portal for activation",
    "link": "https://www.tomshardware.com/software/windows/microsoft-silently-kills-windows-and-office-phone-activation-and-forces-online-activation-with-a-microsoft-account-windows-users-are-now-herded-into-an-online-only-portal-for-activation",
    "summary": "Microsoft has somehow put the cap on yet another way to circumvent its internet-powered setup process, and this time it's on a build that they haven't even supported for a while! Production activation via call is still listed in Microsoft's support docs, but a new YouTube video running Windows 7 shows it now redirects you to the online portal."
  },
  {
    "title": "Intel Arc B570 GPU kicks off new year at just $199   save $30 on one of the best budget GPUs around",
    "link": "https://www.tomshardware.com/pc-components/gpus/intel-arc-b570-gpu-kicks-off-new-year-at-just-usd199-save-usd30-on-one-of-the-best-budget-gpus-around",
    "summary": "Sparkle's Arc B570 Guardian OC dual-fan graphics card is on sale for 13%, bringing its price down to $199.99 on Amazon."
  },
  {
    "title": "MSI s RTX 5090 Lightning shatters GPU records before launch   40-phase VRAM and dual 12V-2x6 connectors turn heads on upcoming overclocking monster",
    "link": "https://www.tomshardware.com/pc-components/gpus/msis-rtx-5090-lightning-shatters-gpu-records-before-launch-40-phase-vram-and-dual-12v-2x6-connectors-turn-heads-on-upcoming-overclocking-monster",
    "summary": "Several benchmark records have appeared online, with users saying they're from the MSI RTX 5090 Lightning, which the company is expected to announce on January 5 at CES 2026."
  },
  {
    "title": "Gigabyte unleashes new DDR4 AM4 motherboards as RAM shortage continues to slam PC builders   sky-high DDR5 prices spark rush for affordable alternatives",
    "link": "https://www.tomshardware.com/pc-components/motherboards/gigabyte-unleashes-new-ddr4-am4-motherboards-as-ram-shortage-continues-to-slam-pc-builders-sky-high-ddr5-prices-spark-rush-for-affordable-alternatives",
    "summary": "Consumers are flocking back to AM4, which supports DDR4, as DDR5 prices continue to skyrocket. Gigabyte is taking advantage of the opportunity and has launched four new AM4 motherboard variants in Mini-ITX and Micro-ATX form factors."
  },
  {
    "title": "Corsair cancels $240 48GB DDR5 memory kit orders due to pricing error   company s blunder ignites shopper uproar over botched RAM deal",
    "link": "https://www.tomshardware.com/pc-components/ram/corsair-cancels-usd240-48gb-ddr5-memory-kit-orders-due-to-pricing-error-companys-blunder-ignites-shopper-uproar-over-botched-ram-deal",
    "summary": "Over the past few days, many customers purchased an incorrectly-priced kit of premium DDR5 memory from Corsair's webstore for just $240. Today, the company has cancelled all those orders, saying the memory is out of stock and that the pricing was a mistake. It's safe to say this decision has been met with fierce scrutiny."
  },
  {
    "title": "Corsair reverses course and honors gaming PC order after $700 price hike uproar   order was erroneously flagged, but the company sends a coupon to the buyer to snag the PC at the original price",
    "link": "https://www.tomshardware.com/desktops/gaming-pcs/corsair-reverses-course-and-honors-gaming-pc-order-after-usd700-price-hike-uproar-order-was-erroneously-flagged-but-the-company-sends-a-coupon-to-the-buyer-to-snag-the-pc-at-the-original-price",
    "summary": "A Redditor posted on r/Corsair to complain that the company canceled their order and hiked the price by $700 the following day. A Corsair rep then takes steps to clear the air and makes things right by giving the user a discount coupon to bring the cost back down to its sale price."
  },
  {
    "title": "Turtle Beach Burst II Pro Review: Ultra-light, 8K polling, and a little creaky",
    "link": "https://www.tomshardware.com/peripherals/gaming-mice/turtle-beach-burst-ii-pro-review-ultra-light-8k-polling-and-a-little-creaky",
    "summary": "Turtle Beach's Burst II Pro is an ultra-lightweight wireless mouse with 8K polling rates and a somewhat uniquely-placed DPI switch button."
  },
  {
    "title": "Plasma-powered solid-state laptop cooler to debut at CES   new cooler design uses ionized gas and electrical discharge to generate airflow",
    "link": "https://www.tomshardware.com/pc-components/cooling/yplasma-to-announce-solid-state-laptop-cooler-at-ces-2026-new-cooler-design-uses-plasma-and-corona-discharge-to-generate-airflow",
    "summary": "YPlasma has developed a new solid-state cooling solution that uses corona discharge to generate airflow without any moving parts. The new cooler will be on display at CES 2026 and will be presented with a live demo."
  },
  {
    "title": "Laser cutting and engraving from a software perspective   master your hardware and optimize your creative output with some software know-how",
    "link": "https://www.tomshardware.com/maker-stem/laser-cutting-and-engraving-from-a-software-perspective-master-your-hardware-and-optimize-your-creative-output-with-some-software-know-how",
    "summary": "We take a closer look at the software side of laser cutting and engraving."
  },
  {
    "title": "Samsung Display finally brings V-Stripe subpixel layout to QD-OLED   mass production of new 1,300-nit 34-inch ultrawide panel also boosts text clarity",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/samsung-display-finally-brings-v-stripe-subpixel-layout-to-qd-oled-mass-production-of-new-1-300-nit-34-ultrawide-panel-also-boosts-text-clarity",
    "summary": "QD-OLED monitors have historically faced text clarity issues due to their unorthodox subpixel layouts, which are a result of the way the OLED stack is layered. Samsung Display is finally fixing that with its first 34-inch ultrawide panel featuring a vertical stripe subpixel layout, similar to typical LCDs. This panel also breaks past 1,000 nits and peaks at 1,300 for the first time ever on a QD-OLED."
  },
  {
    "title": "Get a Steelseries Rival 3 Wireless mouse for just $25, or 34% off the regular price   potent rodent is simple and executes flawlessly",
    "link": "https://www.tomshardware.com/pc-components/get-a-steelseries-rival-3-wireless-mouse-for-just-usd25-or-34-percent-off-the-regular-price-potent-rodent-is-simple-and-executes-flawlessly",
    "summary": "Get a Steelseries Rival 3 Wireless mouse for just $25, or 34% off"
  },
  {
    "title": "Forgotten Star Wars Racer Revenge game is key to jailbreaking PlayStation 5, price soars 1,900% overnight amid leaked ROM keys exploit   Physical copies of the PS4 game go from $20 to $400 on eBay",
    "link": "https://www.tomshardware.com/video-games/playstation/forgotten-star-wars-racer-revenge-game-is-key-to-jailbreaking-playstation-5-price-soars-1-900-percent-overnight-amid-leaked-rom-keys-exploit-physical-copies-of-the-ps4-game-go-from-usd20-to-usd400-on-ebay",
    "summary": "News that Star Wars Racer Revenge is now essential for the latest PlayStation 5 jailbreaks has sent physical copy prices skyrocketing, sparking a frenzy among collectors and gamers alike."
  },
  {
    "title": "Micron secures $318 million Taiwanese subsidy for HBM R&D as AI memory arms race intensifies   three-year project aims to develop leading-edge, high-performance memory",
    "link": "https://www.tomshardware.com/tech-industry/micron-secures-318-million-taiwanese-subsidy-for-hbm-rd-as-ai-memory-arms-race-intensifies",
    "summary": "Micron has secured another major vote of confidence from the Taiwanese government, winning approval for an additional NT$4.7 billion (approximately $149 million) in subsidies to expand HBM research and development in Taiwan."
  },
  {
    "title": "Ukrainian soldier's M1 MacBook Air takes direct shrapnel hit, saving his life   screen cracked and letter 'K' missing but laptop remains functional",
    "link": "https://www.tomshardware.com/laptops/macbooks/ukrainian-soldiers-m1-macbook-air-takes-direct-shrapnel-hit-still-works-despite-battle-damage-screen-cracked-and-letter-k-missing-but-laptop-remains-functional",
    "summary": "An Apple M1 MacBook Air took a shell shrapnel hit and survived, with the laptop still working despite damage to the screen and the letter K on the keyboard missing."
  },
  {
    "title": "MSI teases new power supplies with 'instant protection' against melting RTX 5090 cables   promises to solve 12V-2x6 connector woes by monitoring individual wires",
    "link": "https://www.tomshardware.com/pc-components/power-supplies/msi-teases-new-power-supplies-with-instant-protection-against-melting-rtx-5090-cables-promises-to-solve-12v-2x6-connector-woes-by-monitoring-individual-wires",
    "summary": "Modern GPUs have a voracious appetite and the mighty Nvidia's RTX 5090 is no exception, often causing fiery outcomes. Many companies have tried to solve this issue, including MSI once before with its yellow-tipped connectors, but now it's back with two new power supplies that promise next-level safeguards against these melting GPUs."
  },
  {
    "title": "Debian maintainer criticizes email-managed bug tracker as outdated for modern development   there is a web interface for viewing, but email remains the only way to perform critical functions",
    "link": "https://www.tomshardware.com/tech-industry/debian-maintainer-criticizes-managed-bug-tracker-as-outdated-for-modern-development",
    "summary": "A dispute has flared up inside the Debian project after a senior maintainer criticized the distribution s bug tracking system as outdated and increasingly unworkable for modern software development."
  },
  {
    "title": "A deeper look at the tightened chipmaking supply chain, and where it may be headed in 2026   \"nobody's scaling up,  says analyst as industry remains conservative on capacity",
    "link": "https://www.tomshardware.com/tech-industry/a-deeper-look-at-the-tightened-chipmaking-supply-chain-and-where-it-may-be-headed-in-2026-nobodys-scaling-up-says-analyst-as-industry-remains-conservative-on-capacity",
    "summary": "We interview two industry analysts to gauge the current state of the chipmaking ecosystem, including constraints across the entire supply chain, and where it might be headed next."
  },
  {
    "title": "How to use Plex and a spare computer to build a streaming movie service",
    "link": "https://www.tomshardware.com/service-providers/streaming/how-to-use-plex-and-a-spare-computer-to-build-a-streaming-movie-service",
    "summary": "Build your own streaming service all from the comfort of your own home. You only need a spare PC and a few hours to serve media across your home."
  },
  {
    "title": "Reports of the previously-recalled Bambu Lab 3D printer being a fire hazard resurface, new power board component issue identified as the cause   Bambu says the A1's issue has been addressed, affected units replaced or repaired",
    "link": "https://www.tomshardware.com/3d-printing/reports-of-the-bambu-lab-3d-printer-being-a-fire-hazard-resurface-but-for-a-new-power-board-component-issue-bambu-says-the-a1s-new-issue-has-been-addressed-affected-units-replaced-or-repaired",
    "summary": "Users insist the A1 s AC board is flawed and should be recalled."
  },
  {
    "title": "LG says it s launching the world s lightest 17-inch RTX laptop   also announces 16-inch ultra-portable laptop with 'dual-AI' functionality",
    "link": "https://www.tomshardware.com/laptops/ultrabooks-ultraportables/lg-says-that-its-launching-the-worlds-lightest-17-inch-rtx-laptop-also-announces-16-inch-ultra-portable-laptop-with-dual-ai-functionality",
    "summary": "LG announced a 17-inch laptop that fits in the form factor of a 16-inch model while still sporting an RTX 5050 discrete GPU."
  },
  {
    "title": "Get 25% off a vibrant MSI 4K QD-OLED gaming monitor with blistering 240Hz refresh rate   now $772, panel offers 3-year burn-in warranty in new year offer",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/get-25-percent-off-a-vibrant-msi-4k-qd-oled-gaming-monitor-with-blistering-240hz-refresh-rate-now-usd772-panel-offers-3-year-burn-in-warranty-in-new-year-offer",
    "summary": "This big, beautiful 32-inch MSI MPG 321URX QD-OLED gaming monitor is on sale for just $772.99 right now, saving you 26% on its usual price."
  },
  {
    "title": "Patriot Viper PV593 4TB SSD Review   The Viper stays sleeping",
    "link": "https://www.tomshardware.com/video-games/xbox/patriot-viper-pv593-4tb-ssd-review",
    "summary": "The Patriot Viper PV593 is perfectly good on paper and delivers satisfactory marks but doesn t quite close the deal."
  },
  {
    "title": "AMD closes in on Intel in latest Steam Hardware Survey   RAM capacity continues to rise despite the ongoing memory crunch",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/amd-closes-in-on-intel-in-latest-steam-hardware-survey-ram-capacity-continues-to-rise-despite-the-ongoing-memory-crunch",
    "summary": "AMD is gaining on Intel, with user numbers jumping in the last month of 2025. Gamers are also quickly buying in 32GB of memory or more as the memory crisis is taking its hold."
  },
  {
    "title": "Dev uses Claude AI to write a  functional NES emulator    you can test it now, playing Donkey Kong in your browser",
    "link": "https://www.tomshardware.com/video-games/retro-gaming/dev-uses-claude-ai-to-write-a-functional-nes-emulator-you-can-test-it-now-playing-donkey-kong-in-your-browser",
    "summary": "A developer has succeeded in prompting Claude to write 'a functional NES emulator.'"
  },
  {
    "title": "LG's dual-mode 4K 240Hz / 1080p 480Hz OLED gaming monitor is 42% off   premium flagship panel with HDR1300 drops to its lowest-ever price",
    "link": "https://www.tomshardware.com/pc-components/lgs-dual-mode-4k-240hz-1080p-480hz-oled-gaming-monitor-is-42-percent-off-premium-flagship-panel-with-hdr1300-drops-to-its-lowest-ever-price",
    "summary": "If you've been looking for a truly high-end gaming monitor that doesn't cost over $1000, LG has got you covered with its 4K 240Hz dual-mode offering. The LG 32GX870A-B is a 32-inch beast that can boost to 480Hz at 1080p for a fluid gaming experience. It also comes with an HDR1300 rating thanks to its MLA+ panel, and has webOS, making it great for movies and TV."
  },
  {
    "title": "China's president Xi Jinping calls Taiwan reunification \"unstoppable\"   military drills around the island escalate in area and deployments",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/chinas-president-xi-jinping-calls-taiwan-reunification-unstoppable-military-drills-around-the-island-escalate-in-area-and-deployments",
    "summary": "China calls Taiwan reunification \"unstoppable\" as military drills proceed."
  },
  {
    "title": "Americans lost $333 million to Bitcoin ATM fraud in 2025   FBI says there is a  clear and constant rise  of this scam, and that it is  not slowing down ",
    "link": "https://www.tomshardware.com/tech-industry/cryptocurrency/americans-lost-usd333-million-to-bitcoin-atm-fraud-in-2025-fbi-says-there-is-a-clear-and-constant-rise-of-this-scam-and-that-it-is-not-slowing-down",
    "summary": "The FBI reported that Americans lost $333 million to scams via crypto ATMs, and that the number of victims constantly rose from 2020 to 2025."
  },
  {
    "title": "Chinese enthusiast overclocks AMD's Ryzen 7 9800X3D to 7.33GHz on Colorful X870E Vulcan motherboard   New world record achieved using liquid nitrogen cooling",
    "link": "https://www.tomshardware.com/pc-components/cpus/chinese-enthusiast-overclocks-amds-ryzen-7-9800x3d-to-7-33ghz-on-colorful-x870e-vulcan-motherboard-new-world-record-achieved-using-liquid-nitrogen-cooling",
    "summary": "A new record-high clock speed has been achieved on AMD's Ryzen 7 9800X3D. The best gaming CPU in the world doesn't need to be overclocked to achieve exceptional performance, but Chinese overclocker \"Hero\" has just pushed it to 7,335 MHz using a Colorful iGame X870E Vulcan motherboard, using liquid nitrogen."
  },
  {
    "title": "Nintendo's SNES cartridges get a USB-C adapter for playing, backing up, and validation   $59 SN Operator SNES-to-PC device supports Windows, macOS, and Linux, ships in April",
    "link": "https://www.tomshardware.com/video-games/retro-gaming/nintendos-snes-cartridges-get-a-usb-c-adapter-for-play-backing-up-and-validation-usd59-sn-operator-snes-to-pc-device-supports-windows-macos-and-linux-ships-in-april",
    "summary": "Epilogue just announced pre-orders for the SN Operator, a USB-C cartridge reader that lets you play and back up your SNES game library to your computer."
  },
  {
    "title": "U.S. allows TSMC to import chipmaking equipment to its China fabs   Samsung, SK hynix likewise receive go signal from Commerce Department",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/u-s-allows-tsmc-to-import-chipmaking-equipment-to-its-china-fabs-samsung-sk-hynix-likewise-receive-go-signal-from-commerce-department",
    "summary": "The U.S. Department of Commerce didn't renew the validated end-user status of these chipmakers, requiring them to acquire annual licenses to import chipmaking tools containing U.S. tech into their Chinese fabs."
  },
  {
    "title": "NES-a-like mini PC brings modern chips to the classic Nintendo case design   Ryzen AI 9 CPU, Radeon 890M iGPU should make it a decent all-round system",
    "link": "https://www.tomshardware.com/desktops/mini-pcs/nes-a-like-mini-pc-brings-modern-chips-to-the-classic-nintendo-case-design-ryzen-ai-9-cpu-radeon-890m-igpu-should-make-it-a-decent-all-round-system",
    "summary": "Mini PC with AMD Ryzen AI 9 HX 370 in NES-a-like case 'coming soon.'"
  },
  {
    "title": "PlayStation 5 ROM keys leaked   jailbreaking could be made easier with BootROM codes",
    "link": "https://www.tomshardware.com/video-games/playstation/playstation-5-rom-keys-leaked-jailbreaking-could-be-made-easier-with-bootrom-codes",
    "summary": "The PlayStation 5's ROM keys have allegedly been leaked. This breach could make it easier for hackers to jailbreak the system, but they still have to deal with other security features of the console."
  },
  {
    "title": "Better safety features make laser engravers more popular than ever - a guide to the ins and outs of laser engraving and cutting",
    "link": "https://www.tomshardware.com/maker-stem/better-safety-features-make-laser-engravers-more-popular-than-ever-a-guide-to-the-ins-and-outs-of-laser-engraving-and-cutting",
    "summary": "Upgraded safety systems make modern lasers easier to trust and easier to recommend."
  },
  {
    "title": "ID-Cooling FX360 LCD Review: Quiet, cool, and  why is this screen so small?",
    "link": "https://www.tomshardware.com/pc-components/liquid-cooling/id-cooling-fx360-lcd-review",
    "summary": "ID-Cooling upgraded its FX360 with an LCD screen for only $10 more, but how useful can a 1.48 screen be?"
  },
  {
    "title": "ARPANET standardized TCP/IP on this day in 1983   43-year-old standard set the foundations for today s Internet",
    "link": "https://www.tomshardware.com/networking/arpanet-standardized-tcp-ip-on-this-day-in-1983-43-year-old-standard-set-the-foundations-for-todays-internet",
    "summary": "On January 1, 1983, ARPANET system architects initiated the cutover from the existing NCP to TCP/IP on all hosts."
  },
  {
    "title": "ASRock to enter AIO liquid cooling market with an intriguing pumpless design at CES   full lineup to include more traditional options, some with LCD displays",
    "link": "https://www.tomshardware.com/pc-components/liquid-cooling/asrock-to-enter-aio-liquid-cooling-market-with-an-intriguing-pumpless-design-at-ces-full-lineup-to-include-more-traditional-options-some-with-lcd-displays",
    "summary": "ASRock, usually known for producing motherboards, is set to debut its own AIOs at CES 2026, including flagship models featuring LCD screens. It's unclear if ASRock is licensing Asetek's pump designs, and whether it will compete against affordable brands like Thermalright."
  },
  {
    "title": "Huawei s Ascend and Kunpeng progress shows how China is rebuilding an AI compute stack under sanctions",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/huaweis-ascend-and-kunpeng-progress-shows-how-china-is-rebuilding-an-ai-compute-stack-under-sanctions",
    "summary": "Huawei used its New Year message to highlight progress across its Ascend AI and Kunpeng CPU ecosystems, pointing to the rollout of Atlas 900 supernodes and rapid growth in domestic developer adoption as a solid foundation for computing."
  },
  {
    "title": "Finnish authorities seize ship and crew after undersea cable cut, pursuing criminal charges   Finnish special forces board ship, detain all 14 crewmembers",
    "link": "https://www.tomshardware.com/peripherals/cables-connectors/finnish-authorities-seize-ship-and-crew-after-undersea-cable-cut-pursuing-criminal-charges-finnish-special-forces-board-ship-detain-all-14-crewmembers",
    "summary": "Cables and pipelines in the Gulf of Finland have been damaged four times in less than 1.5 years."
  },
  {
    "title": "Logitech's legendary G502 Hero gaming mouse plummets to an irresistible $15.99   free $20 gift card slashes best-selling mouse to its lowest ever price",
    "link": "https://www.tomshardware.com/peripherals/gaming-mice/logitechs-legendary-g502-hero-gaming-mouse-plummets-to-an-irresistible-usd15-99-free-usd20-gift-card-slashes-best-selling-mouse-to-its-lowest-ever-price",
    "summary": "Target is offering the Logitech G502 Hero for $35.99 with a complimentary $20 gift card effectively bringing your cost down to just $15.99 for this top-rated gaming mouse."
  },
  {
    "title": "UK company shoots a 1,000-degree furnace into space to study off-world chip manufacturing   semiconductors made in space could be 'up to 4,000 times purer' than Earthly equivalents",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/uk-company-shoots-a-1000-degree-furnace-into-space-to-study-off-world-chip-manufacturing-semiconductors-made-in-space-could-be-up-to-4-000-times-purer-than-earthly-equivalents",
    "summary": "British startup Space Forge has just successfully turned on its first in-orbit furnace, reaching 1,000 degrees Celsius in space. This is a crucial first step for the company in studying the feasibility of manufacturing chips in space."
  },
  {
    "title": "Musk to expand xAI's training capacity to a monstrous 2 gigawatts with third building at Memphis site    announcement comes days after Musk vows to have 'more AI compute than everyone else'",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/musk-purchases-third-building-at-memphis-site-to-expand-xais-training-capacity-to-a-monstrous-2-gigawatts-announcement-comes-days-after-musk-vows-to-have-more-ai-compute-than-everyone-else",
    "summary": "Elon Musk has announced that xAI has purchased a third building at its Memphis, Tennessee site to bolster the company's overall compute power to a gargantuan two gigawatts."
  },
  {
    "title": "Nvidia's CUDA Tile examined: AI giant releases programming style for Rubin, Feynman, and beyond   tensor-native execution model lays the foundation for Blackwell and beyond",
    "link": "https://www.tomshardware.com/pc-components/gpus/nvidias-cuda-tile-examined-ai-giant-releases-programming-style-for-rubin-feynman-and-beyond-tensor-native-execution-model-lays-the-foundation-for-blackwell-and-beyond",
    "summary": "Nvidia's CUDA 13.1 introduces CUDA Tile, a new tile-centric programming path that elevates GPU kernel development above SIMT. The innovation aligns CUDA with the tensor-native execution model of Blackwell-class GPUs, and lays the software foundation for future architectures built around increasingly specialized compute and data-movement engines rather than thread-level parallelism."
  },
  {
    "title": "GL.iNet Comet 5G   A KVM over IP solution with 5G RedCap Cellular connectivity, 3.69-inch touchscreen display",
    "link": "https://www.cnx-software.com/2026/01/05/gl-inet-comet-5g-a-kvm-over-ip-solution-with-5g-redcap-cellular-connectivity-3-69-inch-touchscreen-display/",
    "summary": "GL.inet Comet 5G (GL-RM10RC) is an upcoming KVM over IP solution with a 3.69-inch touchscreen display and 5G RedCap (Reduced Capacity) IoT cellular connectivity, enabling remote access even when your regular Internet connection is down. The design builds upon the GL.iNet Comet Pro introduced last year, featuring a larger design and display, and adding 5G cellular connectivity on top of WiFi 6 and Gigabit Ethernet. It still features HDMI input and output (loop) ports, two USB Type-C ports for power and keyboard/mouse emulation, and a USB 2.0 port for accessories like ATX power control or fingerbot for the control of physical buttons on the target. GL.iNet Comet 5G specifications: SoC Quad-core Cortex-A53 CPU @ 1.5 GHz; potentially a Rockchip RV1126B SoC System Memory 1GB DDR3L Storage 64 GB eMMC flash Video & Audio Input HDMI port up to 4K @ 30 FPS Output HDMI loop/passthrough [...] The post GL.iNet Comet 5G A KVM over IP solution with 5G RedCap Cellular connectivity, 3.69-inch touchscreen display appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Openterface KVM-GO   An ultra-compact KVM-over-USB solution with HDMI, DP, or VGA video input",
    "link": "https://www.cnx-software.com/2026/01/05/openterface-kvm-go-an-ultra-compact-kvm-over-usb-solution-with-hdmi-dp-or-vga-video-input/",
    "summary": "Small enough to fit on a keychain, Openterface KVM-GO is a tiny, open-source hardware KVM-over-USB gadget available with an HDMI, DisplayPort (DP), or VGA connector and is designed for headless device troubleshooting and remote server monitoring. It follows the company s earlier Mini-KVM KVM-over-USB device introduced in 2024 with HDMI and audio inputs. The new KVM-GO is more versatile with an HDMI, DP, or VGA connector, and does not require any video cable since it s designed to be connected directly to the target device. It also adds a microSD card slot for easy OS installation. Openterface KVM-GO specifications: Microcontroller WCH CH32V208 RISC-V MCU @ up to 144 MHz with Bluetooth LE, USB 2.0 Storage MicroSD card for remote OS installation and file transfers Control method KVM-over-USB Video capture Up to 4K @ 60 Hz Input port HDMI, DisplayPort, or VGA, depending on model (direct connection to target, [...] The post Openterface KVM-GO An ultra-compact KVM-over-USB solution with HDMI, DP, or VGA video input appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Allwinner V861 dual-core 64-bit RISC-V AI Camera SiP features 128MB DDR3L, 4K H.265/H.264 video encoder",
    "link": "https://www.cnx-software.com/2026/01/04/allwinner-v861-dual-core-64-bit-risc-v-ai-camera-sip-features-128mb-ddr3l-4k-h-265-h-264-video-encoder/",
    "summary": "Allwinner V861 is a new dual-core 32-bit/64-bit RISC-V C907 system-in-package (SiP) with 128MB on-chip DDR3L and designed for 4K AI camera applications with a 1 TOPS AI NPU. The chip also features a 32-bit RISC-V E907 low-power core, a 4Kp25 H.264/H.265 video encoder, a 1080p60 JPEG video decoder and encoder, MIPI CSI and parallel camera interfaces, audio codec with input and output interfaces, Fast Ethernet, USB 2.0, and a range of digital and analog I/Os. Allwinner V861M3-XXX specifications: CPU Dual-Core RISC-V XuanTie C907 (RV64GCBV/RV32GGCBV) clocked up to 1.4GHz with RVV 1.0 extensions Single-core RISC-V XuanTie E907 (RV32IMAFC) clocked up to 800MHz VPU Video Encoder H.264/H.265 up to 4K @ 25fps (M)JPEG up to 8192 8192 Video Decoder (M)JPEG up to 1080p60 AI accelerator 1 TOPS (INT8) NPU dubbed AI-ISP 2.0 Memory 128MB DDR3/DDR3L (SiP) SQPI PSRAM interface Storage QSPI flash eMMC 4.41 SDIO 2.0/3.0 Display SPI interface Camera [...] The post Allwinner V861 dual-core 64-bit RISC-V AI Camera SiP features 128MB DDR3L, 4K H.265/H.264 video encoder appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "WCH CH32H417 dual-core RISC-V MCU offers USB 3.0, 500MB/s UHSIF, and Fast Ethernet interfaces",
    "link": "https://www.cnx-software.com/2026/01/03/wch-ch32h417-dual-core-risc-v-mcu-offers-usb-3-0-500mb-s-uhsif-and-fast-ethernet-interfaces/",
    "summary": "WCH CH32H417 is a high-performance dual-core RISC-V microcontroller clocked at up to 400 MHz with up to 960 KB flash, 896KB SRAM, and a range of interfaces, including a 5 Gbps USB 3.0 Host/Device SuperSpeed interface. Other notable features include a 500MB/s UHSIF (Universal High Speed Interface), 10/100Mbps Ethernet MAC and PHY, a SerDes high-speed isolated transceiver, a USB 2.0 High-Speed Host/Device, a USB 2.0 OTG Full Speed, USB PD support, and Display and Camera interfaces. The CH32H417 also offers the usual low-speed I/Os (95x GPIO, SPI ) and analog inputs and outputs (ADC/DAC). WCH CH32H417 CH32H417 specifications: Cores (Coremark: 5.73/MHz) QingKe RISC-V5F up to 400 MHz QinKe RISC-V3F up to 144 MHz GPU Graphics Processing Hardware Accelerator GPHA Memory 896KB SRAM Storage 960KB Flash 200MHz dual-edge SD/EMMC controller (SDMMC) SDIO master/slave interface with support for SD/SDIO/MMC Flexible Storage Controller FMC Display DCT-TFT Display Controller LTDC Camera I/F [...] The post WCH CH32H417 dual-core RISC-V MCU offers USB 3.0, 500MB/s UHSIF, and Fast Ethernet interfaces appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Cincoze MD-3000 is a scalable DIN-Rail computer with up to 14th Gen 24-core Intel Core i9-14900 CPU",
    "link": "https://www.cnx-software.com/2026/01/02/cincoze-md-3000-scalable-din-rail-computer-with-up-to-14th-gen-24-core-intel-core-i9-14900-cpu/",
    "summary": "Cincoze MD-3000 is a high-performance, scalable DIN-Rail computer powered by a 12th, 13th, or 14th Gen Intel processor and designed to be expanded with up to six modules through the company s Scalable Expansion Deck (SED) connected to the computer s PCIe x16 slot. Based on an up to a 14th Gen 24-core Intel Core i9-14900 Raptor Lake-S Refresh CPU, the MD-3000 supports up to 96GB DDR5 SO-DIMM memory with optional ECC, up to two M.2 NVMe SSDs, and a 2.5-inch SATA bay, and is equipped with two 4K-capable DisplayPort connectors, five Gigabit Ethernet ports, four USB 3.2 ports, an RS232/RS485 DB9 connector and more. It mainly targets vision-driven smart manufacturing applications. Cincoze MD-3000 specifications: SoC (One or the other) 14th Generation Intel Raptor Lake-S Refresh Series 35W Intel Processor 300T dual-core CPU @ 3.4 GHz, up to 65W Intel Core i9-14900 24-core CPU @ 5.8 GHz; 20 SKUs available 13th [...] The post Cincoze MD-3000 is a scalable DIN-Rail computer with up to 14th Gen 24-core Intel Core i9-14900 CPU appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Year 2025 in Review, CNX Software stats, and looking ahead to 2026",
    "link": "https://www.cnx-software.com/2025/12/31/year-2025-in-review-cnx-software-stats-and-looking-ahead-to-2026/",
    "summary": "Time for the last post of 2025, as the year is almost over. I ll look back at key developments and notable products launched in 2025, share some CNX Software website traffic statistics, and look ahead to 2026. Year 2025 in Review After 22 product releases in 2024, Raspberry Pi calmed down a little bit in 2025, and the highlights of the year included the Raspberry Pi 500+ mechanical keyboard, the 5-inch variant of the Raspberry Pi Touch Display 2, and a Raspberry Pi 5 1GB RAM. What didn t quite stop were the accessories from third parties for Raspberry Pi SBC and Raspberry Pi Pico boards. The most exciting Arm SoC release of 2025 was probably the 12-core CIX P1 Armv9 SoC found in Radxa Orion O6 SBC, MINISFORUM MS-R1 Arm mini PC, and Orange Pi 6 Plus board, but while performance was fine, it was overhyped in 2024, and software [...] The post Year 2025 in Review, CNX Software stats, and looking ahead to 2026 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "VisionFive 2 Lite SBC Review   Ubuntu 24.04 on a low-cost RISC-V SBC in 2026",
    "link": "https://www.cnx-software.com/2025/12/31/visionfive-2-lite-sbc-review-ubuntu-24-04-on-a-low-cost-risc-v-sbc-in-2026/",
    "summary": "StarFive has sent me a sample of the VisionFive 2 Lite RISC-V SBC for review. It s a low-cost credit card-sized board based on the StarFive JH7110S quad-core RISC-V SBC and designed to get started with Linux RISC-V on the cheap. When I first tested the earlier VisionFive 2 SBC with a StarFive JH7110 RISC-V SoC in February 2023, I didn t call it a review, but rather a hands-on experience, since, at the time, many features still didn t work properly. Almost three years have passed since then, so reviewing the VisionFive 2 Lite SBC with Ubuntu 24.04 will allow us to see how much progress has been made on the software side. If you are in a rush, you can jump to the what works, what doesn t section. VisionFive 2 Lite unboxing I received the board in a plastic box with a cover reading VisionFive 2 Lite Your Gateway to RISC-V . [...] The post VisionFive 2 Lite SBC Review Ubuntu 24.04 on a low-cost RISC-V SBC in 2026 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "DFRobot HUSKYLENS 2 AI camera review   From built-in AI samples to training a custom model to detect elephants",
    "link": "https://www.cnx-software.com/2025/12/31/dfrobot-huskylens-2-ai-camera-review-from-built-in-ai-samples-to-training-a-custom-model-to-detect-elephants/",
    "summary": "Hello, today I am going to review the HUSKYLENS 2, released in October 2025. It is the next generation of HUSKYLENS, an AI vision sensor equipped with a Kendryte K230 dual-core RISC-V SoC with a 6 TOPS AI accelerator and a 2.4-inch IPS touchscreen. The device runs machine vision algorithms fully on-device, providing fast and low-latency performance, and includes more than 15 built-in AI models. HUSKYLENS 2 also supports deploying custom-trained models, including integration with Large Language Models (LLMs) via a Model Context Protocol (MCP) service. In addition, it is compatible with various microcontrollers, such as Arduino and Raspberry Pi, through UART or I2C communication interfaces. HUSKYLENS 2 unboxing The manufacturer sent the HUSKYLENS 2 module and the Microscope Lens separately. Both parcels were shipped from Chengdu, China, and arrived at my office in Chanthaburi, Thailand, in about one week. The parcels were packed in standard cardboard boxes and arrived [...] The post DFRobot HUSKYLENS 2 AI camera review From built-in AI samples to training a custom model to detect elephants appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Add four Gigabit or 2.5Gbps Ethernet ports to the Raspberry Pi 5 with this expansion board",
    "link": "https://www.cnx-software.com/2025/12/30/add-four-gigabit-or-2-5gbps-ethernet-ports-to-the-raspberry-pi-5-with-this-expansion-board/",
    "summary": "Waveshare PCIE TO 4-CH Gigabit/2.5G ETH Board (B) is a 4-port Gigabit or 2.5 Gbps Ethernet board designed for the Raspberry Pi 5. This board connects four RJ45 ports to the Pi s 16-pin PCIe interface and also includes a mounting option for the Pi5 Connector Adapter (C). The only limiting factor is the Pi s PCIe Gen2/Gen3 x1 interface, as the 2.5GbE ports share the available bandwidth and cannot operate at full speed simultaneously. The Gigabit Ethernet variant features Realtek RTL8153 USB to Ethernet controllers, while the 2.5GbE variant relies on RTL8156 controllers, and both integrate a VL805 PCIe to USB bridge chip. The board also includes status LEDs for link and activity indication, and draws power directly from the PCIe interface without requiring an external power supply. The device is plug-and-play and supports Raspberry Pi OS out of the box with no additional drivers required. Applications include routers, firewalls, network [...] The post Add four Gigabit or 2.5Gbps Ethernet ports to the Raspberry Pi 5 with this expansion board appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Rockchip RK1820/RK1828 SO-DIMM and M.2 LLM/VLM AI accelerator modules, devkits, and benchmarks",
    "link": "https://www.cnx-software.com/2025/12/30/rockchip-rk1820-rk1828-so-dimm-and-m-2-llm-vlm-ai-accelerator-modules-devkits-and-benchmarks/",
    "summary": "Rockchip unveiled two RK182X LLM/VLM accelerators at its developer conference last July, namely the RK1820 with 2.5GB RAM for 3B parameter models, and the RK1828 with 5GB RAM for 7B parameter models. A few months have passed, and we have a few more details since a development kit based on Rockchip RK1820/RK1828 SO-DIMM module is now available, some basic documentation has been released, and the RK1828 has been benchmarked against the Rockchip RK3588 s NPU. I was also told that M.2 modules are coming soon. Firefly RK182X 3D RAM Stacking Development Kit The RK182X 3D RAM Stacking Development Kit is based on the AIO-GS1N2 carrier board, previously offered with a Rockchip RK3576 or RK3588(s) and with a NVIDIA Jetson Orin Nano or NX AI module. Specifications: Main module (now only RK3588 variant for sale as part of the RK182x kit) Core-3588JD4 Rockchip RK3588 with 6 TOPS NPU, 4GB to 32GB [...] The post Rockchip RK1820/RK1828 SO-DIMM and M.2 LLM/VLM AI accelerator modules, devkits, and benchmarks appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Elecrow AI starter kit turns NVIDIA Jetson Orin Nano into a learning platform with 11.6-inch display, 30 electronics modules",
    "link": "https://www.cnx-software.com/2025/12/30/elecrow-ai-starter-kit-turns-nvidia-jetson-orin-nano-into-a-learning-platform-with-11-6-inch-display-30-electronics-modules/",
    "summary": "Elecrow AI Starter Kit for the NVIDIA Jetson Orin Nano turns the NVIDIA Jetson Orin Nano into a learning and educational kit for students, educators, and hardware enthusiasts looking for a rapid and powerful prototyping platform. The kit integrates an 11.6-inch IPS touchscreen, an 8MP servo-controlled gimbal camera, a voice interaction module, and 30 common electronics modules embedded in the kit. The company also provides 39 Python tutorials for sensor control, computer vision, and basic AI workflows. In addition to the display, camera, and audio features, the kit also includes expansion through I2C, UART, and GPIO. Jetson Orin Nano AI Starter Kit specifications: Main Board NVIDIA Jetson Orin Nano (Not included in the kit) Display 11.6-inch IPS touchscreen display with 1366 768 resolution Onboard modules Input modules Multimedia 8MP IMX219-based camera with dual-servo gimbal (PTZ-style control) Sensors Temperature & humidity sensor Ultrasonic distance sensor PIR motion [...] The post Elecrow AI starter kit turns NVIDIA Jetson Orin Nano into a learning platform with 11.6-inch display, 30 electronics modules appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Open-source hardware USB to GPIB adapter connects legacy GPIB/IEEE-488 instruments to modern hosts",
    "link": "https://www.cnx-software.com/2025/12/29/open-source-hardware-usb-to-gpib-adapter-connects-legacy-gpib-ieee-488-instruments-to-modern-hosts/",
    "summary": "XyphroLabs s UsbGpib is an open-source hardware, inexpensive, and portable USB to GPIB adapter aiming to provide access to legacy GPIB/IEEE-488 instruments using contemporary hardware and software, with a focus on accessibility, openness, and ease of integration into current workflows . Initially developed by Hewlett-Packard in the late 1960s/early 1970s, GPIB (General Purpose Interface Bus), also known as IEEE-488 or initially HP-IB (Hewlett-Packard Interface Bus), is a short-range digital communications bus standard designed for connecting and controlling programmable electronic test and measurement instruments such as oscilloscopes, multimeters, and power supplies to computers or controllers. The UsbGpib project helps connect GBIP-compliant equipment to modern host computers with a USB port. UsbGpib key hardware features and specifications: Microcontroller Microchip ATMega32U4 8-bit AVR microcontroller for 5V I/O compatibility USB USB Type-C port with full USBTMC (USB Test and Measurement Class) support 24-pin GPIB interface Fully IEEE-488.1 and IEEE-488.2 enabled, including service request [...] The post Open-source hardware USB to GPIB adapter connects legacy GPIB/IEEE-488 instruments to modern hosts appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "LoRa, BLE, and GNSS tracker supports open-source software, solar charging, outdoor and indoor tracking",
    "link": "https://www.cnx-software.com/2025/12/29/ruictec-td04-low-maintance-lora-ble-and-gnss-vehicle-tracker-supports-open-source-software-solar-charging/",
    "summary": "Designed by Ruictec in China, the TD04 is a LoRa-based low-power tracker that also features BLE and dual-band GNSS. It supports both indoor and outdoor positioning, and is suitable for fleet management, asset tracking, and geofencing over public or private LoRaWAN networks with minimal maintenance. The device combines GNSS (L1/L5) for outdoor positioning with BLE-based indoor tracking. It automatically switches between the two to optimize accuracy and power usage, delivering around 1 2 m accuracy outdoors and 2 4 m indoors. It is LoRaWAN 1.0.3-compliant, supports OTAA and ABP, and operates across multiple regional bands (EU868, US915, IN865, AS923, and others). Other features include a built-in motion sensor (G-sensor), configurable reporting and heartbeat intervals, iBeacon support, optional Bluetooth gateway mode, BLE-based configuration, OTA updates, and batch firmware upgrades. The device is powered by a 6000 mAh rechargeable battery and support 1.3 W solar panel input, enabling up to six months of standby [...] The post LoRa, BLE, and GNSS tracker supports open-source software, solar charging, outdoor and indoor tracking appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Rockchip RK628D based HDMI-to-MIPI-CSI board converts HDMI video into camera feed for embedded systems",
    "link": "https://www.cnx-software.com/2025/12/29/rockchip-rk628d-based-hdmi-to-mipi-csi-board-converts-hdmi-video-into-camera-feed-for-embedded-systems/",
    "summary": "The Firefly HDMI-to-MIPI-CSI converter board converts an HDMI video and audio source into a MIPI-CSI camera stream for supported Rockchip SoCs, which is the complete opposite of the Olimex MIPI-HDMI adapter that converts MIPI DSI display signals to HDMI output. Built around the Rockchip RK628D video bridge chip, the board supports HDMI 1.4/2.0 input with 8-bit and 10-bit video, RGB888 and YUV420 color formats, and resolutions up to 4K @ 60fps. On the output side, it provides a MIPI-CSI interface compliant with MIPI D-PHY v1.2, with video output in YUV422 color format, supporting resolutions up to 4K @ 30fps. Audio output is available through a 3.5 mm headphone jack and onboard pin headers, making the board suitable for HDMI capture, smart display, micro-projector, and embedded video conversion applications. Firefly HDMI-to-MIPI-CSI board Specifications: Main Chip Rockchip RK628D HDMI-to-MIPI CSI-2 converter Input HDMI 1.4 / HDMI 2.0 compliant 8-bit and 10-bit [...] The post Rockchip RK628D based HDMI-to-MIPI-CSI board converts HDMI video into camera feed for embedded systems appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Forlinx FET1126Bx-S low-power Rockchip RV1126BJ industrial SoM powers SBC with 40-pin GPIO header",
    "link": "https://www.cnx-software.com/2025/12/29/forlinx-fet1126bx-s-low-power-rockchip-rv1126bj-industrial-som-powers-sbc-with-40-pin-gpio-header/",
    "summary": "Forlinx has recently released the FET1126Bx-S, a low-power SoM, which is based on the Rockchip RV1126B (commercial) or RV1126BJ (industrial) SoC. Designed for edge AI applications, the module is suitable for smart cameras, AIoT gateways, and intelligent monitoring systems where local video analytics, low power consumption, and long-term stability are required. It is easy to confuse the newer RV1126B/RV1126BJ with the original Rockchip RV1126, a 32-bit Cortex-A7-based SoC announced around 2020 2021. However, the newer RV1126B/BJ comes with a significant architectural upgrade with a 64-bit quad-core Arm Cortex-A53 processor (instead of the original 32-bit quad-core Cortex-A7) and a more powerful 3.0 TOPS NPU (up from 2.0 TOPS). This updated chip has only recently started appearing in products like Luckfox Aura SBC, Boardcon MINI1126B-P SoM (based on the RV1126B-P), GL.iNet Comet PoE, and GL.iNet Comet Pro KVMs, all of which were released just this year. This makes the FET1126Bx-S SoM one of the [...] The post Forlinx FET1126Bx-S low-power Rockchip RV1126BJ industrial SoM powers SBC with 40-pin GPIO header appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Bit-Brick Cluster K1   A 4-slot RISC-V cluster board for SpacemiT K1-based SSOM-K1 system-on-module",
    "link": "https://www.cnx-software.com/2025/12/28/bit-brick-cluster-k1-a-4-slot-risc-v-cluster-board-for-spacemit-k1-based-ssom-k1-system-on-module/",
    "summary": "Bit-Brick Cluster K1 is a cluster board designed to mount up to four SSOM-K1 system-on-modules powered by a SpacemiT K1 octa-core RISC-V processor. The board targets developers, researchers, and system integrators working on edge computing, AI workloads, and high-performance embedded applications. The Cluster K1 relies on an onboard Gigabit Ethernet switch chip to interconnect four core boards, giving each board an independent network port for fast and stable inter-node communication with automatic IP assignment. Other key features include USB 3.0/2.0 ports, HDMI output (master slot only), a USB Type-C debug port, an M.2 M-Key slot for storage expansion, a 3-pin fan power header, and dedicated power, reset, and download buttons. The SSOM-K1 system-on-module features a K1 octa-core 64-bit RISC-V CPU with vector extension and AI acceleration up to 2 TOPS. It ships with up to 8GB dual-channel LPDDR4X memory, up to 64GB eMMC flash, and offers dual Gigabit Ethernet, HDMI 1.4 [...] The post Bit-Brick Cluster K1 A 4-slot RISC-V cluster board for SpacemiT K1-based SSOM-K1 system-on-module appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP32-C6 development board features 1.8-inch AMOLED touch display, built-in mic and speaker, IMU, RTC, and more",
    "link": "https://www.cnx-software.com/2025/12/27/esp32-c6-amoled-development-board-touch-display-built-in-mic-and-speaker-imu-rtc/",
    "summary": "Waveshare ESP32-C6-Touch-AMOLED-1.8 is an ESP32-C6-based touch display development board featuring a 1.8-inch capacitive AMOLED display, a 6-axis IMU, RTC, audio codec, microSD card slot, USB-C for power and programming, power/boot buttons, and various I/Os including I C, UART, USB, and GPIO pads. Compared to boards like Waveshare ESP32-S3-LCD-1.28, ESP32-S3-Touch-LCD-1.69 (based on ESP32-S3), and ESP32-P4-WIFI6-Touch-LCD-3.4C/4C (based on ESP32-P4), this board is based on the ESP32-C6 wireless SoC with 2.4 GHz Wi-Fi 6, Bluetooth 5 LE, Zigbee, and Thread connectivity. It also includes a 16 MB external flash and a 368 448 AMOLED display with 16.7 million colors and capacitive touch support. Power is managed by an AXP2101 PMIC for Li-ion battery support and charging. Typical applications include smart home control panels, wearable and handheld IoT devices, voice-enabled assistants, data loggers, portable dashboards, and HMI-focused embedded prototypes. Waveshare ESP32-C6-Touch-AMOLED-1.8 specifications: SoC Espressif Systems ESP32-C6 CPU Single-core 32-bit RISC-V clocked up to 160 MHz [...] The post ESP32-C6 development board features 1.8-inch AMOLED touch display, built-in mic and speaker, IMU, RTC, and more appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "M5Stack NanoH2   An ultra-compact ESP32-H2 IoT development kit with Zigbee, Thread, and Matter connectivity",
    "link": "https://www.cnx-software.com/2025/12/26/m5stack-nanoh2-an-ultra-compact-esp32-h2-iot-development-kit-with-zigbee-thread-and-matter-connectivity/",
    "summary": "M5Stack NanoH2 is an ultra-compact, standalone IoT development kit powered by an Espressif Systems ESP32-H2 wireless SoC with support for Zigbee, Thread, and Matter, and designed for smart home and low-power wireless applications. It also features a built-in LED, an RGB LED, an infrared transmitter, a Grove port for expansion, a user button, and a USB-C port for power and programming. On the surface, it looks very similar to the Unit Gateway H2 introduced last March, with an ESP32-H2 SoC and a Grove connector. But while the earlier model is designed as an add-on board to other M5Stack products, the NanoH2 is a standalone development kit that you can use directly without another board from M5Stack. M5Stack NanoH2 specifications: SoC Espressif Systems ESP32-H2FH4S CPU 32-bit RISC-V SoC clocked at up to 96 MHz Memory 320 KB SRAM, 4 KB LP memory Storage 128 KB ROM, 4MB [...] The post M5Stack NanoH2 An ultra-compact ESP32-H2 IoT development kit with Zigbee, Thread, and Matter connectivity appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "OpenMediaVault 8 (OMV8)   Synchrony  released for 64-bit x86 (AMD64) and Arm (ARM64) platforms only",
    "link": "https://www.cnx-software.com/2025/12/26/openmediavault-8-omv8-synchrony-released-for-64-bit-x86-amd64-and-arm-arm64-platforms-only/",
    "summary": "OpenMediaVault 8, or OMV8 for shorts, codenamed Synchrony has been released, now supporting only 64-bit architectures (AMD64 and ARM64), and dropping 32-bit systems based on the i386, armel, and armhf architectures. OpenMediaVault is a popular, open-source network-attached storage (NAS) solution based on Debian Linux that s been around for many years. I had my first experience with it in 2017 when I reviewed FriendlyELEC NanoPi NEO NAS Kit based on a NanoPi NEO2 SBC with an Allwinner H5 64-bit Cortex A53 SoC, but sadly not recommended for OMV8 (more on that below). The main reason for killing 32-bit support is that the Salt Project only supports 64-bit builds. OpenMediaVault 8 highlights: Upgrade to Debian 13 (Trixie). Replace cpufrequtils with linux-cpupower Improve several user and group-related RPCs. Developers should note that the RPCs UserMgmt::enumerateSystemUsers, UserMgmt::enumerateUsers, UserMgmt::enumerateAllUsers and UserMgmt::getUserList now return only basic user information. Set the parameter detail to full to get [...] The post OpenMediaVault 8 (OMV8) Synchrony released for 64-bit x86 (AMD64) and Arm (ARM64) platforms only appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Cerelog ESP-EEG   A low-cost ESP32-based EEG acquisition board for brain computer interface (BCI) experiments",
    "link": "https://www.cnx-software.com/2025/12/26/cerelog-esp-eeg-a-low-cost-esp32-based-eeg-acquisition-board-for-brain-computer-interface-bci-experiments/",
    "summary": "The Cerelog ESP-EEG is an 8-channel, low-cost brain computer interface (BCI) circuit board built around the ESP32 MCU and designed for EEG data acquisition. The board supports 8-channel, 24-bit EEG data collection and connects to a host system over USB-C for both power and data. The board has an active noise-removal bias pin which reduces mains interference, along with onboard status LEDs, including a dedicated indicator for active data capture. It works with third-party or DIY EEG headsets using adapter boards, and STL files are provided for 3D printed mounts. Cerelog also offers various software tools and sample code to enable real-time EEG visualization, BCI experiments, neurofeedback, and custom brain-controlled applications. Cerelog ESP-EEG specifications: Wireless Module ESP32-WROOM-32 SoC ESP32 CPU Dual-core processor @ 160 MHz Memory 520 KB SRAM Wireless WiFi 802.11 b/g/n, Bluetooth 4.2 Storage 4 MB flash PCB antenna Analog Front-End (via TI s [...] The post Cerelog ESP-EEG A low-cost ESP32-based EEG acquisition board for brain computer interface (BCI) experiments appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Jetway B903DMTX Intel N97 fanless industrial box PC features 10 USB ports, four DB9 serial interfaces",
    "link": "https://www.cnx-software.com/2025/12/26/jetway-b903dmtx-intel-n97-fanless-industrial-box-pc-features-10-usb-ports-four-db9-serial-interfaces/",
    "summary": "Jetway B903DMTX is a fanless industrial box PC built around the Intel N97 quad-core Alder Lake-N CPU and designed for industrial applications with up to ten USB Type-A ports, four DB9 serial ports, dual GbE, and support for M.2 wireless modules. It supports up to 32GB of DDR5-4800 SO-DIMM memory, SATA III and M.2 SSD storage, along with WiFi and Bluetooth through an M.2 E-Key slot. The system also features 4Kp60-capable HDMI and DisplayPort video outputs. The embedded box PC runs on a 12 19V DC input, supports AT/ATX power modes, and includes features such as a watchdog timer, Intel PTT (fTPM), and a wide -10 C to 60 C operating temperature. These features make it suitable for factory automation, kiosks, digital signage, industrial gateways, and edge computing systems. Jetway B903DMTX specifications: SoC Intel Processor N97 quad-core Alder Lake N-series processor up to 3.6 GHz with 6MB cache, 24EU Intel UHD Graphics Gen 12 @ 1.2 [...] The post Jetway B903DMTX Intel N97 fanless industrial box PC features 10 USB ports, four DB9 serial interfaces appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Firefly CAM-3576 series   Tiny Rockchip RK3576 SBCs for commercial, industrial, and automotive applications",
    "link": "https://www.cnx-software.com/2025/12/24/firefly-cam-3576-series-tiny-rockchip-rk3576-sbcs-for-commercial-industrial-and-automotive-applications/",
    "summary": "Firefly Technology has introduced the CAM-3576 series of tiny (38 38 mm) SBCs based on the Rockchip RK3576 processor with a 6 TOPS NPU for AIoT, edge AI, smart vision, industrial, and automotive applications. It comes in three variants, which include the CAM-3576Q38 (commercial), the CAM-3576JQ38 (industrial), and the CAM-3576MQ38 (automotive) modules designed for smart cameras, intelligent security systems, dash cams, and private on-device AI model deployment. The CAM-3576 series supports up to 16GB of LPDDR5 RAM, up to 256GB eMMC flash, and also includes a microSD card for expansion. Additionally, the boards feature a MIPI CSI input for up to 16MP camera sensors with HDR support, Fast Ethernet, Wi-Fi 6, USB 2.0, USB-C (device), RS-485, UART, I C, ADC, GPIOs, audio input/output, and RTC support. Firefly CAM-3576Q38 specifications: SoM ICORE-3576Q38 SoC Rockchip RK3576 (Q38 Commercial) or Rockchip RK3576J (JQ38 Industrial) or Rockchip RK3576M (MQ38 Automotive) [...] The post Firefly CAM-3576 series Tiny Rockchip RK3576 SBCs for commercial, industrial, and automotive applications appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "CrowPi 3 AI Learning Kit is powered by a Raspberry Pi 5 SBC, works with Arduino Nano, BBC Micro:bit, and Raspberry Pi Pico boards",
    "link": "https://www.cnx-software.com/2025/12/24/crowpi-3-ai-learning-kit-is-powered-by-a-raspberry-pi-5-sbc-works-with-arduino-nano-bbc-microbit-and-raspberry-pi-pico-boards/",
    "summary": "Elecrow CrowPi 3 is the latest CrowPi learning and development kit featuring 41 built-in modules and over 150 lessons, and offering compatibility with Raspberry Pi 5, Arduino Nano, BBC Micro:bit, and Raspberry Pi Pico single board computers and development boards. It follows the CrowPi portable learning kit (Raspberry Pi 3B+/Zero), CrowPi 2 Raspberry Pi 4 electronics learning laptop, and CrowPi L laptop (Raspberry Pi 4 models), but the CrowPi 3 is the first to focus on Artificial Intelligence (AI) learning with a Raspberry Pi 5 and support for LLMs like DeepSeek, Google Gemini, and OpenAI chat besides courses about electronics and computer vision. CrowPi 3 specifications: Compatible boards Raspberry Pi 5 (required) Broadcom BCM2712 quad-core Arm Cortex-A76, up to 2.4GHz, 4GB or 8GB RAM. OS: Raspberry Pi OS (Debian Linux) or others Optional via headers or slots Arduino Nano Raspberry Pi Pico 1/1 W/2/2 W BBC micro:bit Display [...] The post CrowPi 3 AI Learning Kit is powered by a Raspberry Pi 5 SBC, works with Arduino Nano, BBC Micro:bit, and Raspberry Pi Pico boards appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Lattice Semi MachXO4 FPGA family offers up to 9400 LUTs, 448 kb user flash, improved  hot socketing ",
    "link": "https://www.cnx-software.com/2025/12/24/lattice-semi-machxo4-fpga-family-offers-up-to-9400-luts-448-kb-user-flash-improved-hot-socketing/",
    "summary": "Lattice Semiconductor has recently launched the MachXO4 low-power FPGA family featuring 896 to 9400 LUTs, fabric performance of up to 150 MHz, and improved hot socketing with a low leakage current of 350 A. Other features include up to 432 kb embedded RAM, 73 kb distributed RAM, 448 kb User Flash Memory (UFM), up to 382 I/Os, hardened SPI and I2C interfaces, a wide range of packages from 2.5 2.5mm to 20 x 20 mm, and three temperature grades (consumer, industrial, and automotive). Lattice Semi MachXO4 key features and specifications: FPGA Fabric 896 to 9400 LUTs 1,100 to 11,300 logic cells Up to 150 MHz operation Memory Embedded RAM 64 kb to 432 kb Distributed RAM 10 kb to 73 kb Storage 64 to 448 kb User Flash Memory (UFM) I/O and peripherals Up to 382 I/O pins 1x Phased Lock Loop (PLL) Hardened functions: SPI, 2x I2C, [...] The post Lattice Semi MachXO4 FPGA family offers up to 9400 LUTs, 448 kb user flash, improved hot socketing appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "4-inch round HDMI display offers USB touchscreen for Raspberry Pi, AIDA64, Smart Home, Art projects",
    "link": "https://www.cnx-software.com/2025/12/23/4-inch-round-hdmi-display-offers-usb-touchscreen-for-raspberry-pi-aida64-smart-home-art-projects/",
    "summary": "VIEWE has launched a 4-inch round HDMI display with 720 720 resolution, and a USB touchscreen function suitable for SBCs like the Raspberry Pi, PCs running AIDA64, Smart Home applications, and Art projects. It looks to build upon the company s 4-inch square HDMI display using the same control board with a MIPI DSI display interface, HDMI 1.4 input, and a USB Type-C port for power and touch input. VIEWE 4-inch HDMI round display specifications: Display 4-inch round HDMI IPS display with 720 720 resolution ST7703 display driver Brightness 300 cd/ Active area 101.52mm Touchscreen 5-point capacitive touch screen via USB-C port; FT6336U touch IC Video Input HDMI 1.4 Display Interfaces via Lontium LT6911C HDMI to MIPI DSI/LVDS chip Single/Dual-Port MIPI DSI/CSI transmitter Single/Dual-Port LVDS transmitter (connector present but not used with the provided 4-inch MIPI display) USB USB-C port for power and touchscreen Dimensions 109.62 [...] The post 4-inch round HDMI display offers USB touchscreen for Raspberry Pi, AIDA64, Smart Home, Art projects appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Auvidea X242   An NVIDIA Jetson Thor T5000 industrial carrier board with dual 10GbE, PCIe x16, CSI-2 camera support",
    "link": "https://www.cnx-software.com/2025/12/23/auvidea-x242-an-nvidia-jetson-thor-t5000-industrial-carrier-board-with-dual-10gbe-pcie-x16-csi-2-camera-support/",
    "summary": "Auvidea X242 is an industrial carrier board for NVIDIA s Jetson Thor T5000 module, targeting edge AI, robotics, vision, and high-bandwidth embedded systems, mainly in industrial and high-performance commercial applications. The board supports dual 10GbE, PCIe x16 expansion, NVMe storage, 4G LTE/5G M.2, up to four displays through HDMI and DisplayPort Alt Mode over USB-C (rev 3), and multiple cameras through a 16-lane CSI-2 camera connector. The carrier board supports a wide 24 48 V power input with power modes up to 120 W. Industrial features include hot-swap control, reverse and over-voltage protection, and backward compatibility with earlier Auvidea Jetson platforms. Auvidea X242 Specifications: Supported system-on-module NVIDIA Jetson Thor T5000 Storage M.2 Key M 2280 socket (PCIe x2 Gen 5) for NVMe SSD Video Output HDMI port Up to 3x USB-C with DisplayPort Alt Mode Up to 4x displays supported simultaneously Camera 16-lane CSI-2 camera connector, compatible with NVIDIA [...] The post Auvidea X242 An NVIDIA Jetson Thor T5000 industrial carrier board with dual 10GbE, PCIe x16, CSI-2 camera support appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "HackyPi 2.0 hacking tool gets ESP32-S3 for Wi-Fi and Bluetooth connectivity (Crowdfunding)",
    "link": "https://www.cnx-software.com/2025/12/23/hackypi-2-0-hacking-tool-esp32-s3-for-wi-fi-and-bluetooth-connectivity/",
    "summary": "HackyPi 2.0 is an ESP32-S3-based USB hacking and automation tool designed for both coders and non-coders. It features AI-assisted control, HID keystroke injection, BadUSB, and a no-code interface for learning, automation, ethical hacking, and overall system interaction. Compared to the original Raspberry Pi RP2040-based HackyPi, the HackyPi 2.0 adds Wi-Fi and Bluetooth connectivity, remote access, AI integration, and automatic OS detection, making it far more flexible. It keeps support for BadUSB and HID keystroke injection and also adds features such as mouse jiggler mode, child-safety website blocking, RGB status lighting, and LVGL-based UI support. Everything can be controlled through a beginner-friendly, no-code visual interface, while there is also an option to run commands, scripts, and automated workflows when deeper control is needed. HackyPi 2.0 specifications: Main SoC ESP32-S3 CPU Dual-core LX7 microprocessor @ up to 240 MHz with Vector extension for machine learning Wireless WiFi 4 and [...] The post HackyPi 2.0 hacking tool gets ESP32-S3 for Wi-Fi and Bluetooth connectivity (Crowdfunding) appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "CrowPanel Advanced 7inch Review   Part 1: ESP32-P4 HMI AI display hands-on with LVGL factory firmware",
    "link": "https://www.cnx-software.com/2025/12/23/crowpanel-advanced-7inch-review-part-1-esp32-p4-hmi-ai-display-hands-on-with-lvgl-factory-firmware/",
    "summary": "Elecrow has sent us a sample of the CrowPanel Advanced 7inch ESP32-P4 HMI display for review. It is designed for high-performance AI and IoT (AIoT) applications with a 2MP camera module, an ESP32-C6-MINI-1 module for Wi-Fi 6, Bluetooth 5.3, and 802.15.4 (Zigbee, Thread, Matter) connectivity. Our kit also shipped with three wireless modules, namely an ESP32-H2 wireless module for an additional Thread, Zigbee, and Matter radio, an SX1262 module for LoRa low-power long-range connectivity, and an nRF2401 2.4 GHz wireless module. In the first part of the review, we will take you through an unboxing of the CrowPanel Advanced 7-inch, checking out the ESP32-P4 HMI AI Display s hardware before testing it with the preinstalled firmware using LVGL and AI features. You can check the detailed specifications in our previous article: CrowPanel Advance 7-inch ESP32-P4 HMI display supports Zigbee, LoRa, and 2.4GHz radio modules. Note that the company calls it Advance [...] The post CrowPanel Advanced 7inch Review Part 1: ESP32-P4 HMI AI display hands-on with LVGL factory firmware appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP-Scope is a web-based oscilloscope built using the ESP-IDF framework and Gemini 3 LLM",
    "link": "https://www.cnx-software.com/2025/12/22/esp-scope-is-a-web-based-oscilloscope-built-using-the-esp-idf-framework-and-gemini-3-llm/",
    "summary": "ESP-Scope is an open-source firmware transforming any ESP32 board into an oscilloscope using one of the ADC pins up to 83,333 Hz sample rate (on the ESP32-C6) and visualizing the results over Wi-Fi in a web browser, be it Google Chrome, Mozilla Firefox, or others. It s not the first ESP32 oscilloscope project we ve seen, as last year, we covered Bojan Jurca s Esp32_oscilloscope Arduino sketch doing something very similar. The ESP-Scope is a little different, since it s based on the ESP-IDF framework, and was used to test AI code generators, specifically Google Antigravity using Gemini 3, with refinements, hints and tips and overall design specified by a human . It just took a few hours to build. ESP-Score firmware features: Real-time signal visualization on a web browser. Adjustable sample rate (1-83333 Hz) and attenuation. Crosshair functionality for precise measurements Adjustable trigger level Test signal generation Reset functionality to clear settings and reload [...] The post ESP-Scope is a web-based oscilloscope built using the ESP-IDF framework and Gemini 3 LLM appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "GigaDevice GD32VW553-UNIFI   A $2+ WiFi 6 and Bluetooth 5.2 LE wireless IoT module",
    "link": "https://www.cnx-software.com/2025/12/22/gigadevice-gd32vw553-unifi-a-2-wifi-6-and-bluetooth-5-2-le-wireless-iot-module/",
    "summary": "GD32VW553-UNIFI is an inexpensive wireless IoT module based on GigaDevice GD32VW553 RISC-V microcontroller featuring 2.4 GHz WiFi 6 and Bluetooth 5.2 LE connectivity, and offered with a PCB antenna or IPEX antenna connector. The GD32VW553 MCU integrates 320KB SRAM and 4096KB on-chip flash, and supports link rates of up to 114.7 Mbps over WiFi and 2 Mbps over Bluetooth LE. The UNIFI module exposes 18 GPIOs from the microcontroller and is available in two different temperature ranges: -40 to +85 C or -40 to +105 C. GD32VW553-UNIFI specifications: SoC GigaDevice GD32VW553 CPU 32-bit RISC-V processor up to 160 MHz with RV32I/M/A/F/D/C/P/B instruction extensions Memory 320KB (288 KB + 32KB shared) SRAM Storage 4096 KB flash Wireless WiFi 802.11b/g/n/ax compatible 802.11i (WPA, WPA2, WPA3). Open, shared key, and pair-wise key authentication services Single antenna 1 1 stream in 20MHz channels upport of 802.11ax MCS up to MCS9 with a Max [...] The post GigaDevice GD32VW553-UNIFI A $2+ WiFi 6 and Bluetooth 5.2 LE wireless IoT module appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP32-S3 AIoT Basic   A learning and prototyping kit with camera, audio, LCD, and sensors",
    "link": "https://www.cnx-software.com/2025/12/22/esp32-s3-aiot-basic-a-learning-and-prototyping-kit-with-camera-audio-lcd-and-sensors/",
    "summary": "The ESP32-S3 AIoT Basic is a low-cost, learning, and prototyping kit for the ESP32-S3. The board integrates common AIoT peripherals directly onto a single PCB, making the design part easy for beginners, classrooms, and rapid prototyping. Built around an ESP32-S3 board, the development platform integrates nine commonly used modules directly on the PCB, including a button, buzzer, LED indicator, light sensor, LCD, digital microphone, SD card slot, audio amplifier, and a camera. Most AI and IoT demos can be run without breadboards or jumper wires, while expansion is supported through standard pin headers and Grove connectors. The board supports 5V power via USB-C, and 6 12 V power input via Vin for driving additional devices. With various tutorials and sample projects, it is suitable for AIoT learning, STEM education, voice and vision demos, sensor-based projects, and quick proof-of-concept development. ESP32-S3 AIoT Basic Specifications: Main board ESP32-S3 Core Board SoC [...] The post ESP32-S3 AIoT Basic A learning and prototyping kit with camera, audio, LCD, and sensors appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Forlinx FCU3011   An NVIDIA Jetson Orin Nano fanless industrial computer with 4x GbE, optional 4G/5G and Wi-Fi connectivity",
    "link": "https://www.cnx-software.com/2025/12/22/forlinx-fcu3011-an-nvidia-jetson-orin-nano-fanless-industrial-computer-with-4x-gbe-optional-4g-5g-and-wi-fi-connectivity/",
    "summary": "Forlinx Embedded has recently released the FCU3011, a compact, fanless industrial AI edge computer built around the NVIDIA Jetson Orin Nano, designed for 24/7 operations in manufacturing, smart cities, robotics, and machine vision systems, where real-time processing is needed. The fanless system supports NVIDIA Jetson Orin Nano 4GB (34 TOPS) or 8GB (up to 67 TOPS) configurations, with 4GB/8GB LPDDR5 memory and a 128GB PCIe x4 NVMe SSD. Connectivity options include up to four Gigabit Ethernet ports, USB 3.0/2.0, HDMI 2.0 (4K), an SD card slot, optional 4G/5G and dual-band Wi-Fi via M.2 modules, along with industrial interfaces such as isolated RS-485, CAN, opto-isolated inputs, relay outputs, and an RTC. The system takes a wide 9 24V DC power input, features ESD-protected interfaces, and can be used for AGVs, visual inspection, smart factories, intelligent traffic analysis, medical devices, and small commercial robots. Forlinx FCU3011 specifications: SoM options NVIDIA Jetson Orin Nano [...] The post Forlinx FCU3011 An NVIDIA Jetson Orin Nano fanless industrial computer with 4x GbE, optional 4G/5G and Wi-Fi connectivity appeared first on CNX Software - Embedded Systems News ."
  }
]