[
  {
    "title": "Retro Apple emulator ported to $60 ESP32 microcontroller-powered touchscreen tablet   supports Mac OS8.1 and a virtual MC68040 CPU in major emulation leap",
    "link": "https://www.tomshardware.com/software/macos/retro-apple-emulator-ported-to-usd60-esp32-microcontroller-powered-touchscreen-tablet-supports-mac-os8-1-and-a-virtual-mc68040-cpu-in-major-emulation-leap",
    "summary": "A new emulator makes running classic Apple Macintosh 68K software a breeze on a cheap, portable, IoT development kit."
  },
  {
    "title": "Get an entire RTX 5090 gaming PC for the same price as the GPU alone   $3,599 rig includes 9700X, 32GB of RAM, and a 2TB SSD in MSI's PC deal",
    "link": "https://www.tomshardware.com/desktops/gaming-pcs/get-an-entire-rtx-5090-gaming-pc-for-the-same-price-as-the-gpu-alone-usd3-599-rig-includes-9700x-32gb-of-ram-and-a-2tb-ssd-in-msis-pc-deal",
    "summary": "$3,599 MSI rig includes an RTX 5090, Ryzen 9700X, 32GB of RAM, and a 2TB SSD in MSI's PC deal"
  },
  {
    "title": "Micron addresses Crucial exit backlash: 'We are trying to help consumers around the world'   company warns that DRAM drought could last until at least 2028",
    "link": "https://www.tomshardware.com/pc-components/ram/micron-addresses-crucial-exit-backlash-we-are-trying-to-help-consumers-around-the-world-company-warns-that-dram-drought-could-last-until-at-least-2028",
    "summary": "Micron has responded to criticism over its decision to exit the consumer memory business and warns that shortages may last until 2028."
  },
  {
    "title": "Asus revised the liquid metal application on its $4,000 ROG Matrix RTX 5090 cards   der8auer says retail versions come with 'much more professional' spread",
    "link": "https://www.tomshardware.com/pc-components/gpus/asus-revised-the-liquid-metal-application-on-its-usd4-000-rog-matrix-rtx-5090-cards-der8auer-says-retail-versions-come-with-much-more-professional-spread",
    "summary": "The retail versions of the ROG Matrix RTX 5090 shipping out to customers will come with an updated TIM application that should help against accidental liquid metal leakage. Previously, sample GPUs showed a poor spread that would barely seal the metal in, with a crooked ring around the core. Now, we see several neatly-organized lanes that are much closer to the IHS, too."
  },
  {
    "title": "Newegg bundles 16GB of DDR5-6000 RAM with Asus AM5 B850 mobo for under $240   get 41% off and save $169.99 with this all-white combo",
    "link": "https://www.tomshardware.com/pc-components/ram/newegg-bundles-16gb-of-ddr5-6000-ram-with-asus-am5-b850-mobo-for-under-usd240-get-41-percent-off-and-save-usd169-99-with-this-all-white-combo",
    "summary": "Newegg is basically throwing in an Asus B850 Max Gaming WiFi motherboard for $10 if you get this 16GB (2 x 8GB) Team Group DDR5-6000 RAM as a combo."
  },
  {
    "title": "FCC approves 7,500 additional Starlink Gen2 satellites   service will benefit from higher throughput and lower latency worldwide",
    "link": "https://www.tomshardware.com/tech-industry/fcc-approves-7500-additional-starlink-gen2-satellites",
    "summary": "The FCC has partially approved a significant expansion of SpaceX s next-generation Starlink constellation, authorizing 7,500 additional LEO satellites under a partial grant."
  },
  {
    "title": "MetalPrinting Gauss MT90 3D printer offers office safe metal printing without powders   uses paste based metal extrusion (PME) tech",
    "link": "https://www.tomshardware.com/3d-printing/metalprinting-gauss-mt90-3d-printer-offers-office-safe-metal-printing-without-powders-uses-paste-based-metal-extrusion-pme-tech",
    "summary": "MetalPrinting was at CES 2026 with its next-generation metal paste 3D printer dubbed the Gauss MT90."
  },
  {
    "title": "Modder saves $130 by building 32GB DDR5 desktop DIMMs from scavenged laptop memory    donor modules soldered to bare PCB flashed with custom firmware even run XMP",
    "link": "https://www.tomshardware.com/pc-components/ddr5/modder-saves-usd130-by-building-32gb-ddr5-desktop-dimms-from-scavenged-laptop-memory-donor-modules-soldered-to-bare-pcb-flashed-with-custom-firmware-even-run-xmp",
    "summary": "DIY DDR5 is no longer just a concept, but a reality, as modder VIK-on has built his first 32GB stick from scavenged parts. The memory chips came from laptop SODIMMs, while a new PCB and cooler were acquired from China. After flashing custom firmware enabling 6400 MT/s XMP, the entire build put together cost $218."
  },
  {
    "title": "Windows Media Player s  find album information  functionality has been removed   you ll have to find other software for playing and ripping CDs with relevant track information",
    "link": "https://www.tomshardware.com/software/windows/windows-media-players-find-album-information-functionality-has-been-removed-youll-have-to-find-other-software-for-playing-and-ripping-cds-with-relevant-track-information",
    "summary": "Microsoft has quietly removed find album information and update album info online tools from the Media Player apps supplied with Windows 11."
  },
  {
    "title": "US Department of Commerce lifts planned crackdown on Chinese drones, including DJI   company gets reprieve ahead of Xi-Trump meeting in April, but the FCC ban still stands",
    "link": "https://www.tomshardware.com/tech-industry/us-department-of-commerce-lifts-planned-crackdown-on-chinese-drones-including-dji-company-gets-reprieve-ahead-of-xi-trump-meeting-in-april-but-the-fcc-ban-still-stands",
    "summary": "The U.S. Department of Commerce has retracted its proposal to stop the import of DJI drones, but the FCC's ban means that the U.S.'s doors are closed to new DJI models anyway."
  },
  {
    "title": "AMD leaves the door open to experimental FSR Redstone support on RDNA 3",
    "link": "https://www.tomshardware.com/pc-components/gpus/amd-leaves-the-door-open-to-experimenta-fsr-redstone-support-on-rdna3",
    "summary": "At CES 2026, AMD used an interview with PCWorld to restate its official position on FSR Redstone while softening the edges around it."
  },
  {
    "title": "Upgrade your gaming PC with an RTX 5060 for just $259.99 and instantly pocket $50 in savings",
    "link": "https://www.tomshardware.com/pc-components/upgrade-your-gaming-pc-with-an-rtx-5060-for-just-usd259-99-and-instantly-pocket-usd50-in-savings",
    "summary": "The Gigabyte GeForce RTX 5060 WindForce OC 8G is currently on sale at BestBuy, giving you a 15% discount off Nvidia's $299 MSRP."
  },
  {
    "title": "Doom conquers the kitchen through an electric cooking pot   classic shooter runs seamlessly after a full device firmware refresh",
    "link": "https://www.tomshardware.com/video-games/retro-gaming/youtuber-makes-doom-run-on-a-smart-cooking-pot-after-a-full-firmware-refresh",
    "summary": "A YouTuber has managed to run Doom on a Krups Cook4Mec smart pressure cooker after dumping and reflashing the firmware on the appliance s touchscreen control hardware."
  },
  {
    "title": "Nvidia s Blackwell gaming GPUs go through blower-style transformation to fuel AI data centers   RTX 5080, RTX 5070 Ti, RTX 5060 Ti blower GPUs up for purchase in China",
    "link": "https://www.tomshardware.com/pc-components/gpus/nvidias-blackwell-gaming-gpus-go-through-blower-style-transformation-to-fuel-ai-data-centers-rtx-5080-rtx-5070-ti-rtx-5060-ti-blower-gpus-up-for-purchase-in-china",
    "summary": "China's underground GPU operations have birthed a few more spectacles, new Nvidia RTX 50-series SKUs with blower-style coolers, aimed at data centers and server farms. Listed on Taobao, the RTX 5080, 5070 Ti, 5060 Ti & more are all priced higher than their retail counterparts, and that's for their stock VRAM versions."
  },
  {
    "title": "Admins finally get the power to uninstall Microsoft Copilot on Windows 11 Pro, Enterprise, and EDU versions   devices must meet specific conditions to allow the removal of the AI app",
    "link": "https://www.tomshardware.com/software/windows/admins-finally-get-the-power-to-uninstall-microsoft-copilot-on-windows-11-pro-enterprise-and-edu-versions-devices-must-meet-specific-conditions-to-allow-the-removal-of-the-ai-app",
    "summary": "Microsoft finally allows administrators to remove the Microsoft Copilot app from managed versions of Windows 11 Pro, Enterprise, and EDU. However, you need to have Microsoft 365 Copilot installed, among other conditions."
  },
  {
    "title": "GPU crisis hits Japan as RTX 5060 Ti and up are in short supply   GPUs sell out as soon as they arrive",
    "link": "https://www.tomshardware.com/pc-components/gpus/rtx-5060-ti-and-higher-gpus-are-getting-harder-to-find-in-japan",
    "summary": "Multiple shops are reportedly saying that GPUs are selling almost as soon as they arrive, with higher-end models becoming increasingly challenging to keep in stock."
  },
  {
    "title": "HP reportedly eyes Chinese suppliers for DRAM as global shortage sparks shake-up   analyst says memory chips are commodities that can easily be replaced",
    "link": "https://www.tomshardware.com/pc-components/ram/hp-reportedly-eyes-chinese-suppliers-for-dram-as-global-shortage-sparks-shake-up-analyst-says-memory-chips-are-commodities-that-can-easily-be-replaced",
    "summary": "A tech analyst claims that HP told the Bank of America that it's considering buying memory chips from China to help alleviate the ongoing shortage."
  },
  {
    "title": "Asus adds 64MB ROM to Strix Neo AM5 motherboards, following Gigabyte   capacity large enough to fit pre-installed Wi-Fi drivers",
    "link": "https://www.tomshardware.com/pc-components/motherboards/asus-adds-64mb-rom-to-strix-neo-am5-motherboards-following-gigabyte-capacity-large-enough-to-fit-pre-installed-wi-fi-drivers",
    "summary": "Asus has incorporated a 64MB ROM into its all-new Strix Neo AM5 motherboards to support future Ryzen releases. For now, though, Asus is using the extra capacity to hold an integrated Wi-Fi driver, handy for new Windows 11 installs."
  },
  {
    "title": "Steam Machine pricing soars past PS5 Pro and Xbox Series X in new retailer listing   1TB SKU shatters $1,000 barrier",
    "link": "https://www.tomshardware.com/video-games/console-gaming/steam-machine-pricing-soars-past-ps5-pro-and-xbox-series-x-in-new-retailer-listing-1tb-sku-shatters-usd1-000-barrier",
    "summary": "Czech retailer Smarty has listed Valve s highly anticipated Steam Machine at $950 for the 512GB version and $1,070 for the 1TB model both before taxes."
  },
  {
    "title": "Dev creates selection of UEFI games you have to beat in order to boot your computer   10-month project will shut down your PC if you lose",
    "link": "https://www.tomshardware.com/software/dev-creates-uefi-games-compendium-where-you-have-to-win-to-access-your-computer-10-month-project-will-shutdown-your-pc-if-you-lose",
    "summary": "Dev creates a quintet of UEFI games with the premise of Win -> Boot, Lose -> Shutdown."
  },
  {
    "title": "This $2,000 Bitcoin mining water heater can pay for itself by slashing your energy bills, company claims   can rake in $1,000 a year in BTC, offset 80% of electricity and water costs",
    "link": "https://www.tomshardware.com/tech-industry/cryptomining/bitcoin-mining-water-heater-firm-says-its-usd2-000-product-can-rake-back-usd1-000-a-year-in-btc-and-claims-it-can-offset-up-to-80-percent-of-electricity-and-water-costs",
    "summary": "Superheat was at CES 2026 to showcase what it describes as a water heater that pays for itself. Instead of a resistive heating element, it warms your H2O with heat generated by a Bitcoin ASIC miner."
  },
  {
    "title": "Jensen Huang discusses the economics of inference, power delivery, and more at CES 2026 press Q&A session   'You sell a chip one time, but when you build software, you maintain it forever'",
    "link": "https://www.tomshardware.com/pc-components/gpus/jensen-huang-ces-2026-q-and-a",
    "summary": "In a press Q&A at CES 2026, Nvidia CEO Jensen Huang addressed everything from Rubin s design philosophy to inference economics, power constraints, open models, and more."
  },
  {
    "title": "Nvidia hires first-ever CMO, snatches former Google exec for the tough job of helping sell more chips   Alison Wagonfield spent nearly 10 years at Google building its Cloud project",
    "link": "https://www.tomshardware.com/pc-components/gpus/nvidia-hires-first-ever-cmo-snatches-former-google-exec-for-the-tough-job-of-helping-sell-more-chips-alison-wagonfield-spent-nearly-10-years-at-google-building-its-cloud-project",
    "summary": "As the AI hardware market is about to change, Nvidia is hiring its first chief marketing officer."
  },
  {
    "title": "Intel showed up for consumers at the 'Consumer Electronics Show;' AMD didn t",
    "link": "https://www.tomshardware.com/pc-components/cpus/intel-showed-up-for-consumers-at-the-consumer-electronics-show-amd-didnt",
    "summary": "At this year's CES, AMD felt like a dominant force, too focused on AI potential to talk about (or to) consumers. Intel looked more like a laser-focused startup, confidently pitching its Panther Lake chips to gamers, laptop users, and even robot makers."
  },
  {
    "title": "Meta inks deals to supply a staggering 6 gigawatts in nuclear power for data center ambitions   enough wattage to supply 5 million homes",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/meta-inks-deals-to-supply-a-staggering-6-gigawatts-in-nuclear-power-for-data-center-ambitions-enough-wattage-to-supply-5-million-homes",
    "summary": "The 6GW will come from various suppliers both existing and upcoming to deliver the estimated 1GW that Meta's Prometheus site will require in 2026, and the 5GW its Hyperion data center will need by 2028."
  },
  {
    "title": "Intel Panther Lake press Q&A transcript   EVO is still alive, and the company ditches prior-generation naming scheme",
    "link": "https://www.tomshardware.com/pc-components/cpus/intel-panther-lake-press-q-and-a-transcript",
    "summary": "Following Intel's keynote at CES 2026, we attended a press Q&A at CES in Las Vegas, featuring some of the senior staff behind Intel's Panther Lake architecture, with some illuminating commentary about the new products."
  },
  {
    "title": "Researchers turn spoiled milk into 3D printing materials   extracted proteins from dairy waste combined with polymers to create plastic alternative",
    "link": "https://www.tomshardware.com/3d-printing/researchers-turn-spoiled-milk-into-3d-printing-materials-extracted-proteins-from-dairy-waste-combined-with-polymers-to-create-plastic-alternative",
    "summary": "This work turns what would otherwise be an agricultural liability into a potential input for advanced manufacturing."
  },
  {
    "title": "President Trump, Sec. Lutnick praise Intel after the launch of Panther Lake chips   says investment in company already bringing  tens of billions of dollars for the American people ",
    "link": "https://www.tomshardware.com/tech-industry/president-trump-sec-lutnick-praise-intel-after-the-launch-of-panther-lake-chips-says-investment-in-company-already-bringing-tens-of-billions-of-dollars-for-the-american-people",
    "summary": "President Donald Trump and Commerce Secretary Howard Lutnick went on their respective social media platforms to praise Intel and its CEO, Lip-Bu Tan, for the launch of the first chips made using the Intel 18A process node. They also said that it's another step towards the U.S. regaining its lead in cutting-edge chip manufacturing."
  },
  {
    "title": "Intel makes sharp reversal, is 'going big time into 14A,' says CEO Lip-Bu Tan   'serve the customer well' remark hints at external client",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/intel-is-going-big-time-into-14a-says-ceo-lip-bu-tan-serve-the-customer-well-remark-hints-at-external-client",
    "summary": "Intel's CEO says he expects 'great momentum in terms of yields and IP' on the company's 14A process technology."
  },
  {
    "title": "Chinese researchers hail breakthrough in DRAM-like cells, which could be used in embedded or 3D stacked memory    absence of manufacturing detail casts doubt on mass production",
    "link": "https://www.tomshardware.com/pc-components/dram/chinese-researchers-hail-breakthrough-in-dram-like-cells-which-could-be-used-in-embedded-or-3d-stacked-memory-absence-of-manufacturing-detail-casts-doubt-on-mass-production",
    "summary": "Chinese researchers have demonstrated a 4F dual-gate 2T0C capacitor-less, DRAM-like memory cell with multi-bit storage, fast writes, and long retention. In theory, the technology could be used as embedded or stacked 3D memory, but questions remain about its manufacturability and commercial viability."
  },
  {
    "title": "Apple-1  Prototype Board #0  system is expected to fetch $500,000+ at a 50th Anniversary auction   and the firm s first ever check is valued at the same amount",
    "link": "https://www.tomshardware.com/desktops/pc-building/apple-1-prototype-board-0-system-is-expected-to-fetch-usd500-000-at-a-50th-anniversary-auction-and-the-firms-first-ever-check-is-valued-at-the-same-amount",
    "summary": "An auction featuring 191 lots of historic Apple Computer artifacts, some with estimates of $500,000+, has begun."
  },
  {
    "title": "Woot's 'reconditioned' MSI PC deals might be your ticket to an affordable upgrade   For $719, get an RTX 5060-based 14400F PC with 16GB of DDR5 and 1TB of storage",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/woots-reconditioned-msi-pc-deals-might-be-your-ticket-to-an-affordable-upgrade-for-usd719-get-an-rtx-5060-based-14400f-pc-with-16gb-of-ddr5-and-1tb-of-storage",
    "summary": "Woot is flogging a range of reconditioned MSI pre-built PCs."
  },
  {
    "title": "Acemagic presents mini-PCs inspired by the NES and PlayStation 1   retro shells conceal Ryzen AI 9 465, up to 64GB of RAM, and up to 4TB of SSD storage",
    "link": "https://www.tomshardware.com/video-games/retro-gaming/acemagic-presents-mini-pcs-inspired-by-the-nes-and-playstation-1-retro-shells-conceal-ryzen-ai-9-465-up-to-64gb-of-ram-and-up-to-4tb-of-ssd-storage",
    "summary": "Acemagic presents mini-PCs inspired on the NES and PlayStation 1"
  },
  {
    "title": "HBM4 mass production delayed as Nvidia pushes memory specs higher   production to come  no earlier  than late Q126",
    "link": "https://www.tomshardware.com/tech-industry/hbm4-mass-production-delayed-as-nvidia-pushes-memory-specs-higher",
    "summary": "HBM4 memory is now expected to reach volume production no earlier than the end of Q1 2026 due to Nvidia's decision to revise its memory specs upward for its next-gen Rubin GPU platform."
  },
  {
    "title": "SanDisk to double price of 3D NAND for enterprise SSDs in Q1 2026    hyperscalers to pay top dollar for storage as AI continues to roll",
    "link": "https://www.tomshardware.com/pc-components/ssds/sandisk-to-double-price-of-3d-nand-for-enterprise-ssds-in-q1-2026-hyperscalers-to-pay-top-dollar-for-storage-as-ai-continues-to-roll",
    "summary": "Sandisk and other key suppliers of 3D NAND are projected to significantly increase prices of enterprise-grade 3D NAND memory in the coming months due to overwhelming demand from the AI sector."
  },
  {
    "title": "Audeze launches Maxwell 2 headset, with better spatial immersion and bass   plus, of course, improved AI noise-canceling mic tech",
    "link": "https://www.tomshardware.com/peripherals/gaming-headsets/audeze-launches-maxwell-2-headset-with-better-spatial-immersion-and-bass-plus-of-course-improved-ai-noise-canceling-mic-tech",
    "summary": "Audeze launched its new Maxwell 2 planar magnetic gaming headset at CES 2026, with improved audio and mic technology, and swappable side plates."
  },
  {
    "title": "Nvidia to demand full upfront payment for H200 GPUs from China customers, report claims    more than two million chips may have been ordered despite uncertain Beijing stance",
    "link": "https://www.tomshardware.com/pc-components/gpus/nvidia-to-demand-full-upfront-payment-for-h200-gpus-from-china-customers-report-claims-more-than-two-million-chips-may-have-been-ordered-despite-uncertain-beijing-stance",
    "summary": "Nvidia has reportedly imposed non-refundable, full upfront payment terms on H200 GPU sales to China-based clients to hedge regulatory risks as Chinese customers had ordered more than 2 million H200 units that the company yet has to make."
  },
  {
    "title": "MSI unlocks the full power of AMD CPUs with new MEG X870E Unify-X Max motherboard   premium Ryzen overclocking comes to AM5",
    "link": "https://www.tomshardware.com/pc-components/motherboards/msi-unlocks-the-full-power-of-amd-cpus-with-new-meg-x870e-unify-x-max-motherboard-premium-ryzen-overclocking-comes-to-am5",
    "summary": "MSI showcases the long-awaited MEG X870E Unify-X Max motherboard for Ryzen processors at CES 2026."
  },
  {
    "title": "Keyboard giant Keychron unveils new Nape Pro trackball with programmable buttons   low profile design promotes ergonomic scrolling without leaving your keyboard",
    "link": "https://www.tomshardware.com/peripherals/mice/keyboard-giant-keychron-unveils-new-nape-pro-trackball-with-programmable-buttons-low-profile-design-promotes-ergonomic-scrolling-without-leaving-your-keyboard",
    "summary": "Keychron's Nape Pro made an appearance at CES 2026."
  },
  {
    "title": "AMD claims Panther Lake has 'too much baggage' for handheld PC use   fights back after Intel jabs AMD for using 'ancient silicon' in its Z2 series APUs",
    "link": "https://www.tomshardware.com/pc-components/cpus/amd-claims-panther-lake-has-too-much-baggage-for-handheld-pc-use-fights-back-after-intel-jabs-amd-for-using-ancient-silicon-in-its-z2-series-apus",
    "summary": "AMD jabs Intel for calling its Z2 chips \"ancient\". Claims its Panther Lake mobile chips carry too much \"baggage\" for handheld gaming use."
  },
  {
    "title": "Best of CES 2026: Innovating amidst the RAM and storage apocalypse",
    "link": "https://www.tomshardware.com/pc-components/best-of-ces-2026-innovating-amidst-the-ram-and-storage-apocalypse",
    "summary": "CES 2026 was constrained by the RAM and storage demands of AI hyperscalers, limiting consumer GPU and storage launches. But there was still plenty of innovation to be found, including Intel s new Core Ultra Series 3 laptop CPUs, brighter, bigger, and faster monitors, and exciting new PC cases and peripherals."
  },
  {
    "title": "Creality SPARKX i7 Review: Not just another color bedslinger",
    "link": "https://www.tomshardware.com/3d-printing/creality-sparkx-i7-review",
    "summary": "Creality s newest bedslinger is not an Ender, or is it?"
  },
  {
    "title": "Cooler Master introduces the Aquagate MAX Retro Mini cooling unit   delivers massive cooling capacity up to 2,500 watts",
    "link": "https://www.tomshardware.com/pc-components/liquid-cooling/cooler-master-introduces-the-aquagate-max-retro-mini-cooling-unit-delivers-massive-cooling-capacity-up-to-2-500-watts",
    "summary": "Cooler Master showed off a desktop coolant distribution unit at CES 2026. This unit is designed to deliver 900 to 2,500 watts of cooling performance, letting users maximize the power of high-performance desktop systems."
  },
  {
    "title": "Micron to begin work on $100 billion New York 'megafab' imminently   landmark site to produce 40% of company's overall DRAM output in the U.S. by the 2040s",
    "link": "https://www.tomshardware.com/pc-components/dram/micron-to-begin-work-on-usd100-billion-new-york-megafab-imminently-landmark-site-to-produce-40-percent-of-companys-overall-dram-output-in-the-u-s-by-the-2040s",
    "summary": "After numerous delays, Micron is about to start building its $100 billion site in New York to produce 40% of its DRAM output in the U.S. in the 2040s."
  },
  {
    "title": "CES 2026 Day 2: Dell s massive 52-inch 6K monitor, AMD unbothered by Intel s new Arc B390 IGP, MSI PSUs guard against RTX 5090 meltdowns",
    "link": "https://www.tomshardware.com/pc-components/ces-2026-day-2-dells-massive-52-inch-6k-monitor-amd-unbothered-by-intels-new-arc-b390-igp-msi-psus-guard-against-rtx-5090-meltdowns",
    "summary": "Day 2 coverage from CES 2026 is here."
  },
  {
    "title": "Samsung and Intel co-develop 'SmartPower HDR' for Panther Lake OLED laptops, with up to 22% power savings   dynamic voltage control lowers power without sacrificing panel brightness",
    "link": "https://www.tomshardware.com/laptops/samsung-and-intel-co-develop-smartpower-hdr-for-panther-lake-oled-laptops-with-up-to-22-percent-power-savings-dynamic-voltage-control-lowers-power-without-sacrificing-panel-brightness",
    "summary": "SmartPower HDR will use up to 22% less power, leading to 30-40 minutes of extra battery life on Panther Lake laptops. Co-developed by Samsung and Intel, this tech enables dynamic voltage control on OLED laptop screens where the panel only draws more voltage when explicitly needed for high-brightness HDR content, even if HDR is on system-wide in Windows."
  },
  {
    "title": "Boxes of 100 server-grade DDR5 memory now cost as much as property in Shanghai in China spot market   single 256GB server sticks now over $5,700",
    "link": "https://www.tomshardware.com/pc-components/ddr5/boxes-of-100-ddr5-server-memory-sticks-in-china-now-priced-like-shanghai-apartments",
    "summary": "In China s spot market, vendors are quoting prices that put a box of 100 high-capacity DDR5 server memory modules at roughly 5 million yuan,"
  },
  {
    "title": "Major Japanese electronics store begs customers for their old PCs as hardware drought continues    we pretty much buy any PC  pleads the Akihabara outlet",
    "link": "https://www.tomshardware.com/desktops/pc-building/major-japanese-electronics-store-begs-customers-for-their-old-pcs-as-hardware-drought-continues-we-pretty-much-buy-any-pc-pleads-the-akihabara-outlet",
    "summary": "A major Japanese PC and electronics store is pleading with customers to sell it their old PC gear."
  },
  {
    "title": "China expected to approve H200 imports in early 2026, report claims   tech giants Alibaba and ByteDance reportedly ready to order over 200,000 Nvidia chips each if green-lit by Beijing",
    "link": "https://www.tomshardware.com/tech-industry/china-expected-to-approve-h200-imports-in-early-2026-report-claims-tech-giants-alibaba-and-bytedance-reportedly-ready-to-order-over-200-000-nvidia-chips-each-if-green-lit-by-beijing",
    "summary": "Beijing is reportedly allowing its tech giants to acquire H200 chips, even as the Chinese government is still deliberating how to go about balancing the AI processing needs of its AI tech giants and the local semiconductor industry."
  },
  {
    "title": "Patriot shows off opulent Viper Xtreme 5 Aurum RAM kit with flashy finish as prices surge throughout industry   company also showcases new SSDs and MicroSD Express card for Switch 2",
    "link": "https://www.tomshardware.com/pc-components/ram/patriot-shows-off-opulent-viper-xtreme-5-aurum-ram-kit-with-flashy-finish-as-prices-surge-throughout-industry-company-also-showcases-new-ssds-and-microsd-express-card-for-switch-2",
    "summary": "Patriot showed off a host of its latest SSD and RAM kits at CES 2026, and the company also offered a sneak peek of its rapid DDR5-10000 RAM kit, which is currently under development."
  },
  {
    "title": "Upgraded Sipeed NanoKVM-USB USB KVM solution gains 4K 60 FPS video capture and HDMI loop output",
    "link": "https://www.cnx-software.com/2026/01/12/upgraded-sipeed-nanokvm-usb-usb-kvm-solution-gains-4k-60-fps-video-capture-and-hdmi-loop-output/",
    "summary": "Sipeed has released a new variant of its NanoKVM-USB low-cost USB KVM adapter, which upgrades 2K 30 FPS capture and 4Kp30 loop out to 4K 60 FPS capture and 4Kp60 HDMI loop output. The new NanoKVM-USB 4K keeps the same ports as the earlier model, with HDMI and USB-C inputs connected to the target, and another USB-C port that connects to the host, in order to remotely control the target with keyboard, mouse, and monitor emulation. A USB Type-A port that can switch between host and target modes is also implemented, for instance, to share a USB drive between the two systems. NanoKVM USB 4K specifications: Video Input/Output HDMI input up to 4Kp60 from target device (no changes here) HDMI loop output up to 4Kp60 for optional connection to a monitor USB USB Type-C port for connection to the target device for keyboard/mouse emulation USB 3.0 Type-C port for connection [...] The post Upgraded Sipeed NanoKVM-USB USB KVM solution gains 4K 60 FPS video capture and HDMI loop output appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Milk-V Titan   A $329 octa-core 64-bit RISC-V mini-ITX motherboard with a PCIe Gen4 x16 slot",
    "link": "https://www.cnx-software.com/2026/01/12/milk-v-titan-a-329-octa-core-64-bit-risc-v-mini-itx-motherboard-with-a-pcie-gen4-x16-slot/",
    "summary": "We first noted the UltraRISC UR-DP1000-powered Milk-V Titan mini-ITX motherboard when we wrote an article about three high-performance RISC-V processors to watch in H2 2025. There have been some delays, as there often are, but the Titan board finally appears to be in stock, so it s probably a good time to have a closer look. Powered by a 2 GHz UR-DP1000 octa-core RISC-V CPU, the Titan mini-ITX motherboard supports up to 64GB DIMM memory and M.2 NVMe storage (PCIe Gen4 x4), and features a PCIe Gen4 x16 slot for a graphics card or other expansion, Gigabit Ethernet, four USB 3.0 ports, a BMC, and more. Milk-V Titan specifications: CPU UltraRISC UR-DP1000 8x 64-bit RISC-V UR-CP100 RV64GCBHX cores up to 2.0 GHz Two 4x core cluster design with 4MB L3 cache each, and a total of 16MB cache. Fully RVA22 compliant, and Compliant with RVA23 excluding V extension. Supports Hardware [...] The post Milk-V Titan A $329 octa-core 64-bit RISC-V mini-ITX motherboard with a PCIe Gen4 x16 slot appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Xibo open-source digital signage solution now works with Raspberry Pi 5 thanks to the Arexibo project",
    "link": "https://www.cnx-software.com/2026/01/12/xibo-open-source-digital-signage-solution-now-works-with-raspberry-pi-5-thanks-to-the-arexibo-project/",
    "summary": "Xibo digital signage solution is now compatible with the Raspberry Pi 5 thanks to Axeribo, an unofficial alternative to the digital signage player for Xibo, that is implemented in Rust, and designed for Linux platforms. Long-time readers of CNX Software may remember that I played around with the Xibo open-source digital signage player many years ago (2011-2012). I notably managed to run Xibo for Arm in QEMU, test Xibo digital signage in the Raspberry Pi emulator, and even try it on real hardware: a MeLE A1000 Android TV box to which I installed Linux. It kind of works, but without hardware video decoding and no 3D graphics acceleration, performance was rather on the low side. I eventually stopped playing around with Xibo Arm Linux once Xibo for Android was released in late 2012, and the developers decided to drop support for the Linux client (although they relaunched it in 2019 [...] The post Xibo open-source digital signage solution now works with Raspberry Pi 5 thanks to the Arexibo project appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "LILYGO T-Beam 1W   An ESP32-S3 + SX1262 high-power LoRa dev board with 32 dBm output, GNSS support",
    "link": "https://www.cnx-software.com/2026/01/12/lilygo-t-beam-1w-an-esp32-s3-sx1262-high-power-lora-dev-board-with-32-dbm-output-gnss-support/",
    "summary": "The LILYGO T-Beam-1W is an ESP32-S3-based high-power LoRa development board featuring an SX1262 RF transceiver, an onboard 1W power amplifier (32 dBm), a L76K GNSS module, a 1.3-inch SH1106 OLED, a microSD slot, USB-C, Qwiic connectors, and an AXP2101 PMU. The board runs on a 7.4V battery and includes a cooling fan for high-power RF operation. We first wrote about the original LILYGO T-Beam (then branded as TTGO) in 2018, and since then, the company introduced various revisions of the T-Beam as it became popular. The T-Beam 1W is the most powerful version so far, with a built-in 1 Watt amplifier that allows the board to transmit data over longer distances without needing to buy separate, bulky amplifiers. LilyGO T-Beam-1W Specifications: Core module Espressif Systems ESP32-S3-WROOM-1 SoC ESP32-S3 CPU Dual-core LX7 processor with up to 240MHz Memory 512KB SRAM, 8MB PSRAM Storage 384KB ROM Wireless [...] The post LILYGO T-Beam 1W An ESP32-S3 + SX1262 high-power LoRa dev board with 32 dBm output, GNSS support appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "AMD Embedded+ mini-ITX Board features Ryzen AI Embedded P132 CPU, Versal AI Edge Gen2 VE3558 SoC FPGA",
    "link": "https://www.cnx-software.com/2026/01/11/amd-embedded-mini-itx-board-features-ryzen-ai-embedded-p132-cpu-versal-ai-edge-gen2-ve3558-soc-fpga/",
    "summary": "At CES 2026, Sapphire Technology introduced the EDGE+VPR-7P132, an AMD Embedded+ Mini-ITX motherboard built around AMD s newly announced Ryzen AI Embedded P100 series of SoCs, namely the hexa-core Ryzen P132 (V4526iX) CPU, and an AMD Versal AI Edge Gen 2 VE3558 SoC FPGA, which features octa-core Arm Cortex-A78AE + ten Cortex-R52 real-time cores beyond FPGA fabric. It s the first AMD Ryzen AI Embedded motherboard we ve seen. It represents a massive update from last year s Edge+ VPR-5050 motherboard, which relied on Zen 2-based Ryzen Embedded V2000 series and first-generation Versal silicon. The new VPR-7P132 skips multiple generations, jumping straight to Zen 5 CPU cores and RDNA 3.5 graphics, with an upgraded Versal Gen 2 adaptive Edge AI SoC for real-time inference, along with faster LPDDR5 (4266MHz) memory and 40 Gbps USB4 connectivity. SapphireTech EDGE+ VPR-7P132-MB specifications: AMD Embedded+ Architecture Adaptive SoC Subsystem Adaptive SoC AMD Versal AI Edge Gen 2 [...] The post AMD Embedded+ mini-ITX Board features Ryzen AI Embedded P132 CPU, Versal AI Edge Gen2 VE3558 SoC FPGA appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "XIAO ePaper DIY Kit   EE02   An ESP32-S3 board designed for 13.3-inch Spectra 6 color E-Ink display",
    "link": "https://www.cnx-software.com/2026/01/10/xiao-epaper-diy-kit-ee02-an-esp32-s3-board-designed-for-13-3-inch-spectra-6-color-e-ink-display/",
    "summary": "Seeed Studio s XIAO ePaper DIY Kit EE02 is an ESP32-S3 WiFi and Bluetooth board designed specifically for the 13.3-inch Spectra 6 color E-Ink display provided by the company. It s based on a similar design as the XIAO ePaper DIY Kit-EE04 (ESP32-S3) and XIAO ePaper DIY Kit-EN04 (nRF52480) introduced last December, which are suitable for smaller 1.54 to 7.15-inch ePaper displays. Like the previous models, the new EE02 model also includes a battery connector with a power switch, a built-in charging IC, and comes with one reset and three user buttons. With support for a larger 13.3-inch color ePaper display, it s especially well-suited for digital frames and information boards. XIAO ePart DIY kit EE02 specifications: Wireless board XIAO ESP32S3 Plus SoC Espressif ESP32-S3R8 CPU Dual-core Tensilica LX7 microcontroller up to 240 MHz with vector instructions for AI acceleration Memory 8MB PSRAM Wireless WiFi 4 and Bluetooth [...] The post XIAO ePaper DIY Kit EE02 An ESP32-S3 board designed for 13.3-inch Spectra 6 color E-Ink display appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Home Assistant-compatible Makerfabs ESP32-S3-based energy meter features BL0942 energy metering IC",
    "link": "https://www.cnx-software.com/2026/01/09/home-assistant-compatible-makerfabs-esp32-s3-based-energy-meter-features-bl0942-energy-metering-ic/",
    "summary": "The Energy Meter for Home Assistant is an ESP32-S3-based single-phase energy monitoring and control module designed to work with Home Assistant via ESPHome. It measures real-time power and energy consumption and also has a remote on/off control. The device is built around the BL0942 calibration-free energy metering IC, which supports voltage, current, power, and energy measurements with less than 1% error. It operates directly from AC 100 240V, includes an onboard 15A relay for switching loads, and provides electrical isolation for safety. Connectivity is done through USB and Wi-Fi using ESPHome for easy firmware flashing, API encryption, and automatic discovery in Home Assistant. These features make it suitable for smart homes, DIY energy monitoring, smart sockets, home energy dashboards, and automation projects. Energy Meter for Home Assistant specifications: Core module Espressif Systems ESP32-S3-WROOM-1 SoC ESP32-S3 CPU Dual-core Tensilica LX7 up to 240 MHz with vector extension for AI/ML workloads [...] The post Home Assistant-compatible Makerfabs ESP32-S3-based energy meter features BL0942 energy metering IC appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "SECO s COM Express Type 6 module features Intel Core Ultra Series 3 Panther Lake-H processor with up to 180 TOPS",
    "link": "https://www.cnx-software.com/2026/01/09/seco-com-express-type-6-module-features-intel-core-ultra-series-3-panther-lake-h-processor-with-up-to-180-tops/",
    "summary": "We have just covered Vecow s new TGS-2000 series of Edge AI computers built around Intel s new Panther Lake-H SoCs, and now SECO has announced the SOM-COMe-BT6-PTL, a COM Express Type 6 Basic module which supports the higher-end 16-core Core Ultra X9 series processors and can deliver up to 180 TOPS of AI performance. The module follows the COM Express Release 3.1 Type 6 Basic form factor (125 95 mm), supports up to 128GB DDR5 memory via dual SO-DIMM slots, offers high-speed expansion through PCIe Gen4/Gen5, USB 4.0/Thunderbolt, and 2.5Gbps Ethernet, and provides multiple display interfaces including eDP, DP++, and HDMI. It is available with an optional industrial temperature range and is designed for rugged and mission-critical applications. SECO SOM-COMe-BT6-PTL Specifications: Panther Lake SoC (one or the other) Intel Core Ultra X9 388H 16-core (4P + 8E + 4LPE) processor up to 1.6 GHz / 5.1 GHz (Turbo), 18MB cache, [...] The post SECO s COM Express Type 6 module features Intel Core Ultra Series 3 Panther Lake-H processor with up to 180 TOPS appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "6-core Intel Wildcat Lake Core Series 3 CPUs to succeed Alder Lake-N and Twin Lake families",
    "link": "https://www.cnx-software.com/2026/01/09/6-core-intel-wildcat-lake-core-series-3-cpus-to-succeed-alder-lake-n-and-twin-lake-families/",
    "summary": "When I wrote the Year 2025 in review post, I expected an announcement for the Wildcat Lake CPUs at CES 2026, but instead, Intel initially introduced the high-end Core Ultra Series 3 Panther Lake family. I assumed the Wildcat Lake announcement was postponed, but some users reports on X indicate the company did demonstrate the new Core Series 3 (no Ultra there) Wildcat Lake processors as lower-end Core Series 3 Panther Lake SKUs. Intel has yet to disclose part names, and there s nothing about the Wildcat Lake on Intel Ark at the time of writing. However, some information was shared through slides and X users. Intel Core Series 3 Wildcat Lake key features and specifications: CPU Hexa-core processor with 2x Cougar Cover P-cores (Performance cores), 4x Darkmont LPE-cores (Low-Power Efficient cores) GPU 2x Xe-core Intel Xe3 graphics (no ray tracing, not designed for gaming) AI accelerator Intel [...] The post 6-core Intel Wildcat Lake Core Series 3 CPUs to succeed Alder Lake-N and Twin Lake families appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Quectel SRG091X and SRG093X NXP i.MX 9 industrial AIoT modules integrates Wi-Fi 6, Bluetooth 5.4, and 802.15.4 radios",
    "link": "https://www.cnx-software.com/2026/01/09/quectel-srg091x-and-srg093x-nxp-i-mx-9-industrial-aiot-modules-integrates-wi-fi-6-bluetooth-5-4-and-802-15-4-radios/",
    "summary": "After releasing the very powerful P895BD-AP AIoT module at CES 2026, Quectel now released two new low-power industrial AIoT modules based on NXP s i.MX 9 series SoCs. The module integrates Wi-Fi 6, Bluetooth 5.4, and 802.15.4 radios through the IW610G chipset, so it can simply be dropped into a PCB to create a fully compliant Matter Border Router without any RF design or coexistence concerns. While both modules share the same 46 x 41.5 mm form factor and wireless capabilities, they are different in terms of CPU power as the SRG091X is an entry-level solution built around a single-core NXP i.MX 91 processor, while the SRG093X features dual-core NXP i.MX 93 SoC, which includes a Cortex-M33 real-time core and a neural processing unit (NPU) for edge AI workloads. The module supports LPDDR4/LPDDR4X memory, eMMC storage, and various I/O options, including dual Gigabit Ethernet, USB 2.0, CAN-FD, SPI, UART, I C/I C, ADC, [...] The post Quectel SRG091X and SRG093X NXP i.MX 9 industrial AIoT modules integrates Wi-Fi 6, Bluetooth 5.4, and 802.15.4 radios appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "MUSE Book laptop review   Testing an octa-core RISC-V Linux laptop in 2026",
    "link": "https://www.cnx-software.com/2026/01/08/muse-book-laptop-review-testing-an-octa-core-risc-v-linux-laptop-in-2026/",
    "summary": "SpacemiT sent me a sample of the MUSE Book RISC-V Linux laptop for review. It s based on the SpacemiT K1/M1 octa-core 64-bit RISC-V SoC, ships with up to 16 GB of RAM, eMMC flash and/or NVMe SSD, and features a 14.1-inch IPS display with 1920 1080 resolution, WiFi 6 connectivity, a few USB ports, and more. I won t go through all the hardware specifications since Leo already did that when he wrote about the MUSE Book Laptop in April 2024, along with a teardown, and additional details about the SpacemiT K1/M1 SoC. I ll still do an unboxing and quickly check the hardware, but I ll focus on the software part to show the progress with Bianbu OS 2.3 (Ubuntu 24.04-based) on RISC-V hardware, as I just did for the low-end StarFive JH7110S-based VisionFive 2 Lite SBC. It s quite a long review, so if you are short on time, you can jump directly [...] The post MUSE Book laptop review Testing an octa-core RISC-V Linux laptop in 2026 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Reolink Floodlight 4K Smart PoE and WiFi 6 security cameras add on-device LLM for natural language video search",
    "link": "https://www.cnx-software.com/2026/01/08/reolink-floodlight-4k-smart-poe-security-cameras-add-on-device-llm-for-natural-language-video-search/",
    "summary": "Reolink has introduced the Elite Floodlight WiFi and Elite Pro Floodlight PoE, two new 4K security cameras with high-resolution video, integrated floodlights, PoE support (on the Pro model), and an on-device Large Language Model (LLM), which enables natural-language video search instead of basic object detection. We have reviewed various Reolink cameras over the years, such as the Argus PT Ultra, Reolink TrackMix PoE, and the RLC-810A, which features Smart Detection to the edge, allowing the camera to distinguish between people, vehicles, and pets without sending data to the cloud. However, they are limited to those fixed categories, and if you wanted to find something specific, like a red shirt or a delivery truck, you still had to scroll through the timeline manually, or rely on a networked video recorder (NVR). Reolink is now trying to solve that by integrating a Large Language Model (LLM) directly into their new Elite Floodlight [...] The post Reolink Floodlight 4K Smart PoE and WiFi 6 security cameras add on-device LLM for natural language video search appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Intel Core Ultra Series 3 Panther Lake-H CPU powers TGS-2000 series stackable Edge AI computers",
    "link": "https://www.cnx-software.com/2026/01/08/intel-core-ultra-series-3-panther-lake-h-cpu-powers-tgs-2000-series-stackable-edge-ai-computers/",
    "summary": "At CES 2026, Intel unveiled the Core Ultra Series 3 processors, codenamed Panther Lake-H, built on the Intel 18A (1.8-nanometer class) process, and targeting both consumer and industrial applications. Vecow introduced one of the first industrial Panther Lake-H platforms with the TGS-2000 series, a new family of ultra-compact, stackable Edge AI computers designed for high-performance space-constrained applications and based on either the 16-core Intel Core Ultra 9 386H or 12-core Intel Core Ultra 5 336H SoC. This new 2000 series is an upgrade of the previous TGS-1000 series, which was launched in 2024 with Intel Meteor Lake processors. While the overall design stays mostly the same, the transition to Core Ultra Series 3 enhances AI performance, reaching up to 100 TOPS combined performance with the selected SKUs (note: the top-end Panther Lake-H CPU can deliver up to 180 TOPS). The TGS-2000 Series is available in three variants, including the fanless [...] The post Intel Core Ultra Series 3 Panther Lake-H CPU powers TGS-2000 series stackable Edge AI computers appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "AMD launches Ryzen AI Embedded P100 and X100 processors with up to 50 TOPS of AI performance",
    "link": "https://www.cnx-software.com/2026/01/07/amd-launches-ryzen-ai-embedded-p100-and-x100-processors-with-up-to-50-tops-of-ai-performance/",
    "summary": "AMD has introduced the Ryzen AI Embedded P100 and X100 x86 processors designed to power AI-driven applications at the edge, such as automotive digital cockpits, smart healthcare equipment, and humanoid robotics. AMD had previously launched several Ryzen Embedded families, starting with the Ryzen Embedded V1000 in 2018, and more recently, the Ryzen Embedded 8000 family with a 16 TOPS NPU, yet without AI in the name. The new AMD Ryzen AI Embedded family is based on high-performance Zen 5 core architecture, an RDNA 3.5 GPU for real-time visualization and graphics, and an XDNA 2 NPU for low-latency, low-power AI acceleration. The P100 Series processors target in-vehicle infotainment and industrial automation, while the X100 Series processors feature higher CPU core counts and AI TOPS performance for more demanding physical AI and autonomous systems. Six models are currently available in the Ryzen AI Embedded P100 family: AMD Ryzen AI P121, P123, P121i, [...] The post AMD launches Ryzen AI Embedded P100 and X100 processors with up to 50 TOPS of AI performance appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Quectel SP895BD-AP AIoT module features Qualcomm Dragonwing Q-8750 SoC with 80 TOPS NPU",
    "link": "https://www.cnx-software.com/2026/01/07/quectel-sp895bd-ap-aiot-module-features-qualcomm-dragonwing-q-8750soc-with-80-tops-npu/",
    "summary": "Just yesterday, we wrote about the Qualcomm Dragonwing Q 7790 and Q 8750 AIoT SoCs, and on the same day, Quectel launched the SP895BD-AP smart AIoT module based on the Dragonwing Q-8750. It is designed for high-performance IoT applications, including video conferencing, 8K computing power boards, and smart retail terminals, running on Android 15 or Linux. Earlier in November, we saw Qualcomm introduce the Dragonwing IQ-X series of SoCs for industrial PCs running Windows. The Q-8750 in the Quectel SP895BD-AP seems to be a variant of the high-end version, with an 8-core Oryon CPU (up to 2x 4.32 GHz + 6x 3.53 GHz) and an Adreno Series 8 GPU. It supports 8K video encoding and decoding with three ISPs for up to 3 48MP camera inputs, or a single camera input of 108MP. The module comes in a compact LGA package and supports standard interfaces like MIPI DSI/CSI, PCIe, USB, I2S, UART, I C, [...] The post Quectel SP895BD-AP AIoT module features Qualcomm Dragonwing Q-8750 SoC with 80 TOPS NPU appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Nordic Semi nRF54LM20B wireless SoC integrates 128 MHz Axon NPU for Edge AI workloads",
    "link": "https://www.cnx-software.com/2026/01/07/nordic-semi-nrf54lm20b-wireless-soc-integrates-128-mhz-axon-npu-for-edge-ai-workloads/",
    "summary": "Nordic Semi nRF54ML20B Arm Cortex-M33 wireless SoC is the first nRF54L microcontroller to integrate the ultra-efficient Axon Neural Processing Unit (NPU) for edge AI workloads. The NPU is said to deliver up to 7 times faster performance and up to 8 times higher energy efficiency versus (unnamed) competing wireless solutions for tasks such as sound classification, keyword spotting, and image-based detection. The Axon NPU is also about 15x faster compared to using the Cortex-M33 CPU for the same task. Other than the NPU, the nRF54LM20B offers exactly the same features as the earlier nRF54LM20A wireless microcontroller, including up to 2 MB NVM, 512 KB RAM, a 128 MHz Arm Cortex-M33 plus RISC-V coprocessor, high-speed USB, up to 66 GPIOs, and an ultra-low-power 2.4 GHz radio supporting Bluetooth LE, Bluetooth Channel Sounding, Matter over Thread, and more as shown in the nRF54L comparison table below. Like other nRF54L wireless SoCs, the [...] The post Nordic Semi nRF54LM20B wireless SoC integrates 128 MHz Axon NPU for Edge AI workloads appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "STM32MP21 Arm Cortex-A35/M33 MPU targets cost-effective applications in smart factories, homes, and cities",
    "link": "https://www.cnx-software.com/2026/01/07/stm32mp21-arm-cortex-a35-m33-mpu-targets-cost-effective-applications-in-smart-factory-homes-and-factories/",
    "summary": "STMicroelectronics STM32MP21 microprocessor family combines a 1.5 GHz 64-bit Arm Cortex-A35 application core with a 300 MHz 32-bit Arm Cortex-M33 core for real-time processing. It is designed for cost-aware edge applications in smart factories, smart homes, and smart cities. The new STM32MP21 is a cost-optimized version of the earlier STM32MP23 and STM32MP25 that does without an AI accelerator (yes, those still exist!), GPU, H.264 decoder and encoder, or PCIe Gen2 / USB 3.0 interfaces. It still offers a MIPI CSI-2 camera interface, two Gigabit Ethernet interfaces with Time-Sensitive Networking (TSN), and strong security targeting SESIP Level 3 and PCI pre-certification. STM32MP21 specifications: CPU Arm Cortex-A35 core running at up to 1.2 or 1.5 GHz with 128KB L2 cache Real-time MCU Arm Cortex-M33 core with FPU/MPU running at up to 300 MHz GPU None VPU None AI accelerator None Memory 456 KB SRAM 256KB AXI SYSRAM [...] The post STM32MP21 Arm Cortex-A35/M33 MPU targets cost-effective applications in smart factories, homes, and cities appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Espressif Systems showcases ESP32-E22 Wi-Fi 6E SoC and ESP32-H21 BLE MCU for battery-powered devices",
    "link": "https://www.cnx-software.com/2026/01/07/espressif-systems-showcases-esp32-e22-wi-fi-6e-soc-and-esp32-h21-ble-mcu-for-battery-powered-devices/",
    "summary": "Espressif Systems is showcasing its products at CES 2026, including two interesting upcoming parts: the ESP32-E22 Wi-Fi 6E tri-band SoC and the ultra-low-power ESP32-H21 Bluetooth LE MCU for battery-powered devices. Espressif Systems has been teasing an upcoming Wi-Fi 6E SoC for several months, but so far, there have been very few details. Once tipped that the ESP32-E22 tri-band Wi-Fi 6E SoC was demonstrated at CES 2026, I headed over to X and noticed tks posted a few interesting photos from the exhibition. Here s what we know about the ESP32-E22 so far: CPU Dual-core RISC-V processor at up to 500 MHz Memory 1 MB (no optional PSRAM) Wireless Tri-band 2.4/5/6GHz Wi-Fi 6E, 160 MHz channel bandwidth, 2 2 MIMO; tested with iperf; up to 2.1 Gbps physical thoughput Dual-mode Bluetooth 5.4/6.0 (LE + BR/EDR) I/Os 41x GPIO Host interfaces PCIe 2.0, USB FS OTG, SDIO 3.0 (when used [...] The post Espressif Systems showcases ESP32-E22 Wi-Fi 6E SoC and ESP32-H21 BLE MCU for battery-powered devices appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Snapdragon X2 Plus 6-core and 10-core processors target low-power Windows Copilot+ PCs",
    "link": "https://www.cnx-software.com/2026/01/07/snapdragon-x2-plus-6-core-and-10-core-processors-target-low-power-windows-copilot-pcs/",
    "summary": "After announcing the high-end Snapdragon X2 Elite Extreme and X2 Elite processors last year, Qualcomm has now introduced the mid-range Snapdragon X2 Plus platform at CES 2026. While the Elite SKUs target premium laptops, the X2 Plus series is designed for affordable, mainstream Windows 11 Copilot+ PCs. The new lineup includes the X2P-64-100 (10-core) and the X2P-42-100 (6-core), both manufactured on a 3nm process. What s interesting is that they share the same 80 TOPS AI accelerator, 9523 MT/s LPDDR5x memory support, Snapdragon X75 5G modem, and FastConnect 7800 WiFi 7 and Bluetooth 5.4 as the flagship Elite models. This means that the X2 Plus reduces CPU core counts and GPU frequencies to maximize battery life for thin-and-light Windows 11 Copilot+ laptops, but it does not compromise on I/O, media capabilities, or AI performance, as it features the same USB4, PCIe Gen5, and AV1 video support as the top-tier models. Snapdragon [...] The post Snapdragon X2 Plus 6-core and 10-core processors target low-power Windows Copilot+ PCs appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Broadcom updates its Wi-Fi 8 access point chips portfolio with BCM4918 APU, BCM6714 and BCM6719 dual-band radios",
    "link": "https://www.cnx-software.com/2026/01/06/broadcom-updates-its-wi-fi-8-access-point-portfolio-with-bcm4918-apu-bcm6714-and-bcm6719-dual-band-chips/",
    "summary": "Broadcom has just announced the launch of its next-generation chips for Wi-Fi 8 access points at CES 2026 with the BCM4918 Accelerated Processing Unit (APU), and two new dual-band Wi-Fi 8 radios: BCM6714 and BCM6719. The last two build upon the Broadcom BCM6718 WiFi 8 tri-band SoC with different antenna configurations, namely 4 4 2.4GHz and 4 4 5 GHz for the BCM6719, and 3 3 2.4GHz and 4 4 5 GHz for the BCM6714, and integrated 2.4 GHz PAs. The AP4918 builds upon the AP4916, but I was unable to obtain information about the improvements from a company representing Broadcom. Broadcom BCM4918 Wi-Fi 8 APU BCM4918 key features: High-performance Quad-core Armv8 CPU complex for general-purpose software workloads Integrated Broadcom Neural Engine (BNE) for on-device AI/ML inference and acceleration Advanced networking engines to offload both wired and wireless data paths, enabling complete CPU bypass of all networking traffic Integrated cryptographic protocol acceleration end-to-end data [...] The post Broadcom updates its Wi-Fi 8 access point chips portfolio with BCM4918 APU, BCM6714 and BCM6719 dual-band radios appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP32-S3 development board features 4.2-inch Reflective LCD (RLCD), dual microphone array, onboard speaker",
    "link": "https://www.cnx-software.com/2026/01/06/esp32-s3-development-board-features-4-2-inch-reflective-lcd-rlcd-dual-microphone-array-onboard-speaker/",
    "summary": "Waveshare ESP32-S3-RLCD-4.2 is a 4.2-inch Reflective LCD (RLCD) development board built around ESP32-S3 wireless SoC for DIY projects, rapid prototyping, and smart display devices that need a paperlike experience with a higher refresh rate compared to e-paper displays. The ESP32-S3 provides 2.4 GHz Wi-Fi and Bluetooth 5 LE connectivity, and the board also includes a dual microphone array with ES7210 ADC and ES8311 audio codec, as well as an onboard speaker for AI voice interaction. Other features include an SHTC3 temperature and humidity sensor, a PCF85063 RTC, a microSD card slot for storage, along with multiple GPIO, UART, and I C expansion headers. Power, programming, and battery charging are done through the USB Type-C port connected to an optional 18650 battery. Applications include electronic calendars, desktop displays, voice-based devices, environmental monitoring, and low-power indoor or outdoor display systems. ESP32-S3-RLCD-4.2 specifications Core module Espressif Systems ESP32-S3-WROOM-1-N16R8 SoC ESP32-S3 CPU Dual-core [...] The post ESP32-S3 development board features 4.2-inch Reflective LCD (RLCD), dual microphone array, onboard speaker appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "NVIDIA Jetson T4000 Edge AI embedded system offers 5GbE networking, four PoE camera ports, DIO, CAN Bus, and more",
    "link": "https://www.cnx-software.com/2026/01/06/nvidia-jetson-t4000-edge-ai-embedded-system-offers-5gbe-networking-four-poe-camera-ports-dio-can-bus-and-more/",
    "summary": "AAEON BOXER-8742AI is a fanless Edge AI embedded system powered by an NVIDIA Jetson T4000 that was unveiled along with the Jetson Thor T5000 module last August, but officially launched at CES 2026. The Jetson T4000 is a weaker variant, but it s still extremely powerful with up to 1200 TFLOPS of AI computing power against 2070 TFLOPS for the T5000. The BOXER-8742AI features a 5GbE port, four Gigabit Ethernet RJ45 PoE ports suitable for IP cameras, DIO, RS232, RS485, and CAN Bus interfaces, four USB 3.2 Gen 2 ports, HDMI video output, and more. It s suitable for high-performance edge AI applications such as smart factory automation, AMR, and AI-assisted roadside unit solutions. AAEON BOXER-8742AI specifications: System-on-Module NVIDIA Jetson T4000 CPU 12-core 64-bit Arm Neoverse-V3AE GPU 1536-core NVIDIA Blackwell GPU with 64 Tensor Cores, 6-TPC MIG VPU Video Decode 4x 8Kp30 (H.265), 10x 4Kp60 (H.265), 22x 4Kp30 [...] The post NVIDIA Jetson T4000 Edge AI embedded system offers 5GbE networking, four PoE camera ports, DIO, CAN Bus, and more appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Qualcomm Dragonwing Q 7790 and Q 8750 AIoT SoCs target AI-enhanced drones, cameras, TVs and media hubs",
    "link": "https://www.cnx-software.com/2026/01/06/qualcomm-dragonwing-q-7790-and-q-8750-aiot-socs-target-ai-enhanced-drones-cameras-tvs-and-media-hubs/",
    "summary": "Qualcomm has made a range of announcements at CES 2026, and notably introduced the Dragonwing Q 7790 and Q 8750 processors supporting on device AI for drones, smart cameras & industrial vision, AI TVs/media hubs, and video collaboration systems. The mid-range Dragonwing Q-7790 targets both consumer and industrial IoT devices, and offers up to 24 TOPS of on-device AI, 4K video outputs and camera inputs, and AV1 hardware video decode. The higher-end Dragonwing Q-8750 is designed for more advanced IoT applications, delivers up to 77 TOPS (dense) for real-time inference and up to 11B LLMs, handles 8K displays and 8K cameras, and supports up to 12 physical cameras for drones, media hubs, and multi-angle vision systems. Dragonwing Q-7790 Dragonwing Q-7790 (CQ7790M/CQ7790S) specifications: CPU Octa-core Kryo processor up to 2.8 GHz 1x Gold+ core @ 2.8 GHz 4x Gold cores @ 2.4 GHz 3x Silver cores @ 1.8 GHz GPU Qualcomm Adreno [...] The post Qualcomm Dragonwing Q 7790 and Q 8750 AIoT SoCs target AI-enhanced drones, cameras, TVs and media hubs appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "ESP32-DIV V1 handheld pentesting tool supports Wi-Fi Attacks, BLE spoofing, 2.4GHz scanning, and Sub-GHz jamming",
    "link": "https://www.cnx-software.com/2026/01/06/esp32-div-v1-handheld-pentesting-tool-supports-wi-fi-attacks-ble-spoofing-2-4ghz-scanning-and-sub-ghz-jamming/",
    "summary": "Designed by Cirket open-source hardware in China, the ESP32-DIV V1 is a handheld wireless pentesting and experimentation tool with Wi-Fi, BLE, generic 2.4 GHz (NRF24), and Sub-GHz RF (CC1101) communication. The device targets hardware hackers and cybersecurity researchers for learning and testing wireless vulnerabilities across multiple frequency bands. The device features a modular sandwich design consisting of a Main Board and a Shield Board connected via a 20-pin header. The Main Board integrates an ESP32 microcontroller, a 2.8-inch ILI9341 TFT display with XPT2046 touch controller, SD card slot, battery charging and power management, and navigation controls. The Shield Board hosts the RF hardware, including three NRF24L01 modules, a CC1101 Sub-GHz transceiver, and multiple SMA antenna connectors. ESP32-DIV (V1) specifications: Wireless Module ESP32-WROOM-32U SoC ESP32 dual-core wireless microcontroller CPU Dual-core Xtensa 32-bit microprocessor @ 240MHz Memory 520KB internal SRAM Wireless Wi-Fi 802.11b/g/n, and Bluetooth (4.2 and [...] The post ESP32-DIV V1 handheld pentesting tool supports Wi-Fi Attacks, BLE spoofing, 2.4GHz scanning, and Sub-GHz jamming appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "GL.iNet Comet 5G   A KVM over IP solution with 5G RedCap Cellular connectivity, 3.69-inch touchscreen display",
    "link": "https://www.cnx-software.com/2026/01/05/gl-inet-comet-5g-a-kvm-over-ip-solution-with-5g-redcap-cellular-connectivity-3-69-inch-touchscreen-display/",
    "summary": "GL.inet Comet 5G (GL-RM10RC) is an upcoming KVM over IP solution with a 3.69-inch touchscreen display and 5G RedCap (Reduced Capacity) IoT cellular connectivity, enabling remote access even when your regular Internet connection is down. The design builds upon the GL.iNet Comet Pro introduced last year, featuring a larger design and display, and adding 5G cellular connectivity on top of WiFi 6 and Gigabit Ethernet. It still features HDMI input and output (loop) ports, two USB Type-C ports for power and keyboard/mouse emulation, and a USB 2.0 port for accessories like ATX power control or fingerbot for the control of physical buttons on the target. GL.iNet Comet 5G specifications: SoC Quad-core Cortex-A53 CPU @ 1.5 GHz; potentially a Rockchip RV1126B SoC System Memory 1GB DDR3L Storage 64 GB eMMC flash Video & Audio Input HDMI port up to 4K @ 30 FPS Output HDMI loop/passthrough [...] The post GL.iNet Comet 5G A KVM over IP solution with 5G RedCap Cellular connectivity, 3.69-inch touchscreen display appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Openterface KVM-GO   An ultra-compact KVM-over-USB solution with HDMI, DP, or VGA video input",
    "link": "https://www.cnx-software.com/2026/01/05/openterface-kvm-go-an-ultra-compact-kvm-over-usb-solution-with-hdmi-dp-or-vga-video-input/",
    "summary": "Small enough to fit on a keychain, Openterface KVM-GO is a tiny, open-source hardware KVM-over-USB gadget available with an HDMI, DisplayPort (DP), or VGA connector and is designed for headless device troubleshooting and remote server monitoring. It follows the company s earlier Mini-KVM KVM-over-USB device introduced in 2024 with HDMI and audio inputs. The new KVM-GO is more versatile with an HDMI, DP, or VGA connector, and does not require any video cable since it s designed to be connected directly to the target device. It also adds a microSD card slot for easy OS installation. Openterface KVM-GO specifications: Microcontroller WCH CH32V208 RISC-V MCU @ up to 144 MHz with Bluetooth LE, USB 2.0 Storage MicroSD card for remote OS installation and file transfers Control method KVM-over-USB Video capture Up to 4K @ 60 Hz Input port HDMI, DisplayPort, or VGA, depending on model (direct connection to target, [...] The post Openterface KVM-GO An ultra-compact KVM-over-USB solution with HDMI, DP, or VGA video input appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Allwinner V861 dual-core 64-bit RISC-V AI Camera SiP features 128MB DDR3L, 4K H.265/H.264 video encoder",
    "link": "https://www.cnx-software.com/2026/01/04/allwinner-v861-dual-core-64-bit-risc-v-ai-camera-sip-features-128mb-ddr3l-4k-h-265-h-264-video-encoder/",
    "summary": "Allwinner V861 is a new dual-core 32-bit/64-bit RISC-V C907 system-in-package (SiP) with 128MB on-chip DDR3L and designed for 4K AI camera applications with a 1 TOPS AI NPU. The chip also features a 32-bit RISC-V E907 low-power core, a 4Kp25 H.264/H.265 video encoder, a 1080p60 JPEG video decoder and encoder, MIPI CSI and parallel camera interfaces, audio codec with input and output interfaces, Fast Ethernet, USB 2.0, and a range of digital and analog I/Os. Allwinner V861M3-XXX specifications: CPU Dual-Core RISC-V XuanTie C907 (RV64GCBV/RV32GGCBV) clocked up to 1.4GHz with RVV 1.0 extensions Single-core RISC-V XuanTie E907 (RV32IMAFC) clocked up to 800MHz VPU Video Encoder H.264/H.265 up to 4K @ 25fps (M)JPEG up to 8192 8192 Video Decoder (M)JPEG up to 1080p60 AI accelerator 1 TOPS (INT8) NPU dubbed AI-ISP 2.0 Memory 128MB DDR3/DDR3L (SiP) SQPI PSRAM interface Storage QSPI flash eMMC 4.41 SDIO 2.0/3.0 Display SPI interface Camera [...] The post Allwinner V861 dual-core 64-bit RISC-V AI Camera SiP features 128MB DDR3L, 4K H.265/H.264 video encoder appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "WCH CH32H417 dual-core RISC-V MCU offers USB 3.0, 500MB/s UHSIF, and Fast Ethernet interfaces",
    "link": "https://www.cnx-software.com/2026/01/03/wch-ch32h417-dual-core-risc-v-mcu-offers-usb-3-0-500mb-s-uhsif-and-fast-ethernet-interfaces/",
    "summary": "WCH CH32H417 is a high-performance dual-core RISC-V microcontroller clocked at up to 400 MHz with up to 960 KB flash, 896KB SRAM, and a range of interfaces, including a 5 Gbps USB 3.0 Host/Device SuperSpeed interface. Other notable features include a 500MB/s UHSIF (Universal High Speed Interface), 10/100Mbps Ethernet MAC and PHY, a SerDes high-speed isolated transceiver, a USB 2.0 High-Speed Host/Device, a USB 2.0 OTG Full Speed, USB PD support, and Display and Camera interfaces. The CH32H417 also offers the usual low-speed I/Os (95x GPIO, SPI ) and analog inputs and outputs (ADC/DAC). WCH CH32H417 CH32H417 specifications: Cores (Coremark: 5.73/MHz) QingKe RISC-V5F up to 400 MHz QinKe RISC-V3F up to 144 MHz GPU Graphics Processing Hardware Accelerator GPHA Memory 896KB SRAM Storage 960KB Flash 200MHz dual-edge SD/EMMC controller (SDMMC) SDIO master/slave interface with support for SD/SDIO/MMC Flexible Storage Controller FMC Display DCT-TFT Display Controller LTDC Camera I/F [...] The post WCH CH32H417 dual-core RISC-V MCU offers USB 3.0, 500MB/s UHSIF, and Fast Ethernet interfaces appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Cincoze MD-3000 is a scalable DIN-Rail computer with up to 14th Gen 24-core Intel Core i9-14900 CPU",
    "link": "https://www.cnx-software.com/2026/01/02/cincoze-md-3000-scalable-din-rail-computer-with-up-to-14th-gen-24-core-intel-core-i9-14900-cpu/",
    "summary": "Cincoze MD-3000 is a high-performance, scalable DIN-Rail computer powered by a 12th, 13th, or 14th Gen Intel processor and designed to be expanded with up to six modules through the company s Scalable Expansion Deck (SED) connected to the computer s PCIe x16 slot. Based on an up to a 14th Gen 24-core Intel Core i9-14900 Raptor Lake-S Refresh CPU, the MD-3000 supports up to 96GB DDR5 SO-DIMM memory with optional ECC, up to two M.2 NVMe SSDs, and a 2.5-inch SATA bay, and is equipped with two 4K-capable DisplayPort connectors, five Gigabit Ethernet ports, four USB 3.2 ports, an RS232/RS485 DB9 connector and more. It mainly targets vision-driven smart manufacturing applications. Cincoze MD-3000 specifications: SoC (One or the other) 14th Generation Intel Raptor Lake-S Refresh Series 35W Intel Processor 300T dual-core CPU @ 3.4 GHz, up to 65W Intel Core i9-14900 24-core CPU @ 5.8 GHz; 20 SKUs available 13th [...] The post Cincoze MD-3000 is a scalable DIN-Rail computer with up to 14th Gen 24-core Intel Core i9-14900 CPU appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "Year 2025 in Review, CNX Software stats, and looking ahead to 2026",
    "link": "https://www.cnx-software.com/2025/12/31/year-2025-in-review-cnx-software-stats-and-looking-ahead-to-2026/",
    "summary": "Time for the last post of 2025, as the year is almost over. I ll look back at key developments and notable products launched in 2025, share some CNX Software website traffic statistics, and look ahead to 2026. Year 2025 in Review After 22 product releases in 2024, Raspberry Pi calmed down a little bit in 2025, and the highlights of the year included the Raspberry Pi 500+ mechanical keyboard, the 5-inch variant of the Raspberry Pi Touch Display 2, and a Raspberry Pi 5 1GB RAM. What didn t quite stop were the accessories from third parties for Raspberry Pi SBC and Raspberry Pi Pico boards. The most exciting Arm SoC release of 2025 was probably the 12-core CIX P1 Armv9 SoC found in Radxa Orion O6 SBC, MINISFORUM MS-R1 Arm mini PC, and Orange Pi 6 Plus board, but while performance was fine, it was overhyped in 2024, and software [...] The post Year 2025 in Review, CNX Software stats, and looking ahead to 2026 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "VisionFive 2 Lite SBC Review   Ubuntu 24.04 on a low-cost RISC-V SBC in 2026",
    "link": "https://www.cnx-software.com/2025/12/31/visionfive-2-lite-sbc-review-ubuntu-24-04-on-a-low-cost-risc-v-sbc-in-2026/",
    "summary": "StarFive has sent me a sample of the VisionFive 2 Lite RISC-V SBC for review. It s a low-cost credit card-sized board based on the StarFive JH7110S quad-core RISC-V SBC and designed to get started with Linux RISC-V on the cheap. When I first tested the earlier VisionFive 2 SBC with a StarFive JH7110 RISC-V SoC in February 2023, I didn t call it a review, but rather a hands-on experience, since, at the time, many features still didn t work properly. Almost three years have passed since then, so reviewing the VisionFive 2 Lite SBC with Ubuntu 24.04 will allow us to see how much progress has been made on the software side. If you are in a rush, you can jump to the what works, what doesn t section. VisionFive 2 Lite unboxing I received the board in a plastic box with a cover reading VisionFive 2 Lite Your Gateway to RISC-V . [...] The post VisionFive 2 Lite SBC Review Ubuntu 24.04 on a low-cost RISC-V SBC in 2026 appeared first on CNX Software - Embedded Systems News ."
  },
  {
    "title": "DFRobot HUSKYLENS 2 AI camera review   From built-in AI samples to training a custom model to detect elephants",
    "link": "https://www.cnx-software.com/2025/12/31/dfrobot-huskylens-2-ai-camera-review-from-built-in-ai-samples-to-training-a-custom-model-to-detect-elephants/",
    "summary": "Hello, today I am going to review the HUSKYLENS 2, released in October 2025. It is the next generation of HUSKYLENS, an AI vision sensor equipped with a Kendryte K230 dual-core RISC-V SoC with a 6 TOPS AI accelerator and a 2.4-inch IPS touchscreen. The device runs machine vision algorithms fully on-device, providing fast and low-latency performance, and includes more than 15 built-in AI models. HUSKYLENS 2 also supports deploying custom-trained models, including integration with Large Language Models (LLMs) via a Model Context Protocol (MCP) service. In addition, it is compatible with various microcontrollers, such as Arduino and Raspberry Pi, through UART or I2C communication interfaces. HUSKYLENS 2 unboxing The manufacturer sent the HUSKYLENS 2 module and the Microscope Lens separately. Both parcels were shipped from Chengdu, China, and arrived at my office in Chanthaburi, Thailand, in about one week. The parcels were packed in standard cardboard boxes and arrived [...] The post DFRobot HUSKYLENS 2 AI camera review From built-in AI samples to training a custom model to detect elephants appeared first on CNX Software - Embedded Systems News ."
  }
]