[
  {
    "title": "Steam Deck shortage goes global Valve's handheld console now out of stock in Europe, Canada, the US, and Japan",
    "summary": "The handheld console is still available in Australia, the U.K., Hong Kong, South Korea, and Taiwan. But will they run out of stock in the near future, too?",
    "link": "https://www.tomshardware.com/video-games/handheld-gaming/steam-deck-shortage-goes-global-valves-handheld-console-now-out-of-stock-in-europe-canada-the-us-and-japan",
    "categories": [
      "AI & ML",
      "Tech News"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.540199"
  },
  {
    "title": "AMD Zen 6 and Intel Nova Lake CPUs reportedly arriving late, delayed to CES 2027 next-gen chips rocked by industry turmoil",
    "summary": "AMD and Intel are both preparing next-gen desktop CPUs with major architectural improvements that now seem to be delayed. This includes Nova Lake, which has been confirmed for a 2026 year-end release time and again, and Zen 6, which has been on AMD's roadmap as a 2026 product for a while.",
    "link": "https://www.tomshardware.com/pc-components/cpus/amd-zen-6-and-intel-nova-lake-cpus-reportedly-arriving-late-delayed-to-ces-2027-next-gen-chips-rocked-by-industry-turmoil",
    "categories": [
      "Hardware",
      "GPUs"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.540288"
  },
  {
    "title": "Intel Bartlett Lake-S CPUs reportedly wield 12 blazing P-cores and 5.8 GHz boost turbocharged chips that will not make it to retail",
    "summary": "Intel's Core 200E-series 'Bartlett Lake' CPUs to offer up to 12 cores at a 125W TDP, according to a leak.",
    "link": "https://www.tomshardware.com/pc-components/cpus/intel-bartlett-lake-s-cpus-reportedly-wield-12-blazing-p-cores-and-5-8-ghz-boost-turbocharged-chips-that-will-not-make-it-to-retail",
    "categories": [
      "AI & ML",
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.540357"
  },
  {
    "title": "Lenovo alerts partners to looming price hikes on consumer and server products soaring memory costs drive the surge",
    "summary": "Lenovo warns partners of price hikes on client and server devices, advising them to place orders early to order at current prices.",
    "link": "https://www.tomshardware.com/desktops/lenovo-alerts-partners-to-looming-price-hikes-on-consumer-and-server-products-soaring-memory-costs-drive-the-surge",
    "categories": [
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.540417"
  },
  {
    "title": "Corsair Makr Pro 75 Review: Not DIY-priced (or DIY)",
    "summary": "Corsair's Makr Pro 75 is a pre-built magnetic switch version of its DIY Makr 75 series. It's a nicely-built board, and feels and sounds pretty good out of the box, but it's hard to justify the price.",
    "link": "https://www.tomshardware.com/peripherals/gaming-keyboards/corsair-makr-pro-75-review",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-22T09:02:47.540474"
  },
  {
    "title": "Data center developers building private natural gas 'Shadow Grid' power plants to sidestep strained grids off-grid GW Ranch project in Texas will reportedly use as much power as Chicago",
    "summary": "Data centers using natural gas plants to sidestep power grids at the cost of carbon emissions",
    "link": "https://www.tomshardware.com/tech-industry/big-tech/datacenter-developers-leverage-natural-gas-to-sidestep-power-grids-short-term-solution-might-increase-carbon-emissions-and-prove-costly-in-the-long-run",
    "categories": [
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.540542"
  },
  {
    "title": "India joins America-led Pax Silica supply chain effort to build semiconductor talent and reduce reliance on China agreement spans from rare earths to chipmaking tools",
    "summary": "With new fabs under development and a growing focus on skilled talent, India s inclusion in Pax Silica points to a long-term effort by the U.S. and its partners to accelerate capacity building.",
    "link": "https://www.tomshardware.com/tech-industry/india-joins-america-led-pax-silica-supply-chain-effort-to-build-semiconductor-talent-and-reduce-reliance-on-china-agreement-spans-from-rare-earths-to-chipmaking-tools",
    "categories": [
      "Semiconductors",
      "AI & ML"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-22T09:02:47.540613"
  },
  {
    "title": "Creator of Window's Task Manager shows off 'probably what Task Manager would look like if I were still around' Tempest AI's retro-futuristic dashboard code shared to Github",
    "summary": "Dave Plummer created Tempest AI to play the classic Atari game, but he also built a dashboard which imagines what Task Manager should look like if he were still in charge of it.",
    "link": "https://www.tomshardware.com/software/windows/task-manager-creator-shows-off-tempest-ais-retro-futuristic-dashboard-jokes-that-this-is-what-the-task-manager-would-look-like-if-he-were-still-at-microsoft-today",
    "categories": [
      "AI & ML",
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.540679"
  },
  {
    "title": "Hands-on with Cooler Master s Cosmos Alpha full-tower chassis sliding, configurable interior makes for lots of possibilities",
    "summary": "The Cosmos Alpha is an excellent update over the previous 2022-era model. The large internal spaces offer tons of configuration possibilities, all inside a modern, good-looking, premium full-tower chassis.",
    "link": "https://www.tomshardware.com/pc-components/pc-cases/hands-on-with-cooler-masters-cosmos-alpha-full-tower-chassis",
    "categories": [
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.540740"
  },
  {
    "title": "Wikipedia officially blacklists all links to Archive Today over bizarre DDOS attack and manipulated archives website operator caught tweaking their own archive",
    "summary": "Wikipedia officially blacklists all links to Archive Today",
    "link": "https://www.tomshardware.com/software/search-engines/wikipedia-officially-blacklists-all-links-to-archive-today-website-operator-caught-tweaking-their-own-archive",
    "categories": [
      "Tech News"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.540825"
  },
  {
    "title": " Mad scientist visualizes Atari 2600 fetching data from ROM for mesmerizing light show signal propagation through the 8-bit circuits animated",
    "summary": "A spectacular new CMOS FET level visualization of an Atari 2600 loading data has been shared by a 'mad scientist.'",
    "link": "https://www.tomshardware.com/video-games/retro-gaming/mad-scientist-visualizes-atari-2600-fetching-data-from-rom-for-mesmerizing-light-show-signal-propagation-through-the-circuits-animated",
    "categories": [
      "Tech News"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.540880"
  },
  {
    "title": "Several PC games run on Snapdragon 8 Elite Android device with 16GB RAM and emulation The Witcher 3, Spider-Man: Miles Morales, and Cyberpunk 2077 playable at 720p",
    "summary": "YouTuber tests several PC games on Android with high-end Snapdragon-powered devices, showing how good PC emulation is on Android. Cyberpunk 2077 runs at over 60 FPS on liquid-cooled Red Magic 11 Pro.",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/youtuber-successfully-runs-several-pc-games-on-snapdragon-8-elite-android-device-with-16gb-ram-the-witcher-3-spider-man-miles-morales-and-cyberpunk-2077-playable-at-720p",
    "categories": [
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.540944"
  },
  {
    "title": "27 years after launch, Apple's decades-old iBook lineup can still get legacy updates from the company's servers 21-year-old iBook G4 seamlessly connects to Wi-Fi, downloads updates with no mods",
    "summary": "A Redditor has passionately shown off their 21-year-old iBook G4 on the r/MacOS subreddit, arguing that Apple's extensive software support goes against the planned obsolescence accusations they get. In the post, OP's vintage iBook can be seen ready to download updates after connecting to the internet, even today.",
    "link": "https://www.tomshardware.com/software/macos/you-can-still-get-legacy-updates-from-apples-servers-on-its-decades-old-ibook-lineup-21-year-old-ibook-g4-seamlessly-connects-to-wi-fi-downloads-updates-with-no-mods",
    "categories": [
      "AI & ML",
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.541022"
  },
  {
    "title": "Taalas HC1 hardwired Llama-3.1 8B AI accelerator delivers up to 17,000 tokens/s",
    "summary": "Taalas HC1 is an AI accelerator hardwired (i.e, implemented in hardware) with Llama-3.1 8B and delivering close to 17,000 tokens/s of AI performance with the model, outperforming datacenter accelerators such as NVIDIA B200 or Cerebras chips. The Taalas HC1 is about 10x faster than the Cerebras chip, costs 20x less to build, and consumes 10x less power. The main downside is that it only works with the model hardwired into the hardware, currently Llama-3.1 8B, although we re told it retains flexibility through configurable context window size and support for fine-tuning via low-rank adapters (LoRAs) . Hardware accelerators usually come with memory on one side and compute on the other. Both operate at different speeds, and the memory bandwidth is usually the bottleneck for Large Language Models. Taalas technology unifies storage and compute on a single chip, at DRAM-level density, to massively increase the performance and reduce power consumption. Ultra-fast inference can [...] The post Taalas HC1 hardwired Llama-3.1 8B AI accelerator delivers up to 17,000 tokens/s appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/22/taalas-hc1-hardwired-llama-3-1-8b-ai-accelerator-delivers-up-to-17000-tokens-s/",
    "categories": [
      "AI & ML",
      "GPUs"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-22T09:02:47.541517"
  },
  {
    "title": "CHUWI CoreBook Air Plus 16 review Part 2: An AMD Ryzen 5 6600H-powered, mid-range laptop tested with Windows 11 Pro",
    "summary": "I ve already checked out the hardware of the CHUWI CoreBook Air Plus 16 laptop in the first part of the review, so today, I ll report my experience using the AMD Ryzen 5 6600H laptop with the pre-installed Windows 11 Pro operating system. We ll start with a software overview and a test of key features, followed by benchmarking, evaluation of WiFi 6 performance, and measurement of fan noise, power consumption, and battery life. Software Overview and Features Testing The CoreBook Air Plus 16 ships with Windows 11 Pro 64-bit 24H2 operating system, upgraded to the 25H2 version after running Windows updates. The System->About window confirms we have a CoreBook Air Plus laptop powered by a 3.3 GHz (base frequency) AMD Ryzen 5 6600H processor with Radeon graphics paired with 16GB of RAM and 447GB of storage. None of the mini PCs and laptops we ve reviewed in the past come with Microsoft [...] The post CHUWI CoreBook Air Plus 16 review Part 2: An AMD Ryzen 5 6600H-powered, mid-range laptop tested with Windows 11 Pro appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/21/chuwi-corebook-air-plus-16-review-part-2-an-amd-ryzen-5-6600h-powered-mid-range-laptop-tested-with-windows-11-pro/",
    "categories": [
      "Hardware",
      "GPUs"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-22T09:02:47.541640"
  },
  {
    "title": "A $300 Radeon RX 9060 XT just smashed the world GPU overclocking record",
    "summary": "AMD teamed up with two well-known overclockers, Bill Alverson (aka \"Sampson\") and Splave, to push a Radeon RX 9060 XT to 4,769 MHz. That's a new world record for GPU frequency and it wasn't even close to the previous mark. Read Entire Article",
    "link": "https://www.techspot.com/news/111422-300-radeon-rx-9060-xt-smashed-world-gpu.html",
    "categories": [
      "GPUs"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.542855"
  },
  {
    "title": "The US just got an AI layer for immigration. The rules are still loading.",
    "summary": "What originated as a narrow procurement notice has grown into a broader effort that links machine-learning models with government and commercial records, creating an enforcement infrastructure with few historical parallels. As the software moves from early pilot to wider operational use, the arguments around it have hardened. Read Entire Article",
    "link": "https://www.techspot.com/news/111421-us-got-ai-layer-immigration-rules-loading.html",
    "categories": [
      "AI & ML",
      "Semiconductors"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.542966"
  },
  {
    "title": "Microsoft replaces Xbox heads Phil Spencer and Sarah Bond with AI exec",
    "summary": "Microsoft CEO Satya Nadella recently announced that the company's CoreAI Product president, Asha Sharma, has become the CEO of Xbox, replacing retiring Xbox boss Phil Spencer. Read Entire Article",
    "link": "https://www.techspot.com/news/111414-microsoft-replaces-xbox-heads-phil-spencer-sarah-bond.html",
    "categories": [
      "AI & ML",
      "Semiconductors"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-22T09:02:47.543062"
  },
  {
    "title": "ATMs are getting hacked the old-fashioned way: with keys and USB drives",
    "summary": "Banks across the United States are grappling with a wave of physical malware attacks on their ATMs, according to a new cybersecurity alert from the Federal Bureau of Investigation. The agency's report warns that attackers are bypassing both digital and physical safeguards by exploiting outdated technology and generic maintenance hardware... Read Entire Article",
    "link": "https://www.techspot.com/news/111413-atms-getting-hacked-old-fashioned-way-keys-usb.html",
    "categories": [
      "AI & ML",
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.543168"
  },
  {
    "title": "Final Fantasy VII Remake Part 3 is built PC-first, then scaled down to consoles",
    "summary": "During an interview with Automaton, Final Fantasy 7 Remake game director Naoki Hamaguchi explained why Square Enix is developing \"PC first\" and how it benefits all platforms. He said that by creating assets for the highest-end environments first, the FF7R team avoids being constrained by lower-end hardware. Once the high-end... Read Entire Article",
    "link": "https://www.techspot.com/news/111416-final-fantasy-developers-focus-pc-foundation-multiplatform-development.html",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.543275"
  },
  {
    "title": "Bill Gates-backed fusion startup begins licensing for futuristic reactor in Tennessee",
    "summary": "For six decades, the Bull Run Fossil Plant in Claxton, Tennessee, powered a region on fossil fuel. Last year, the plant was decommissioned, collapsing the plant's twin smokestacks in a controlled demolition. Their fall didn't just erase a landmark from the Tennessee skyline; it symbolized the state's newly emerging role... Read Entire Article",
    "link": "https://www.techspot.com/news/111423-bill-gates-backed-fusion-startup-begins-licensing-futuristic.html",
    "categories": [
      "Tech News"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.543376"
  },
  {
    "title": "The Windows XP Bliss wallpaper still exists, and it briefly looks the same again",
    "summary": "A Reddit user recently visited the Napa Valley location where the \"Bliss\" wallpaper was photographed. The view now closely matches the original image, which became a technology icon after Microsoft chose it as the default wallpaper for Windows XP. Read Entire Article",
    "link": "https://www.techspot.com/news/111411-windows-xp-bliss-wallpaper-exists-briefly-looks-same.html",
    "categories": [
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-22T09:02:47.543467"
  }
]