[
  {
    "title": "Grab this gigantic, 1600W 80+ Platinum power supply for just 33 cents per watt Seasonic's Prime TX 1600W is down to just $532",
    "summary": "Seasonic makes some of the best power supplies on the market, and its Prime TX-1600 is a great option for high-end builds. Thanks to the native PCIe 5.0 and ATX 3.1 compatibilty, it can easily power any component out there. It's fully modular, rated 80+ Platinum by Cybernetics, and features quite operation all in one solid package.",
    "link": "https://www.tomshardware.com/pc-components/grab-this-gigantic-1600w-80-platinum-power-supply-for-just-33-cents-per-watt-seasonics-prime-tx-1600w-is-down-to-just-usd532",
    "categories": [
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-16T05:19:09.584831"
  },
  {
    "title": "OpenClaw-fueled ordering frenzy creates Apple Mac shortage delivery for high Unified Memory units now ranges from 6 days to 6 weeks",
    "summary": "The Unified Memory architecture used by Apple Macs and MacBooks make it the ideal device for locally run agentic AI, driving demand for high-memory models and increasing order lead times to more than a month.",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/openclaw-fueled-ordering-frenzy-creates-apple-mac-shortage-delivery-for-high-unified-memory-units-now-ranges-from-6-days-to-6-weeks",
    "categories": [
      "AI & ML"
    ],
    "quality_score": 0,
    "processed_date": "2026-02-16T05:19:09.584917"
  },
  {
    "title": "xSDR A tiny M.2 2230 SDR module with Artix-7 FPGA and LMS7002M RFIC (Crowdfunding)",
    "summary": "Wavelet Lab s xSDR is a tiny, single-sided M.2 2230 software-defined radio (SDR) module designed for integration into laptops, embedded systems, and edge computing devices. A successor to the company s previous uSDR, the x in xSDR stands for extended, adding 2 2 MIMO support and a wider frequency range to the same tiny footprint. The module is built around the Lime Microsystems LMS7002M RFIC and an AMD Artix-7 XC7A50T FPGA as found in the LimeNET Micro 2.0 Developer Edition board. This combination allows for a tuning range of 30 MHz to 3.8 GHz and a sample rate of up to 122.88 MSPS, making this SDR suitable for cellular research (LTE/5G), spectrum analysis, satellite tracking, and high-speed data links (with two modules). Wavelet Lab s xSDR specifications: RFIC Lime Microsystems LMS7002M programmable RF (FPRF) transceiver IC FPGA AMD Embedded XC7A50T (Artix-7) with 52,160 logic cells RF capabilities Channels 2 2 MIMO (2x [...] The post xSDR A tiny M.2 2230 SDR module with Artix-7 FPGA and LMS7002M RFIC (Crowdfunding) appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/16/xsdr-a-tiny-m-2-2230-sdr-with-artix-7-fpga-and-lms7002m-rfic/",
    "categories": [
      "Hardware",
      "Tech News"
    ],
    "quality_score": 20,
    "processed_date": "2026-02-16T05:19:09.585532"
  },
  {
    "title": "LR2021 LoRa Plus board combines Semtech LR2021 and Nordic nRF54L15 for high-speed FLRC and LoRa connectivity",
    "summary": "Last year, Semtech released the LR2021 LoRa Plus transceiver chip, designed to address the low data-rate issue associated with LoRa, but surprisingly, they didn t release a development board for the chip. Now, almost a year later, Seeed Studio and Semtech have partnered to introduce the LR2021 LoRa Plus development kit targeting long-range high-speed LoRa and FLRC applications up to 2.6 Mbps. Not only does the board support LoRa Gen 4 technology, providing Sub-GHz, 2.4 GHz ISM, and S/L-band operation, but a XIAO nRF54L15 board also adds dual-core processing (Arm Cortex-M33 + RISC-V) and supports other short-range protocols, including NFC, Bluetooth LE 6.0, Matter, Thread, and 2.4 GHz proprietary protocols. The development board also features a 0.96-inch 128 64 OLED, three Grove connectors for expansion, a USB Type-C for power, SWD debugging, and two Sub-GHz and 2.4 GHz SMA connectors. It is compatible with Arduino Uno, STM32 Nucleo, and Nordic DK boards. [...] The post LR2021 LoRa Plus board combines Semtech LR2021 and Nordic nRF54L15 for high-speed FLRC and LoRa connectivity appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/16/lr2021-lora-plus-board-combines-semtech-lr2021-and-nordic-nrf54l15-for-high-speed-flrc-and-lora-connectivity/",
    "categories": [
      "Hardware",
      "Semiconductors"
    ],
    "quality_score": 15,
    "processed_date": "2026-02-16T05:19:09.585660"
  }
]