[
  {
    "title": "AMD denies report of MI455X delays as Nvidia VR200 systems are rumored to arrive early company says Helios systems 'on target for 2H 2026'",
    "summary": "AMD's Helios rack-scale solution based on the MI455X accelerators, the company's major hope for AI market, may slip to 2027, whereas Nvidia may speed up roll out of the Vera Rubin platform if the latest market rumors are to be believed.",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/amd-denies-report-of-mi455x-delays-as-nvidia-vr200-systems-are-rumored-to-arrive-early-company-says-helios-systems-on-target-for-2h-2026",
    "categories": [
      "GPUs",
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.433947"
  },
  {
    "title": "High-end Android phones are now powerful enough to emulate the PC version of Cyberpunk 2077 YouTuber gets 2020's hottest PC game running at playable frame rates on Red Magic 11 Pro",
    "summary": "Cyberpunk 2077 may have required a powerful gaming PC to enjoy at its 2020 release, but YouTuber ETA Prime has shown that the game can now be played on a high-end smartphone with decent performance with x86 emulation.",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/high-end-android-phones-are-now-powerful-enough-to-emulate-the-pc-version-of-cyberpunk-2077-youtuber-gets-2020s-hottest-pc-game-running-at-playable-frame-rates-on-red-magic-11-pro",
    "categories": [
      "Hardware",
      "GPUs"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-18T06:51:23.434023"
  },
  {
    "title": "New report shows RAM prices are continuing to fall in Germany, US trends less certain SSDs and HDDs are more expensive than ever in the States",
    "summary": "Memory prices have stabilized in Germany, with some kits even experiencing price cuts over the past month, showing decent progress towards normalization. They're still over 300% more expensive than they were five months ago, though. In contrast, HDDs and SSDs have become more expensive, and their prices continue to rise.",
    "link": "https://www.tomshardware.com/tech-industry/new-report-shows-ram-prices-are-continuing-to-fall-in-germany-u-s-trends-less-certain-ssds-and-hdds-are-more-expensive-than-ever",
    "categories": [
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434092"
  },
  {
    "title": "OpenAI hires 'genius' OpenClaw creator, but popular AI assistant will remain open source Sam Altman says creator will work on 'smart agents' in new role",
    "summary": "OpenAI has hired the creator of popular agentic AI tool OpenClaw, but has decided to keep the project open source. Despite its old Claude-inspired name, Anthropic threatened Steinberger with legal action ahead of multiple name changes.",
    "link": "https://www.tomshardware.com/tech-industry/openai-hires-genius-openclaw-creator-but-popular-ai-assistant-will-remain-open-source-sam-altman-says-creator-will-work-on-smart-agents-in-new-role",
    "categories": [
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434153"
  },
  {
    "title": "Brace for a barren landscape of new hardware launches, as AI demand reshapes the world of consumer electronics trillions in AI investment threaten to derail entire industries",
    "summary": "Amid the ongoing DRAM supply squeeze, the world of consumer electronics is evolving, and it threatens to derail entire industries with its sheer scale and monetary backing.",
    "link": "https://www.tomshardware.com/tech-industry/ai-demand-reshapes-consumer-electronics",
    "categories": [
      "AI & ML",
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434215"
  },
  {
    "title": "NZXT unveils new H2 mini PC with 9800X3D, Intel 285K configurations H2 Flow Mini-ITX case and C850 SFX power supply for builders",
    "summary": "NZXT has unveiled a new H2 Mini Pc for the U.S. market, as well as a compact power supply and H2 Flow Mini-ITX case.",
    "link": "https://www.tomshardware.com/desktops/mini-pcs/nzxt-unveils-new-h2-mini-pc-with-9800x3d-intel-285k-configurations-h2-flow-mini-itx-case-and-c850-sfx-power-supply-for-builders",
    "categories": [
      "Hardware",
      "Tech News"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-18T06:51:23.434264"
  },
  {
    "title": "Dell XPS 14 (2026) review: Two steps forward",
    "summary": "The Dell XPS 14 is a significant improvement over previous revisions, with an attractive design and a physical function row on the keyboard. There are also solid speakers and long battery life on the 1200p version. But the low-travel keyboard takes some getting used to.",
    "link": "https://www.tomshardware.com/laptops/dell-xps-14-2026-da14260-review",
    "categories": [
      "Hardware",
      "Tech News"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-18T06:51:23.434315"
  },
  {
    "title": "Japanese toilet maker 'the most undervalued and overlooked AI memory beneficiary,' investors claim shares up nearly 40% in first two months of 2026",
    "summary": "A company most famous for toilets and bidets is seeing meteoric stock growth due to demand for its advanced ceramics products.",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/japanese-toilet-maker-the-most-undervalued-and-overlooked-ai-memory-beneficiary-investors-claim-shares-up-nearly-40-percent-in-first-two-months-of-2026",
    "categories": [
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434366"
  },
  {
    "title": "This Corsair RAM and Gigabyte AM5 motherboard bundle is just $67 more than buying the RAM alone 32GB of RAM and B850 Aorus Elite Wifi 7 shaves $133 off buying separately",
    "summary": "Score 20% off at Newegg on a Gigabyte B850 Aorus Elite Wifi 7 + 32GB Corsair Vengeance RGB DDR5-6400 bundle under $505 for AMD AM5 support, Wi-Fi 7, PCIe 5.0 M.2/slot, and eye-catching RGB.",
    "link": "https://www.tomshardware.com/pc-components/this-corsair-ram-and-gigabyte-am5-motherboard-bundle-is-just-usd67-more-than-buying-the-ram-alone-32gb-of-ram-and-b850-aorus-elite-wifi-7-shaves-usd133-off-buying-separately",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434427"
  },
  {
    "title": "Sony considering PlayStation 6 delay to 2029, while Nintendo could hike Switch 2 price, according to report memory and storage chip shortage now impacting products outside of RAM, storage, and GPUs",
    "summary": "The two gaming giants are reportedly taking widely different approaches to the memory chip shortage as the situation is starting to affect consumer electronics outside of PCs.",
    "link": "https://www.tomshardware.com/video-games/console-gaming/sony-considering-playstation-6-delay-to-2029-while-nintendo-could-hike-switch-2-price-according-to-report-memory-and-storage-chip-shortage-now-impacting-products-outside-of-ram-storage-and-gpus",
    "categories": [
      "GPUs",
      "Semiconductors"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434488"
  },
  {
    "title": "SATA SSD cheated death from failed attempt at data destruction with a drill drive emerges victorious in face-off against IT worker",
    "summary": "An IT employee reportedly attempted to destroy sensitive company data by drilling a hole through a SATA SSD before disposing of it.",
    "link": "https://www.tomshardware.com/pc-components/ssds/sata-ssd-cheated-death-from-failed-attempt-at-data-destruction-with-a-drill-drive-emerges-victorious-in-face-off-against-it-worker",
    "categories": [
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434552"
  },
  {
    "title": "Valve confirms Steam Deck is out of stock due to memory and storage shortages supply of popular gaming handheld in trouble because of massive AI demand",
    "summary": "Valve is blaming memory and chip shortages as Steam Deck availability becomes intermittent in several regions.",
    "link": "https://www.tomshardware.com/video-games/handheld-gaming/valve-confirms-steam-deck-is-out-of-stock-due-to-memory-and-storage-shortages-supply-of-popular-gaming-handheld-in-trouble-because-of-massive-ai-demand",
    "categories": [
      "AI & ML",
      "GPUs"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434605"
  },
  {
    "title": "Tech tinkerer gets Gemini to help him 'vibe code' an x86 motherboard design bot help was impressive, but project still required human awareness and intervention",
    "summary": "Tech thinkerer gets Gemini to help him design an x86 motherboard",
    "link": "https://www.tomshardware.com/raspberry-pi/raspberry-pi-projects/tech-tinkerer-gets-gemini-to-help-him-design-an-x86-motherboard-from-scratch-bot-help-was-impressive-but-project-still-required-human-awareness-and-intervention",
    "categories": [
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434650"
  },
  {
    "title": "Engineer finds his smart sleep mask can read other people's brainwaves due to poor software security superpower granted via poor-quality software with hardcoded high-level credentials",
    "summary": "Engineer finds his smart sleep mask can read other people's brainwaves",
    "link": "https://www.tomshardware.com/peripherals/wearable-tech/engineer-finds-his-smart-sleep-mask-can-read-other-peoples-brainwaves-superpower-granted-via-poor-quality-software-with-hardcoded-high-level-credentials",
    "categories": [
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434696"
  },
  {
    "title": "Turtle Beach's rotating button Stealth Pivot wireless controller falls to just $99.99 this hall effect gamepad hits its lowest ever price",
    "summary": "The Turtle Beach Stealth Pivot HE gamepad falls to the all-time low price of $99.99. Rotating button modules give you multi-controller customizability.",
    "link": "https://www.tomshardware.com/peripherals/controllers-gamepads/turtle-beachs-rotating-button-stealth-pivot-wireless-controller-falls-to-just-usd99-99-this-hall-effect-gamepad-hits-its-lowest-ever-price",
    "categories": [
      "Semiconductors"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434743"
  },
  {
    "title": "$50 junk second-hand motherboard turns into a SSD treasure trove worth $1,500 12 terabytes of blazing-fast storage finds a new owner amid crushing shortages",
    "summary": "A Redditor buys a damaged Z690 motherboard for $50 but discovers up to $1,500 worth of SSDs beneath the heatsinks.",
    "link": "https://www.tomshardware.com/pc-components/ssds/usd50-junk-second-hand-motherboard-turns-into-a-ssd-treasure-trove-worth-usd1-500-12-terabytes-of-blazing-fast-storage-finds-a-new-owner-amid-crushing-shortages",
    "categories": [
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-18T06:51:23.434789"
  },
  {
    "title": "Murena Volla 12.6-inch privacy-focused tablet runs /e/OS Google-free Android OS on MediaTek Helio G99 SoC",
    "summary": "Murena Volla is a 12.6-inch privacy-focused tablet running /e/OS and designed for users seeking a Google-free experience. While the hardware is developed in collaboration with German-based Volla, the Murena edition comes preloaded with the Android-based /e/OS and integrated Murena cloud services for users who want full control over their personal data. The tablet is built around a MediaTek Helio G99 octa-core processor paired with 12GB of RAM and 512GB of internal storage. The device also features a USB Type-C port, Wi-Fi 6, 4G LTE support (Europe only), and 13MP rear and 5MP front-facing cameras. Applications include secure business use, education, and family environments for privacy-first media, communication, and document management workflows. Murena Volla Tablet Specifications: SoC MediaTek Helio G99 (Most probably a MT8781) CPU Octa-core processor with 2x ARM Cortex-A76 cores @ 2.2 GHz, 6x ARM Cortex-A55 cores @ 2.0 GHz GPU ARM Mali-G57 MC2 VPU Video [...] The post Murena Volla 12.6-inch privacy-focused tablet runs /e/OS Google-free Android OS on MediaTek Helio G99 SoC appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/18/murena-volla-12-6-inch-privacy-focused-tablet-runs-e-os-google-free-android-os-on-mediatek-helio-g99-soc/",
    "categories": [
      "Hardware",
      "Semiconductors"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-18T06:51:23.435290"
  },
  {
    "title": "NXP S32N79 octa-core Arm Cortex-A78E/12-core Cortex-R52 Super-Integration Processor targets Software-Defined Vehicles (SDV)",
    "summary": "NXP recently introduced the S32N79 Super-Integration automotive processor, part of the S32N7 series, equipped with up to eight Arm Cortex-A78E application cores and twelve Arm Cortex-R52 cores for real-time processing. Building on the earlier 5 nm S32N55 16-core Cortex-R52 + 2x Lockstep Cortex-M7 automotive processor, the S32N79 automotive processor is still designed for software-defined vehicles (SDV), but its Cortex-A78E applications cores further enable features such as ADAS sensor fusion and data AI services, as well as improved vehicle gateway/processing functions. NXP S32N79 key features and specifications: CPU Up to 8x split-lock Arm Cortex-A78AE cores operating at up to 1.8 GHz Up to 12x split-lock Arm Cortex-R52 cores operating at up to 1.4 GHz RISC-V-based accelerator for networking, math, and data-intensive workloads AI accelerator eIQ Neutron neural processing unit (NPU) for vehicle core NeuroNetwork offload Memory Up to 2x LPDDR4X/5/5X DRAM interfaces Up to 36 MB platform SRAM Storage 2x [...] The post NXP S32N79 octa-core Arm Cortex-A78E/12-core Cortex-R52 Super-Integration Processor targets Software-Defined Vehicles (SDV) appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/18/nxp-s32n79-octa-core-arm-cortex-a78e-12-core-cortex-r52-super-integration-processor-targets-software-defined-vehicles-sdv/",
    "categories": [
      "Hardware",
      "Semiconductors"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-18T06:51:23.435423"
  },
  {
    "title": "Olimex ESP32-P4-PC board offers HDMI video output, Ethernet, four USB 2.0 ports, and more",
    "summary": "Based on an Espressif Systems ESP32-P4NRW32 SoC with a 400 MHz dual-core RISC-V CPU, 768 KB RAM, and 32MB PSRAM, Olimex ESP32-P4-PC is one of the most feature-rich ESP32-P4 boards on the market so far. The open-source hardware board features 16 MB SPI flash, HDMI and MIPI DSI display interfaces, a MIPI CSI camera interface, a 3.5mm audio jack, Fast Ethernet, and four USB 2.0 ports, as well as a UEXT connector and a 20-pin GPIO header for expansion. It takes power from a USB Type-C port, a LiPo battery, or PoE through an add-on board. Olimex ESP32-P4-PC specifications: SoC Espressif Systems ESP32-P4NRW32 CPU Dual-core 32-bit RISC-V HP (High-performance) CPU @ up to 400 MHz with AI instructions extension and single-precision FPU Single-RISC-V LP (Low-power) MCU core @ up to 40 MHz Memory 768 KB HP L2MEM (for dual-core CPU), 32 KB LP SRAM, 8 KB TCM (for LP MCU [...] The post Olimex ESP32-P4-PC board offers HDMI video output, Ethernet, four USB 2.0 ports, and more appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/17/olimex-esp32-p4-pc-board-offers-hdmi-video-output-ethernet-four-usb-2-0-ports-and-more/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 15,
    "processed_date": "2026-02-18T06:51:23.435550"
  },
  {
    "title": "PiBot CNC Pendant V4.0 A handheld Bluetooth and RJ12 controller for FluidNC-based CNC machines",
    "summary": "The PiBot CNC Pendant V4.0 is a handheld Bluetooth/RJ12-based controller designed for CNC machines running FluidNC and GRBL-HAL firmware. Developed by PiBot, with firmware support from ESP3D creator Luc, the pendant provides an interface for manually controlling and monitoring CNC routers, laser engravers, and other GRBL/FluidNC-based systems via RJ12 wired or Bluetooth connection. The device features a capacitive touchscreen, an industrial-grade encoder, a potentiometer knob, a band switch, three independent switches, and a built-in speaker, all housed in an enclosure with a dual-PCB design that allows IO expansion. The pendant operates at 115200 baud over Bluetooth or up to 1,000,000 baud in wired mode, and is powered by a flat-top 18650 battery with onboard charging and power level indication. PiBot CNC Pendant V4.0 specifications: Main Controller ESP32 (No version specification is mentioned) Storage MicroSD card (one-click upgrade via microSD card coming soon) Display Capacitive touch screen; Most [...] The post PiBot CNC Pendant V4.0 A handheld Bluetooth and RJ12 controller for FluidNC-based CNC machines appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/17/pibot-cnc-pendant-v4-0-a-handheld-bluetooth-and-rj12-controller-for-fluidnc-based-cnc-machines/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-18T06:51:23.435676"
  }
]