[
  {
    "title": "MSI's RTX 5060-equipped Cyborg 15 gaming laptop is down to just $899 on Walmart Featuring an Intel Core 7 240H CPU, 16GB of RAM and a 144Hz display",
    "summary": "Unlike most cheap gaming laptops that cut major corners to cram in beefy hardware, the MSI Cyborg 15 gets rid of all the bells and whistles to focus on what's necessary. Its powerful hardware combo, mixed with that 144Hz screen, makes it one of the best budget machines around that can play any game you throw at it.",
    "link": "https://www.tomshardware.com/pc-components/msis-rtx-5060-equipped-cyborg-15-gaming-laptop-is-down-to-just-usd899-on-walmart-featuring-an-intel-core-7-240h-cpu-16gb-of-ram-and-a-144hz-display",
    "categories": [
      "Hardware",
      "GPUs"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.705114"
  },
  {
    "title": "Save up to $40 on Samsung s 800MB/s P9 Express microSD card this Presidents' Day super-speedy storage for your Nintendo Switch 2",
    "summary": "Samsung s P9 Express microSD card delivers up to 800MB/s speeds using PCIe and NVMe, and it s now significantly cheaper on Amazon.",
    "link": "https://www.tomshardware.com/pc-components/microsd-cards/save-up-to-usd40-on-samsungs-800mb-s-p9-express-microsd-card-this-presidents-day-super-speedy-storage-for-your-nintendo-switch-2",
    "categories": [
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.705184"
  },
  {
    "title": "Rufus devs blame Microsoft for blocking latest Windows 11 ISOs, resulting in IP bans Windows Insiders can't download latest Insider ISOs and are met with IP bans",
    "summary": "Multiple Windows Insider users and one of Rufus' developers reveal that they can't download any of Microsoft's latest Insider Preview ISOs. Users who try to are met with an IP block.",
    "link": "https://www.tomshardware.com/software/windows/rufus-developers-blame-microsoft-for-blocking-access-to-the-latest-windows-11-isos-windows-insiders-met-with-an-ip-ban-after-attempting-to-download-latest-builds",
    "categories": [
      "Hardware",
      "Tech News"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-17T06:46:29.705246"
  },
  {
    "title": "SoftBank s $4.2bn OpenAI gain lifts quarterly profits as AI exposure deepens company swings back to profitability in Q3 results",
    "summary": "SoftBank swung back to profitability in its fiscal third quarter, reporting net income of 248.6 billion yuan roughly $1.6 billion for the three months ending December.",
    "link": "https://www.tomshardware.com/tech-industry/softbank-4-2-bn-openai-gain-lifts-quarterly-profit-as-ai-exposure-deepens",
    "categories": [
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.705312"
  },
  {
    "title": "This external disc drive can play 4K 3D Blu-rays, along with all your old CDs and DVDs, now for 43% off TROPRO's media player is just $79.99",
    "summary": "If you've been looking for a way to access your Blu-ray collection on PC without breaking the bank, TROPRO's external disc drive has got you covered. With up to 6X Blu-ray, 8X DVD, and 24X CD read/write speeds, it can play essentially any disc on your computer thanks to its USB 3.0 connection with both Type-A and Type-C plugs.",
    "link": "https://www.tomshardware.com/pc-components/this-external-disc-drive-can-play-4k-3d-blu-rays-along-with-all-your-old-cds-and-dvds-now-for-43-percent-off-tropros-media-player-is-just-usd79-99",
    "categories": [
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.705423"
  },
  {
    "title": "The Father of Sega Hardware' has passed away, designed all of Sega's consoles Hideki Sato worked his way up from engineer to become Sega s acting president, spending 33 years at the company",
    "summary": "Hideki Sato, the Father of Sega Hardware,' passed away just ahead of the weekend.",
    "link": "https://www.tomshardware.com/video-games/console-gaming/the-father-of-sega-hardware-has-passed-away-hideki-sato-worked-his-way-up-from-engineer-to-become-segas-acting-president-spending-33-years-at-the-company",
    "categories": [
      "Hardware"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.705505"
  },
  {
    "title": "The future of Quantum computing the tech, companies, and roadmaps that map out a coherent quantum future",
    "summary": "In this roadmap, we analyze what the future of Quantum Computing might look like over the next decade, including the future of qubit scaling, trapped ions, and superconducting chips.",
    "link": "https://www.tomshardware.com/tech-industry/quantum-computing/the-future-of-quantum-computing-the-tech-companies-and-roadmaps-that-map-out-a-coherent-quantum-future",
    "categories": [
      "Semiconductors"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.705555"
  },
  {
    "title": "Corsair AI Workstation 300 review: Strix Halo sets sail in a compact and classy (but pricey) package",
    "summary": "Corsair s AI Workstation 300 wraps up AMD s popular Strix Halo platform in a compact and classy chassis that delivers all of that chip s performance potential, along with plenty of connectivity options for general PC use. But a recent price hike and stiff competition in the local AI market from Nvidia GB10 systems make it a tougher sell than it once was.",
    "link": "https://www.tomshardware.com/pc-components/gpus/corsair-ai-workstation-300-review",
    "categories": [
      "Hardware",
      "GPUs"
    ],
    "quality_score": 15,
    "processed_date": "2026-02-17T06:46:29.705625"
  },
  {
    "title": "IBM triples entry-level hires for 2026 despite AI adoption, bucking industry trends Chief HR officer says that AI can do most entry-level jobs, but work still requires a human touch",
    "summary": "IBM is tripling its entry-level hiring in the U.S. in 2026, according to a new report. This stands in stark contrast to many of the country s largest firms, especially in the tech world, which have conducted large-scale layoffs.",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/ibm-triples-entry-level-hires-for-2026-despite-ai-adoption-bucking-industry-trends-chief-hr-officer-says-that-ai-can-do-most-entry-level-jobs-but-work-still-requires-a-human-touch",
    "categories": [
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.705682"
  },
  {
    "title": "BenQ Mobiuz EX271UZ 27-inch 240 Hz 4K OLED gaming monitor review: BenQ shines with its first gaming OLED monitor",
    "summary": "BenQ rocks out its first-ever OLED gaming monitor with the Mobiuz EX271UZ. It s a 27-inch 4K panel with Quantum Dot color, 240 Hz, Adaptive-Sync, HDR400 and a few unique features.",
    "link": "https://www.tomshardware.com/monitors/gaming-monitors/benq-mobiuz-ex271uz-27-inch-240-hz-4k-oled-gaming-monitor-review",
    "categories": [
      "Hardware",
      "GPUs"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-17T06:46:29.705732"
  },
  {
    "title": "LaserPecker LX2 review: Large scale dual laser cutter",
    "summary": "Excellent cutting with the 40W diode and engraving with the 2W IR laser, let down by inconsistent positioning and measuring probe.",
    "link": "https://www.tomshardware.com/maker-stem/laserpecker-lx2-review-large-scale-dual-laser-cutter",
    "categories": [
      "Hardware",
      "Tech News"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.705780"
  },
  {
    "title": "Turkish wedding party receives Nvidia RTX 5090, RAM necklaces, and Intel CPU for elaborate wedding gifts A Turkish tech delight for the age of PC shortages",
    "summary": "A video from a Turkish wedding reveals a delighted bride and groom being showered with opulent PC tech gifts.",
    "link": "https://www.tomshardware.com/pc-components/ddr5/turkish-wedding-party-receive-rtx-5090-ram-and-intel-cpu-wedding-gifts-a-turkish-tech-delight-for-the-ai-age",
    "categories": [
      "Hardware",
      "GPUs"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.705828"
  },
  {
    "title": "$5,000 RTX 5090 Lightning Z gets killed in extreme overclocking attempt, thermal shock cracks the GPU core MSI's 2,500-Watt XOC BIOS pushed too high a voltage to the core",
    "summary": "In a sudden moment of thermal shock, a $5,000 RTX 5090 ended up cracking under pressure when too much voltage was pushed to the core at once. The dead card aided in achieving a world record in Geekbench 5 GPU Compute before, with the help of liquid nitrogen.",
    "link": "https://www.tomshardware.com/pc-components/gpus/usd5-000-rtx-5090-lightning-z-gets-killed-in-extreme-overclocking-attempt-cracking-the-gpu-msis-2-500-watt-xoc-bios-pushed-too-high-a-voltage-to-the-core",
    "categories": [
      "GPUs",
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.705887"
  },
  {
    "title": "Western Digital is already sold out of hard drives for all of 2026 chief says some long-term agreements for 2027 and 2028 already in place",
    "summary": "Western Digital's production for 2026 is completely earmarked for its top seven customers, with a few long-term agreements already in place for the next couple of years.",
    "link": "https://www.tomshardware.com/pc-components/hdds/western-digital-is-already-sold-out-of-hard-drives-for-all-of-2026-chief-says-some-long-term-agreements-for-2027-and-2028-already-in-place",
    "categories": [
      "Semiconductors"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.705937"
  },
  {
    "title": "60W Pocket Cloud is a microSD card reader with USB PD passthrough for your smartphone (Crowdfunding)",
    "summary": "60W Pocket Cloud is a microSD card reader with 60W USB PD passthrough for your smartphone that works with Android (USB-C) and iOS (USB-C or Lightning) mobile devices, as well as other hosts with a spare USB port. Once upon a time, smartphone manufacturers would include a microSD card socket in their devices, but those have now become harder to find. If your device s spare storage is getting dangerously low, you d need to either purchase cloud storage or connect a microSD card reader to the USB-C port of your phone. The latter works, except you can t charge your phone when it s connected. Conner s 60W Pocket Cloud brings back microSD card storage support to mobile devices, while still allowing USD PD charging during use. 60W Pocket Cloud specifications: Chipset Vinpower iVP309 flash controller chip with 2x USB 3.2 Gen 1 (5 Gbps), SD 3.0 UHS-I, SDCX SD card interface, USB [...] The post 60W Pocket Cloud is a microSD card reader with USB PD passthrough for your smartphone (Crowdfunding) appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/17/60w-pocket-cloud-microsd-card-reader-for-your-smartphone-with-usb-pd-passthrough/",
    "categories": [
      "Tech News",
      "Hardware"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-17T06:46:29.706337"
  },
  {
    "title": "DShanPi-A1 AI Education Rockchip RK3576 SBC features HDMI input and output ports, dual GbE",
    "summary": "DshanPi-A1 AI Education is a single board computer (SBC) powered by a Rockchip RK3576 octa-core Cortex-A72/A53 SoC, and paired with up to 8GB RAM and 64GB eMMC flash, which I first discovered in the Linux 6.19 changelog. The board features HDMI 2.1 video output, a mini HDMI video input port, a MIPI DSI display interface, two MIPI CSI connectors for up to four cameras, dual GbE, an M.2 Key-E socket for WiFi and Bluetooth, a few USB ports, and a 40-pin GPIO header compatible with some Raspberry Pi HAT boards. DShanPi-A1 specifications: SoC Rockchip RK3576 CPU Octa-core CPU with 4x Cortex-A72 cores at 2.2 GHz, 4x Cortex-A53 cores at 2.0 GHz (1.6GHz for Industrial and Automotive) GPU Arm Mali-G52 MC3 GPU with support for OpenGL ES 1.1, 2.0, and 3.2, OpenCL 2.0, and Vulkan 1.2 NPU 6 TOPS (INT8) AI accelerator with support for INT4, INT8, [...] The post DShanPi-A1 AI Education Rockchip RK3576 SBC features HDMI input and output ports, dual GbE appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/17/dshanpi-a1-ai-education-rockchip-rk3576-sbc-features-hdmi-input-and-output-ports-dual-gbe/",
    "categories": [
      "Hardware",
      "Semiconductors"
    ],
    "quality_score": 10,
    "processed_date": "2026-02-17T06:46:29.706455"
  },
  {
    "title": "Project Aura A neat, easy-to-assemble, DIY Air quality monitor compatible with Home Assistant",
    "summary": "Project Aura is an ESP32 based DIY air quality monitor that combines a touchscreen display and industrial sensors. It is fully integrated with the Home Assistant open-source home automation platform. The words DIY and open source often imply manufacturing the board yourself and soldering components, but that s not the case for Project Aura. It s based on off-the-shelf components connected through cables without any soldering requirements, while the enclosure can be 3D printed. The firmware is equally easy to install through a one-click web installer. Project Aura key components: Waveshare ESP32-S3-Touch-LCD-4.3 ESP32-S3 board with 16MB flash, 4.3-inch IPS display (800 480) with capacitive touch. Similar to the ESP32-S3-Touch-LCD-4.3B but using PH2.0 connectors instead of a terminal block for I/Os Sensirion SEN66 + Adafruit breakout for data capture PM1, PM2.5, PM4, PM10 particle levels (full spectrum of particles from smoke to pollen) CO2, VOC, and NOx for air freshness, volatile chemicals, and exhaust [...] The post Project Aura A neat, easy-to-assemble, DIY Air quality monitor compatible with Home Assistant appeared first on CNX Software - Embedded Systems News .",
    "link": "https://www.cnx-software.com/2026/02/16/project-aura-a-neat-easy-to-assemble-diy-air-quality-monitor-compatible-with-home-assistant/",
    "categories": [
      "Hardware",
      "AI & ML"
    ],
    "quality_score": 5,
    "processed_date": "2026-02-17T06:46:29.706575"
  }
]